Wang860503/nrf5340_discrete_rfid/src/main.c
/*
 * 針對 SAADC 飽和壓低載波 Duty 14 調優版：
 * 1. raw edge 仍過濾 125kHz 載波殘留，避免直接進解碼
 * 2. 包絡密度保留全部 COMP edge，用 window 聚合後產生 Manchester tick
 */

#include <errno.h>
#include <hal/nrf_comp.h>
#include <hal/nrf_gpio.h>
#include <hal/nrf_timer.h>
#include <limits.h>
#include <nrfx_comp.h>
#include <nrfx_pwm.h>
#include <nrfx_saadc.h>
#include <stdio.h>
#include <string.h>
#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <zephyr/drivers/comparator.h>
#include <zephyr/drivers/comparator/nrf_comp.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/irq.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>

LOG_MODULE_REGISTER(rfid_main);

/* ==================== 解碼模式切換 ==================== */
#define DECODE_MODE_ASK 0
#define DECODE_MODE_FSK 1

/* 0=ASK envelope；1=FSK 過零點頻率 */
#define ACTIVE_DECODE_MODE DECODE_MODE_FSK

#if ACTIVE_DECODE_MODE == DECODE_MODE_FSK
/* 256µs（4×64µs 視窗）滑動總和門檻：12.5kHz 約 6.4 次、15.6kHz 約 8 次 */
#define FSK_CROSS_THRESHOLD 7

static int fsk_window_crosses;
static int16_t last_fsk_sample;
#endif
/* ====================================================== */

#define RFID_PWM_TOP 64U
/* UP_AND_DOWN + INDIVIDUAL；對齊 EFM32 TIMER DTI（rise/fall dead time） */
#define RFID_PWM_DTI_ENABLE 1
#define RFID_PWM_DTI_CENTER (RFID_PWM_TOP / 2U)
#define RFID_PWM_DTI_EDGE_GUARD 4U
/* 兩路皆低的最小關斷窗（4 tick @ 16MHz ≈ 250ns），防 ch_a/ch_b 交叉與
 * shoot-through */
#define RFID_PWM_DTI_MIN_GAP 4U
#define RFID_PWM_DTI_DUTY_MAX 22U
/* Dead Time Optimization：rise/fall 可分開（對齊 EFR DTI）。
 * 16MHz PWM → 1 tick = 62.5ns；8 ticks ≈ 500ns。 */
#define RFID_PWM_DTI_DEAD_RISE_TICKS 5U
#define RFID_PWM_DTI_DEAD_FALL_TICKS 5U
/* 五檔 rise/fall A/B：每段固定秒數輪巡（靠卡測 bad/clip 用） */
#define RFID_PWM_DTI_AB_SCAN_ENABLE 0
#define RFID_PWM_DTI_AB_SCAN_INTERVAL_MS 10000U
/* 1=僅 header 9 個 1 全對才噴 SUCCESS/ID */
#define RFID_SAADC_REQUIRE_HEADER_CLEAN 0
/* 0=width 跟 duty 線性（恢復 duty16 0% clip 甜點）；1=強制偶數 width */
#define RFID_PWM_DTI_WIDTH_EVEN_ALIGN 0
/* EFR-like：duty → width（能量）映射 */
#define RFID_PWM_DTI_WIDTH_REF 24U
#define RFID_PWM_DTI_WIDTH_MAX 28U
/* 舊線性縮放參考（DTI 關閉時使用） */
#define RFID_PWM_CH_A_REF 23U
#define RFID_PWM_CH_B_REF 39U
#define RFID_PWM_DUTY_REFERENCE 10U
#define RFID_PWM_DUTY_MIN 8U
#if RFID_PWM_DTI_ENABLE
#define RFID_PWM_DUTY_MAX RFID_PWM_DTI_DUTY_MAX
#else
#define RFID_PWM_DUTY_MAX 22U
#endif
#define RFID_PWM_CH_A RFID_PWM_CH_A_REF
#define RFID_PWM_CH_B RFID_PWM_CH_B_REF
#define RFID_CLK_P_PIN NRF_GPIO_PIN_MAP(1, 9)
#define RFID_CLK_N_PIN NRF_GPIO_PIN_MAP(1, 10)
/* DK Arduino A0/A1 → AIN0/AIN1（P0.04 / P0.05） */
#define RFID_RX_AIN0_PIN NRF_GPIO_PIN_MAP(0, 4)
#define RFID_RX_AIN1_PIN NRF_GPIO_PIN_MAP(0, 5)
/* 第四招：COMP/SAADC 前重設 PIN_CNF（類比腳 INPUT_DISCONNECT + 可選 DRIVE）
 * 2.8V 總攻：這一招先暫停，避免變因太多。 */
#define RFID_COMP_RX_GPIO_PINCNF_ENABLE 0
#if defined(GPIO_PIN_CNF_DRIVE_E0E1)
#define RFID_COMP_RX_GPIO_DRIVE NRF_GPIO_PIN_E0E1
#else
#define RFID_COMP_RX_GPIO_DRIVE NRF_GPIO_PIN_S0S1
#endif
/* 量產主路徑：SAADC 差動；改 0 可切回 COMP 診斷（nrfx 直連） */
#define RFID_USE_SAADC_RECEIVER 1
/* COMP：nRF5340 僅 TIMER0–2；用 TIMER1 @ 1MHz（TIMER2 常被 Zephyr timing 使用）
 */
#if !RFID_USE_SAADC_RECEIVER
#define RFID_USE_HIGH_RES_TIMER 1
#if defined(NRF_TIMER1)
#define RFID_HIGH_RES_TIMER NRF_TIMER1
#elif defined(NRF_TIMER1_NS)
#define RFID_HIGH_RES_TIMER NRF_TIMER1_NS
#else
#define RFID_HIGH_RES_TIMER NRF_TIMER0
#endif
#endif
/* 1=啟用 COMP 擷取 + EdgeCap；tick 來源見 RFID_COMP_TICK_SOURCE */
#define RFID_COMP_DIRECT_EDGE_DECODE 1
/* tick 來源：ENV=128µs 包絡跳變（有 305/610µs，可分出 1T/2T）
 * DEBOUNCE=每 N µs 抽樣 CMP（間隔幾乎全為 1T，難解 EM4100） */
#define RFID_COMP_TICK_SOURCE_ENV 0
#define RFID_COMP_TICK_SOURCE_DEBOUNCE 1
#define RFID_COMP_TICK_SOURCE RFID_COMP_TICK_SOURCE_ENV
#define RFID_COMP_DEBOUNCE_TICK_US 256U
/* 直接邊緣模式下：短/長半週期容許範圍（µs），含 RF/64 和 RF/96 */
#define RFID_COMP_DIRECT_SHORT_MIN_US 200U
#define RFID_COMP_DIRECT_SHORT_MAX_US 480U
#define RFID_COMP_DIRECT_LONG_MIN_US 500U
#define RFID_COMP_DIRECT_LONG_MAX_US 1100U
/* 至少需要這麼多邊緣才視為卡在場（200ms 捕獲，RF/96 約 520 個邊緣） */
#define RFID_COMP_DIRECT_CARD_MIN_EDGES 80U
#define RFID_COMP_USE_NRFX_DIRECT \
  1 /* 1=nrfx_comp 滿血（對齊 EFM32 PD3/PD4）；0=Zephyr comparator API */
#define RFID_COMP_USE_INTERNAL_THRESHOLD \
  1 /* 0=DIFF AIN0/AIN1；1=SE AIN0 vs INT1V8 */
#define RFID_COMP_REFSEL COMP_NRF_COMP_REFSEL_INT_1V8
/* 景明哥 COMP 三招（SE INT1V8，1.65V 虛地 / 頂部削平避開） */
/* 2.8V 總攻：回到 th53/63 + sp=LOW，並關閉 isource（基線在 2.8V 條件下更穩） */
#define RFID_COMP_THRESHOLD_DOWN 24U
#define RFID_COMP_THRESHOLD_UP 30U
#define RFID_COMP_SP_MODE NRF_COMP_SP_MODE_LOW
#define RFID_COMP_ISOURCE NRF_COMP_ISOURCE_OFF
/* 第三招：關閉電流源（OFF） */
#define RFID_SAADC_CHANNEL_INDEX 0U
#define RFID_SAADC_SAMPLE_HZ 62500UL
#define RFID_SAADC_INTERNAL_TIMER_HZ 16000000UL
#define RFID_SAADC_TIMER_CC \
  (RFID_SAADC_INTERNAL_TIMER_HZ / RFID_SAADC_SAMPLE_HZ)
#define RFID_SAADC_ENV_WINDOW_US 64U
#define RFID_SAADC_SAMPLES_PER_WINDOW \
  ((RFID_SAADC_SAMPLE_HZ * RFID_SAADC_ENV_WINDOW_US) / 1000000UL)
#define RFID_SAADC_TARGET_WINDOWS \
  ((RFID_CAPTURE_WINDOW_MS * 1000U) / RFID_SAADC_ENV_WINDOW_US)
#define RFID_SAADC_BUFFER_SIZE 256U
#define RFID_SAADC_BUFFER_COUNT 2U
#define RFID_SAADC_MIN_RANGE_COUNTS 12
#define RFID_SAADC_CARD_MIN_ABS_AVG 200U
#define RFID_SAADC_CLIP_LEVEL 4090
/* 量產：硬體 47k+100pF 線性化後，RSHIFT=0、門檻 50% 正中 */
#define RFID_SAADC_SAMPLE_RSHIFT 0
#define RFID_SAADC_ENV_THRESHOLD_PCT 35U
#define RFID_SAADC_CARD_MIN_ABS_AVG_ACTIVE \
  (RFID_SAADC_CARD_MIN_ABS_AVG >> RFID_SAADC_SAMPLE_RSHIFT)
#define RFID_SAADC_CLIP_LEVEL_ACTIVE \
  (RFID_SAADC_CLIP_LEVEL >> RFID_SAADC_SAMPLE_RSHIFT)
#define RFID_SAADC_ENV_PP_CAP_ACTIVE \
  (RFID_SAADC_ENV_PP_CAP >> RFID_SAADC_SAMPLE_RSHIFT)
#define RFID_SAADC_MAX_CLIP_PERCENT 5U
#define RFID_SAADC_SAT_ENV_ENABLE 1
#define RFID_SAADC_ENV_PP_CAP 2800
#define RFID_SAADC_DECODE_ENABLE 1
#define RFID_SAADC_STRICT_MANCHESTER_ONLY 1
/* strict 下允許 frame_bad≤此值時改走 parity 容錯解碼器（量產抗噪） */
#define RFID_SAADC_STRICT_MAX_BAD_PAIRS 8U
/* 1=日常／量產：僅 [CARD_READY]、啟動摘要、錯誤、SAADC 飽和警示 */
#define RFID_LOG_MINIMAL 1

#if RFID_LOG_MINIMAL
#define RFID_SAADC_LOG_IMPORTANT_ONLY 1
#define RFID_SAADC_VERBOSE_ENV_LOG 0
#define RFID_DECODE_DIAG_LOG 1
#define RFID_VOTE_DIAG_LOG 0
#define RFID_RX_CAPTURE_STATS_LOG 0
#define RFID_MAIN_IDLE_LOG 0
#define RFID_BOOT_SELFTEST_LOG 0
#else
#define RFID_SAADC_LOG_IMPORTANT_ONLY 0
#define RFID_SAADC_VERBOSE_ENV_LOG 1
#define RFID_DECODE_DIAG_LOG 1
#define RFID_VOTE_DIAG_LOG 1
#define RFID_RX_CAPTURE_STATS_LOG 1
#define RFID_MAIN_IDLE_LOG 1
#define RFID_BOOT_SELFTEST_LOG 1
#endif

/* delta/phase 已逼近邊界時，允許少量 parity 誤差先吐碼觀察。 */
#define RFID_EM4100_ROW_PARITY_TOLERANCE 0
#define RFID_EM4100_COL_PARITY_TOLERANCE 0
/* 每段 capture 前 N 樣本學習差動 DC，之後扣除 */
#define RFID_SAADC_DC_BIAS_ENABLE 0
#define RFID_SAADC_DC_BIAS_LEARN_SAMPLES 5000U
/* RF/96 確認；SAADC Manchester 也縮小到 704..832 */
#define RFID_SAADC_MANCHESTER_HALF_MIN_Q8 896U
#define RFID_SAADC_MANCHESTER_HALF_MAX_Q8 1152U
/* 步長加大：448..896 範圍粗掃，縮短全域相位搜尋時間 */
#define RFID_SAADC_MANCHESTER_HALF_STEP_Q8 64U
/* bad 波動主因：phase 採樣邊界；coarse 步距加大加速 FSK/ASK 解碼 */
#define RFID_SAADC_MANCHESTER_OFFSET_STEP_Q8 64U
/* 1=上一輪最佳 (half,phase) ±窗口，避免每輪從 0 掃描造成 bad 飄移 */
#define RFID_SAADC_PHASE_TRACK_ENABLE 1
#define RFID_SAADC_PHASE_TRACK_WINDOW_Q8 64U
/* lock 後僅在 tracked±半徑內掃 half/phase，避免 384 全窗搶走 400 鎖相 */
#define RFID_SAADC_PHASE_LOCK_NARROW 1
/* 新 bad 須優於 lock 至少此值才換相位（減少 528↔64↔616 跳動） */
#define RFID_SAADC_PHASE_LOCK_HYST_BAD 2
/* ≤此值進 narrow；log 常見 bad=15~17，14 過嚴導致永遠 wide */
#define RFID_SAADC_PHASE_LOCK_MAX_BAD 28U
/* tracked_bad 低於此用 guided wide（半窗+全相位），否則全 half */
#define RFID_SAADC_PHASE_GUIDED_BAD_LT 25
/* 每 N 輪 guided 穿插 1 次全 half 掃描 */
#define RFID_SAADC_PHASE_FULL_WIDE_EVERY 4U
/* 連續 hold 且 bad 仍高 → 解除 lock 做一輪全掃 */
#define RFID_SAADC_PHASE_HOLD_RESCAN_GT 6U
/* 首輪 wide 掃描用較大步距（8），縮短 ~45s 空窗 */
#define RFID_SAADC_PHASE_WIDE_STEP_Q8 8U
/* bad≤18 時加大 refine 半徑（涵蓋 392↔584 帶） */
#define RFID_SAADC_PHASE_REFINE_WIDE_RADIUS_Q8 96U
/* 1=coarse 後在最佳點附近細掃 phase/half */
#define RFID_SAADC_PHASE_REFINE_ENABLE 1
#define RFID_SAADC_PHASE_REFINE_RADIUS_Q8 48U
#define RFID_SAADC_PHASE_REFINE_HALF_RADIUS_Q8 16U
#define RFID_SAADC_PHASE_REFINE_STEP_Q8 2U
/* 0=固定 CH_A_REF，避免 sweep 打斷 phase_lock；收斂後再開 1 微調 */
#define RFID_SAADC_CHA_REF_SWEEP_ENABLE 0
#define RFID_SAADC_CHA_REF_SWEEP_BAD_GT 10
/* 1=UART 輸出 RAW CSV（配合 capture_raw_adc_dump.py）；量產前改回 0 */
#define RFID_SAADC_EXPORT_RAW_WINDOWS 0
#define RFID_SAADC_RAW_DUMP_MAX \
  3U /* 與 capture_raw_adc_dump.py --max-blocks 對齊 */
#define TICK_BUFFER_SIZE 2048
#define EM_DECODED_BITS_CAP 2048

