Wang860503/nrf5340_discrete_rfid/src/main.c
/* --- 🎯 BSP 核心調優區（景明哥硬核對齊版） --- */

/* 128µs 視窗：RF/64 SHORT=2T=256µs=2×128µs, LONG=4T=512µs=4×128µs，
 * 窗口為 SHORT 的整數倍→無量化模糊；比 256µs 窗更能精確分類。 */
#define EM_ENV_WINDOW_US 64
#define EM_ENV_EDGE_MA_TAPS 1
#define EM_ENV_DUTY_SAMPLE_US 8
#define EM_ENV_BOOT_WINDOWS 32
#define EM_ENV_THRESHOLD_X16 0
#define EM_ENV_DUTY_THRESHOLD_X16 1
#define EM_ENV_USE_DUTY_LEVEL 0
#define EM_ENV_STATE_STABLE_WINDOWS 1
#define EM_ENV_BASELINE_WEIGHT 15
#define EM_ENV_MIN_TICK_US 200
#define EM_ENV_LEVEL_CAP 8192
#define EM_ENV_HALF_MIN_WINDOWS 1
#define EM_ENV_HALF_MAX_WINDOWS 8
#define EM_RAW_CARD_MIN_EDGES \
  4200U /* 實測 SE ~4.5k/200ms；原 16500 永遠 gate skip */
#define EM_CARD_MIN_ENV_TRANSITIONS 350U
#define EM_CARD_MIN_ENV_SHORT 120U
#define EM_LEVEL_MAX_FRAME_BAD_PAIRS 24
#define EM_TICK_HALF_MAX_FRAME_BAD_PAIRS 24
#define EM_NOISY_MAX_FRAME_BAD_PAIRS 48
#define EM_FRAC_HALF_MIN_Q8 896U
#define EM_FRAC_HALF_MAX_Q8 1152U
#define EM_FRAC_HALF_STEP_Q8 32U
#define EM_FRAC_OFFSET_STEP_Q8 64U
/* RF/64(512) + RF/96(768) 全覆蓋；步長 64 共7個值: 448,512,576,640,704,768,832
 */
#define EM_DELTA_HALF_MIN_Q8 896U
#define EM_DELTA_HALF_MAX_Q8 1152U
#define EM_DELTA_HALF_STEP_Q8 64U
#define EM_DELTA_OFFSET_STEP_Q8 64U
#define EM_DELTA_MIN_DIFF 1
#define EM_DELTA_TRACK_OFF_WINDOW 12
#define EM_DELTA_SHIFT_LOG_EVERY 5U
#define EM_DELTA_FORCE_INV_ONE 0
#define EM_ALIGN_TARGET_LOW16 0U
#define EM_NEAR_TARGET_MAX_HAM 4U
#define EM_NEAR_TARGET_MAX_DELTA 32
#define EM_NEAR_TARGET_BRUTE_DELTA 64
/* 診斷模式：凍結 delta 參數，連續輸出 raw40 做統計 */
#define EM_DELTA_DEBUG_RAW_MODE 0
#define EM_DELTA_DEBUG_HALF_Q8 280U
#define EM_DELTA_DEBUG_OFF_Q8 64U
#define EM_ENABLE_EDGE_THRESHOLD_SWEEP 0
#define EM_ENABLE_TICK_FALLBACK_DIAG 1
#define EM_EDGE_MIN_US 180 /* 濾 <180us 載波半週（示波器 250us/div 密波） */
/* 128µs 視窗：RF/64 SHORT=2窗≈274µs → num_1t=(274+128)/256=1 半位元 ✓
 *              RF/64 LONG =4窗≈548µs → num_1t=(548+128)/256=2 半位元 ✓ */
#define EM_CLOCK_BASE_1T_US 256U

/* 128µs 視窗量化：RF/64 SHORT=2窗≈274µs, LONG=4窗≈548µs */
#define EM_SHORT_MIN 200 /* 含 RF/64 SHORT ~274µs 下界 */
#define EM_SHORT_MAX 380 /* 1T 上界；>380 視為 2T（含 ~396µs 尷尬間距） */
#define EM_LONG_MIN 381
#define EM_LONG_MAX 1100 /* 含 RF/96 LONG 768µs 上界 */
/* env128 展開：1T=2 半位、2T=4 半位（305→2, 610→4；勿用 ÷128 得 5） */
#define EM_ENV_SHORT_HALVES 4U
#define EM_ENV_LONG_HALVES 8U
#define EM_TICK_SPLIT_NOM_US EM_CLOCK_BASE_1T_US
#define EM_TICK_SPLIT_MAX_US 1900
#define EM_TICK_SPLIT_MAX_PARTS 16
#define EM_TICK_HALFCELL_MIN_US 200
#define EM_TICK_HALFCELL_MAX_US 340
#define EM_TICK_HALFCELL_STEP_US 5
#define EM_TICK_HALFCELL_MAX_REPEAT 6
/* RF/64 半週期≈256µs；勿掃到 420（會把 305/610 都壓成 1T→假低分） */
#define EM_EDGECAP_UNIT_MIN_US 250
#define EM_EDGECAP_UNIT_MAX_US 340
#define EM_EDGECAP_UNIT_STEP_US 8
#define EM_EDGECAP_TOL_MIN_PCT 30
#define EM_EDGECAP_TOL_STEP_PCT 5
#define EM_EDGECAP_TOL_PCT 45
#define EM_EDGECAP_MAX_REPEAT 16
#define EM_EDGECAP_MIN_GAP_US 100
/* unit 以 ~256µs 計（RF/64）：stretched_1T≈384µs, repeat1≈512µs ... */
#define EM_EDGECAP_STRETCHED_1T_MIN_US 350
#define EM_EDGECAP_STRETCHED_1T_MAX_US 600
#define EM_EDGECAP_REPEAT1_MAX_US 620
#define EM_EDGECAP_REPEAT2_MAX_US 900
#define EM_EDGECAP_REPEAT3_MAX_US 1300
#define EM_EDGECAP_REPEAT4_MAX_US 1700
#define EM_EDGECAP_RESCUE_LONG_HALVES 38
#define EM_EDGECAP_RESCUE_BITS 128

/* 保持偵測穩定性的參數 */
#define EM_MIN_STORED_TO_DECODE 300
/* 128µs 窗：有卡時 long 常見 96–120；100 會誤觸 decode_skip */
#define EM_MIN_LONG_TICKS_TO_DECODE 80
/* 同一 raw40 在單次 200ms 擷取窗內至少 N 次才進入 streak */
#define EM_CANDIDATE_CONFIRM_COUNT 5
/* 連續 N 次 pool 確認同一 ID 才對外輸出（通用，不鎖卡號） */
#define EM_ID_STREAK_CONFIRM_COUNT 5
#define EM_CONFIRM_TRACKED_CODES 8
/* 0=少印 [CANDIDATE-*] 雜訊；1=除錯 */
#define EM_CANDIDATE_LOG_VERBOSE 0
#define EM_SELFTEST_CODE 0x0123456789ULL
#define EM_CROSS_SCAN_VOTE_FRAMES 7
#define EM_CROSS_SCAN_VOTE_MAX_FEED_SCORE 26
#define EM_CROSS_SCAN_VOTE_MAX_BAD_PAIRS 10
#define EM_SCAN_VOTE_CANDIDATES 12
#define EM_SCAN_VOTE_MAX_SCORE 30
#define EM_ROW_VOTE_GROUPS 16
#define EM_ROW_VOTE_GROUP_MIN_MATCH_ROWS 8
#define EM_ROW_VOTE_ROWS 10
#define EM_ROW_VOTE_BITS 5
#define EM_ROW_VOTE_DATA_BITS 4
#define EM_ROW_VOTE_DEPTH 7
#define EM_WHOLE_FEED_MIN_CONSENSUS_ROWS 6
#define RFID_CAPTURE_WINDOW_MS_FAST 100
#define RFID_CAPTURE_WINDOW_MS_BALANCED 150
#define RFID_CAPTURE_WINDOW_MS_STABLE 200U
#define RFID_CAPTURE_WINDOW_MS RFID_CAPTURE_WINDOW_MS_STABLE
/* 診斷：驗證 frame 偏移是否只差 ±2 bits。 */
#define RFID_EM4100_SHIFT_SCAN_RADIUS 2
#define EM_SKIP_FIRST_GAP_US 2500
#define EM_MANCHESTER_GAP_HOLD_US 10000
#define EM_MANCHESTER_RESYNC_US 15000

#if !RFID_USE_SAADC_RECEIVER && !RFID_COMP_USE_NRFX_DIRECT
static const struct device* comp_dev = DEVICE_DT_GET(DT_NODELABEL(comp));
#endif
#if !RFID_USE_SAADC_RECEIVER && RFID_COMP_USE_NRFX_DIRECT
static volatile uint32_t comp_nrfx_irq_ready;
static volatile uint32_t comp_nrfx_irq_cross;
static volatile uint32_t comp_nrfx_irq_up;
static volatile uint32_t comp_nrfx_irq_down;
static bool comp_nrfx_armed;
#endif
static const nrfx_pwm_t rfid_pwm = NRFX_PWM_INSTANCE(0);
static nrf_pwm_values_individual_t rfid_seq_values[] = {
    {
#if RFID_PWM_DTI_ENABLE
        /* duty=RFID_PWM_DUTY_REFERENCE 的對齊值：對齊既有能量映射 */
        .channel_0 = (uint16_t)(RFID_PWM_CH_A_REF | 0x8000U),
        .channel_1 = (uint16_t)(RFID_PWM_CH_B_REF | 0x8000U),
#else
        .channel_0 = (uint16_t)(RFID_PWM_CH_A | 0x8000U),
        .channel_1 = (uint16_t)(RFID_PWM_CH_B | 0x8000U),
#endif
        .channel_2 = 0,
        .channel_3 = 0,
    },
};
static const nrf_pwm_sequence_t rfid_seq = {
    .values.p_individual = rfid_seq_values,
    .length = NRF_PWM_VALUES_LENGTH(rfid_seq_values),
    .repeats = 0,
    .end_delay = 0,
};

static uint32_t tick_buffer[TICK_BUFFER_SIZE];
static uint8_t tick_edge_to_level[TICK_BUFFER_SIZE];
#if RFID_COMP_DIRECT_EDGE_DECODE
/* env128：僅在高分/近目標時記住 Manchester 極性 inv */
static bool comp_phase_valid;
static int comp_last_best_inv;
#define COMP_PHASE_LOCK_MAX_SCORE 6
#endif
static uint8_t edgecap_half_bits[EM_DECODED_BITS_CAP];
static uint16_t edgecap_half_tick_idx[EM_DECODED_BITS_CAP];
static uint8_t edgecap_half_sub_idx[EM_DECODED_BITS_CAP];
static uint8_t dec_raw_bits[EM_DECODED_BITS_CAP];
static uint8_t dec_pair_bad[EM_DECODED_BITS_CAP];
static uint16_t dec_bad_prefix[EM_DECODED_BITS_CAP + 1];
static uint16_t dec_bit_half_pos[EM_DECODED_BITS_CAP];
static uint8_t em_delta_best_bits_snapshot[EM_DECODED_BITS_CAP];
static uint8_t em_delta_inv_bits[EM_DECODED_BITS_CAP];
static uint8_t env_edge_samples[EM_ENV_LEVEL_CAP];
/* 邊緣計時解碼器專用緩衝區 */
static int16_t em_et_edge_pos[800]; /* edge window 位置 */
static int8_t em_et_edge_dir[800];  /* +1=rising, -1=falling */
static uint8_t em_et_bits[800];     /* 解碼後 bit 串 */
static uint8_t env_level_samples[EM_ENV_LEVEL_CAP];
#if ACTIVE_DECODE_MODE == DECODE_MODE_FSK
static uint8_t fsk_cross_history[EM_ENV_LEVEL_CAP];
#endif
static int16_t adc_window_avg_samples[EM_ENV_LEVEL_CAP];
static int16_t adc_window_pp_samples[EM_ENV_LEVEL_CAP];
static int16_t adc_window_signed_samples[EM_ENV_LEVEL_CAP];
static int em_delta_tracked_frame_off = -1;
static uint8_t em_delta_shift_log_div;

static uint16_t reverse16(uint16_t value) {
  uint16_t reversed = 0U;
  for (int i = 0; i < 16; i++) {
    reversed = (uint16_t)((reversed << 1) | (value & 1U));
    value >>= 1;
  }
  return reversed;
}

