Wang860503/nrf5340_discrete_rfid/src/main.c
typedef enum {
  RFID_SAADC_ENV_MODE_ABS = 0,
  RFID_SAADC_ENV_MODE_PP,
  RFID_SAADC_ENV_MODE_SIGNED,
  RFID_SAADC_ENV_MODE_BLEND,
  RFID_SAADC_ENV_MODE_PP_CAP_BLEND,
} rfid_saadc_env_mode_t;

/* 五檔相位對焦矩陣：{6,8}/{8,6} 補 MOSFET 充放電不對稱；{8,8} 基線；{7,9}/{9,7}
 * 微調 */
#define TEST_RISE_FALL_PAIRS_COUNT 5

typedef struct {
  uint8_t rise;
  uint8_t fall;
} rfid_dti_profile_t;

static const rfid_dti_profile_t dti_profiles[TEST_RISE_FALL_PAIRS_COUNT] = {
    {6U, 8U}, {8U, 6U}, {8U, 8U}, {7U, 9U}, {9U, 7U},
};

static rfid_saadc_env_mode_t rfid_saadc_active_env_mode =
    RFID_SAADC_ENV_MODE_ABS;
static uint16_t rfid_saadc_buffers[RFID_SAADC_BUFFER_COUNT]
                                  [RFID_SAADC_BUFFER_SIZE];
static bool pwm_ready;
static bool carrier_running;
static uint8_t rfid_pwm_active_duty = RFID_PWM_DUTY_REFERENCE;
static uint8_t rfid_pwm_dead_rise_ticks = RFID_PWM_DTI_DEAD_RISE_TICKS;
static uint8_t rfid_pwm_dead_fall_ticks = RFID_PWM_DTI_DEAD_FALL_TICKS;
/* 運行時 CH_A 相位（RFID_PWM_CH_A_REF 為預設）；sweep 時微調載波/取樣對齊 */
static uint8_t rfid_pwm_ch_a_ref_runtime = RFID_PWM_CH_A_REF;
#if RFID_SAADC_PHASE_TRACK_ENABLE
static bool rfid_saadc_phase_valid;
static uint32_t rfid_saadc_tracked_half_q8;
static uint32_t rfid_saadc_tracked_phase_q8;
static int rfid_saadc_tracked_bad = 1000;
static int rfid_saadc_tracked_score = 1000;
static uint8_t rfid_saadc_phase_hold_streak;
static uint8_t rfid_saadc_wide_round;
#endif
static volatile uint32_t rfid_saadc_target_windows = RFID_SAADC_TARGET_WINDOWS;
static bool rfid_saadc_ready;
static bool rfid_saadc_irq_connected;
static volatile bool rfid_saadc_capture_done;
static volatile uint32_t rfid_saadc_raw_samples;
static volatile uint32_t rfid_saadc_sample_errors;
static volatile uint32_t rfid_saadc_clip_samples;
static volatile uint32_t rfid_saadc_clip_pos_samples;
static volatile uint32_t rfid_saadc_clip_neg_samples;
static volatile uint32_t rfid_saadc_next_buffer;
static volatile uint32_t rfid_saadc_window_samples;
static volatile uint32_t rfid_saadc_window_abs_sum;
static volatile int16_t rfid_saadc_window_min;
static volatile int16_t rfid_saadc_window_max;
static volatile int32_t rfid_saadc_window_signed_sum;
static volatile uint32_t rfid_saadc_raw_abs_sum;
static volatile int32_t rfid_saadc_raw_sum;
static volatile int16_t rfid_saadc_raw_min;
static volatile int16_t rfid_saadc_raw_max;
static volatile int rfid_saadc_env_level_count;
#if RFID_SAADC_DC_BIAS_ENABLE
static int32_t saadc_dc_bias_accumulator;
static uint32_t saadc_dc_bias_sample_count;
static int16_t saadc_dc_offset;
#endif
static uint64_t confirm_candidate_codes[EM_CONFIRM_TRACKED_CODES];
static uint8_t confirm_candidate_counts[EM_CONFIRM_TRACKED_CODES];
static uint64_t em4100_streak_id;
static uint8_t em4100_streak_count;
static uint64_t em4100_latched_ready_id;
static uint8_t cross_scan_vote_ones[64];
static uint8_t cross_scan_vote_frames;
static bool row_vote_group_used[EM_ROW_VOTE_GROUPS];
static uint16_t row_vote_keys[EM_ROW_VOTE_GROUPS];
static uint8_t row_vote_seed_nibbles[EM_ROW_VOTE_GROUPS][EM_ROW_VOTE_ROWS];
static uint8_t row_vote_feed_nibbles[EM_ROW_VOTE_GROUPS][EM_ROW_VOTE_DEPTH]
                                    [EM_ROW_VOTE_ROWS];
static uint8_t row_vote_ones[EM_ROW_VOTE_GROUPS][EM_ROW_VOTE_ROWS]
                            [EM_ROW_VOTE_DATA_BITS];
static uint8_t row_vote_counts[EM_ROW_VOTE_GROUPS][EM_ROW_VOTE_ROWS];

typedef struct {
  bool used;
  uint8_t bits[64];
  const char* source;
  int score;
  int bad;
  int origin;
  int inv;
  uint64_t code;
} scan_vote_candidate_t;

#if RFID_USE_SAADC_RECEIVER
static int rfid_saadc_configure(void);
static void rfid_saadc_capture_reset(void);
static int em4095_try_level_decoders(int env_level_count, const char* frac_tag,
                                     int32_t sample_min, int32_t sample_max);
static int rfid_saadc_decode_from_envelope(int env_level_count,
                                           const char* tag);
#if RFID_SAADC_EXPORT_RAW_WINDOWS
static void rfid_saadc_dump_window_csv(int env_level_count);
#endif
#endif
static int start_carrier_with_pwm(void);

static void carrier_gpio_high_drive_configure(void) {
  nrf_gpio_cfg(RFID_CLK_P_PIN, NRF_GPIO_PIN_DIR_OUTPUT,
               NRF_GPIO_PIN_INPUT_DISCONNECT, NRF_GPIO_PIN_NOPULL,
               NRF_GPIO_PIN_S0S1, NRF_GPIO_PIN_NOSENSE);
  nrf_gpio_cfg(RFID_CLK_N_PIN, NRF_GPIO_PIN_DIR_OUTPUT,
               NRF_GPIO_PIN_INPUT_DISCONNECT, NRF_GPIO_PIN_NOPULL,
               NRF_GPIO_PIN_S0S1, NRF_GPIO_PIN_NOSENSE);
}

/* PWM 停止後強制把輸出鎖到固定電平，避免 nrfx_pwm_stop() 瞬間殘留 */
static void carrier_gpio_force_off(void) {
  nrf_gpio_cfg(RFID_CLK_P_PIN, NRF_GPIO_PIN_DIR_OUTPUT,
               NRF_GPIO_PIN_INPUT_DISCONNECT, NRF_GPIO_PIN_NOPULL,
               NRF_GPIO_PIN_S0S1, NRF_GPIO_PIN_NOSENSE);
  nrf_gpio_pin_clear(RFID_CLK_P_PIN);

  nrf_gpio_cfg(RFID_CLK_N_PIN, NRF_GPIO_PIN_DIR_OUTPUT,
               NRF_GPIO_PIN_INPUT_DISCONNECT, NRF_GPIO_PIN_NOPULL,
               NRF_GPIO_PIN_S0S1, NRF_GPIO_PIN_NOSENSE);
  nrf_gpio_pin_clear(RFID_CLK_N_PIN);
}

#if RFID_COMP_RX_GPIO_PINCNF_ENABLE
static const char* rfid_rx_gpio_drive_name(nrf_gpio_pin_drive_t drive) {
#if defined(GPIO_PIN_CNF_DRIVE_E0E1)
  if (drive == NRF_GPIO_PIN_E0E1) {
    return "E0E1";
  }
#endif
  if (drive == NRF_GPIO_PIN_S0S1) {
    return "S0S1";
  }
  return "other";
}

static void rfid_rx_ain_gpio_configure(void) {
  const nrf_gpio_pin_drive_t drive = RFID_COMP_RX_GPIO_DRIVE;

  /*
   * 類比輸入：數位輸入緩衝關閉、無上下拉；DRIVE 依 PIN_CNF 改變 pad
   * 特性（實測用）。 nRF5340 PS 將 E0E1 標為 extra-high
   * drive，與「低斜率」命名不同，以 comp_edges 為準。
   */
  nrf_gpio_cfg(RFID_RX_AIN0_PIN, NRF_GPIO_PIN_DIR_INPUT,
               NRF_GPIO_PIN_INPUT_DISCONNECT, NRF_GPIO_PIN_NOPULL, drive,
               NRF_GPIO_PIN_NOSENSE);
  nrf_gpio_cfg(RFID_RX_AIN1_PIN, NRF_GPIO_PIN_DIR_INPUT,
               NRF_GPIO_PIN_INPUT_DISCONNECT, NRF_GPIO_PIN_NOPULL, drive,
               NRF_GPIO_PIN_NOSENSE);
}
#endif

static int rfid_pwm_apply_duty(uint8_t duty) {
  uint16_t ch_a;
  uint16_t ch_b;
  uint32_t width;

  if (duty < RFID_PWM_DUTY_MIN) {
    duty = RFID_PWM_DUTY_MIN;
  }
#if RFID_PWM_DTI_ENABLE
  else if (duty > RFID_PWM_DTI_DUTY_MAX) {
    duty = RFID_PWM_DTI_DUTY_MAX;
  }
  /*
   * EFR-like 單旋鈕：duty → 互補間距 width，保留 CH_A_REF 相位偏置。
   * 固定 dead-time ticks；width 線性跟 duty，不偶數修齊。
   */
  width = duty;
#if RFID_PWM_DTI_WIDTH_EVEN_ALIGN
  width = (width + 1U) & ~1U;
#endif
  if (width > (uint32_t)RFID_PWM_DTI_DUTY_MAX) {
    width = (uint32_t)RFID_PWM_DTI_DUTY_MAX;
  }
  if (width < (uint32_t)RFID_PWM_DTI_MIN_GAP) {
    width = (uint32_t)RFID_PWM_DTI_MIN_GAP;
  }

  /* Center-aligned 互補：以 TOP/2 為中心對稱展開 half_width，
   * 再各自扣除/加上 dead time，確保雙臂 ON 時間對稱且不隨 duty 偏移。 */
  {
    uint32_t half_width = (width + 1U) >> 1U;
    uint32_t center = (uint32_t)RFID_PWM_DTI_CENTER;
    ch_a = (uint16_t)(center > half_width ? center - half_width : 0U);
    ch_b = (uint16_t)(center + half_width);
  }

  if (ch_a > rfid_pwm_dead_rise_ticks) {
    ch_a = (uint16_t)(ch_a - rfid_pwm_dead_rise_ticks);
  }
  ch_b = (uint16_t)(ch_b + rfid_pwm_dead_fall_ticks);

  if (ch_a < RFID_PWM_DTI_EDGE_GUARD) {
    ch_a = RFID_PWM_DTI_EDGE_GUARD;
  }
  if (ch_b > (RFID_PWM_TOP - RFID_PWM_DTI_EDGE_GUARD)) {
    ch_b = (uint16_t)(RFID_PWM_TOP - RFID_PWM_DTI_EDGE_GUARD);
  }
  /* 剛性保護：dead-time + width 邊界下仍保留 MIN_GAP，必要時整體平移 */
  if (ch_b <= ch_a + RFID_PWM_DTI_MIN_GAP) {
    ch_b = (uint16_t)(ch_a + RFID_PWM_DTI_MIN_GAP);
  }
  if (ch_b > (RFID_PWM_TOP - RFID_PWM_DTI_EDGE_GUARD)) {
    ch_b = (uint16_t)(RFID_PWM_TOP - RFID_PWM_DTI_EDGE_GUARD);
    ch_a = (uint16_t)(ch_b - RFID_PWM_DTI_MIN_GAP);
    if (ch_a < RFID_PWM_DTI_EDGE_GUARD) {
      ch_a = RFID_PWM_DTI_EDGE_GUARD;
      ch_b = (uint16_t)(ch_a + RFID_PWM_DTI_MIN_GAP);
    }
  }
#else
  else if (duty > RFID_PWM_DUTY_MAX) {
    duty = (uint8_t)RFID_PWM_DUTY_MAX;
  }
  ch_a = (uint16_t)((rfid_pwm_ch_a_ref_runtime * (uint32_t)duty +
                     RFID_PWM_DUTY_REFERENCE / 2U) /
                    RFID_PWM_DUTY_REFERENCE);
  ch_b = (uint16_t)((RFID_PWM_CH_B_REF * (uint32_t)duty +
                     RFID_PWM_DUTY_REFERENCE / 2U) /
                    RFID_PWM_DUTY_REFERENCE);
  if (ch_a < 4U) {
    ch_a = 4U;
  }
  if (ch_b <= ch_a + 2U) {
    ch_b = ch_a + 2U;
  }
  if (ch_b >= RFID_PWM_TOP) {
    ch_b = (uint16_t)(RFID_PWM_TOP - 1U);
  }
#endif

  rfid_seq_values[0].channel_0 = ch_a | 0x8000U;
  rfid_seq_values[0].channel_1 = ch_b | 0x8000U;
  rfid_pwm_active_duty = duty;

  if (carrier_running) {
    (void)nrfx_pwm_stop(&rfid_pwm, true);
    carrier_gpio_force_off();
    carrier_running = false;
  }

  return start_carrier_with_pwm();
}

static void rfid_pwm_apply_dti_profile(size_t index) {
  if (index >= TEST_RISE_FALL_PAIRS_COUNT) {
    index = 0U;
  }
  rfid_pwm_dead_rise_ticks = dti_profiles[index].rise;
  rfid_pwm_dead_fall_ticks = dti_profiles[index].fall;
}

static int start_carrier_with_pwm(void) {
  nrfx_err_t err;

