Wang860503/nrf5340_discrete_rfid/src/main.c
  if (!pwm_ready) {
    nrfx_pwm_config_t const config = {
        .output_pins =
            {
                RFID_CLK_P_PIN, /* P1.09 */
                RFID_CLK_N_PIN, /* P1.10 */
                NRF_PWM_PIN_NOT_CONNECTED,
                NRF_PWM_PIN_NOT_CONNECTED,
            },
        .pin_inverted = {false, false, false, false},
        .irq_priority = NRFX_PWM_DEFAULT_CONFIG_IRQ_PRIORITY,
        .base_clock = NRF_PWM_CLK_16MHz,
        .count_mode = NRF_PWM_MODE_UP_AND_DOWN,
        .top_value = RFID_PWM_TOP,
        .load_mode = NRF_PWM_LOAD_INDIVIDUAL,
        .step_mode = NRF_PWM_STEP_AUTO,
        .skip_gpio_cfg = false,
        .skip_psel_cfg = false,
    };

    err = nrfx_pwm_init(&rfid_pwm, &config, NULL, NULL);
    if (!(err == NRFX_SUCCESS || err == NRFX_ERROR_ALREADY ||
          err == NRFX_ERROR_INVALID_STATE)) {
      LOG_ERR("pwm init failed: %d", err);
      return -EIO;
    }
    carrier_gpio_high_drive_configure();
    pwm_ready = true;
  }

  if (!carrier_running) {
    (void)nrfx_pwm_simple_playback(&rfid_pwm, &rfid_seq, 1, NRFX_PWM_FLAG_LOOP);
    carrier_running = true;
  }

  return 0;
}

static void __attribute__((unused)) stop_carrier_with_pwm(void) {
  if (!pwm_ready || !carrier_running) return;
  (void)nrfx_pwm_stop(&rfid_pwm, true);
  carrier_gpio_force_off();
  carrier_running = false;
}

void invert_bits(uint8_t* bits, int len) {
  for (int i = 0; i < len; i++) {
    bits[i] = !bits[i];
  }
}

int EM4100_Full_Check(uint8_t* bits) {
  for (int j = 0; j < 9; j++)
    if (bits[j] != 1) return 0;
  if (bits[63] != 0) return 0;

  uint8_t col_parity[4] = {0};
  int row_err = 0;
  int col_err = 0;
  for (int row = 0; row < 10; row++) {
    int base = 9 + row * 5;
    int row_sum = 0;
    for (int col = 0; col < 4; col++) {
      uint8_t val = bits[base + col];
      row_sum += val;
      col_parity[col] += val;
    }
    if ((row_sum + bits[base + 4]) % 2 != 0) row_err++;
  }
  for (int col = 0; col < 4; col++) {
    if ((col_parity[col] + bits[59 + col]) % 2 != 0) col_err++;
  }
  if (row_err > RFID_EM4100_ROW_PARITY_TOLERANCE) return 0;
  if (col_err > RFID_EM4100_COL_PARITY_TOLERANCE) return 0;
  return 1;
}

static int em4100_valid_at(const uint8_t* bits, int len, int off) {
  if (off < 0 || off + 64 > len) return 0;
  if (EM4100_Full_Check((uint8_t*)&bits[off])) return 1;
  for (int delta = 1; delta <= RFID_EM4100_SHIFT_SCAN_RADIUS; delta++) {
    int left = off - delta;
    int right = off + delta;
    if (left >= 0 && left + 64 <= len &&
        EM4100_Full_Check((uint8_t*)&bits[left])) {
      return 1;
    }
    if (right >= 0 && right + 64 <= len &&
        EM4100_Full_Check((uint8_t*)&bits[right])) {
      return 1;
    }
  }
  return 0;
}

uint64_t decode_card_code(uint8_t* bits) {
  uint64_t code = 0;
  for (int j = 0; j < 10; j++) {
    unsigned int digit = (bits[9 + 5 * j] << 3) | (bits[9 + 5 * j + 1] << 2) |
                         (bits[9 + 5 * j + 2] << 1) |
                         (bits[9 + 5 * j + 3] << 0);
    code |= ((uint64_t)digit << (4 * (9 - j)));
  }
  return code;
}

static uint8_t env_majority_level(const uint8_t* levels, int start, int width);

static void em4100_build_frame(uint64_t code, uint8_t* bits) {
  uint8_t col_sum[4] = {0};

  memset(bits, 0, 64);

  for (int i = 0; i < 9; i++) {
    bits[i] = 1;
  }

  for (int row = 0; row < 10; row++) {
    int base = 9 + row * 5;
    uint8_t digit = (code >> (4 * (9 - row))) & 0x0F;
    uint8_t row_sum = 0;

    for (int col = 0; col < 4; col++) {
      uint8_t val = (digit >> (3 - col)) & 1U;
      bits[base + col] = val;
      row_sum += val;
      col_sum[col] += val;
    }
    bits[base + 4] = row_sum & 1U;
  }

  for (int col = 0; col < 4; col++) {
    bits[59 + col] = col_sum[col] & 1U;
  }
  bits[63] = 0;
}

static void em4100_decode_self_test(void) {
  uint8_t bits[64];

  em4100_build_frame(EM_SELFTEST_CODE, bits);

  int valid = EM4100_Full_Check(bits);
  uint64_t decoded = decode_card_code(bits);
#if RFID_BOOT_SELFTEST_LOG
  LOG_WRN("[SELFTEST-frame] valid=%d raw40=%010llX", valid,
          (unsigned long long)decoded);
#endif
  if (!valid || decoded != EM_SELFTEST_CODE) {
    LOG_ERR("[SELFTEST-frame] failed");
  }

  uint8_t levels[64 * 4];
  const int half_windows = 2;
  int bad_pairs = 0;

  for (int bit = 0; bit < 64; bit++) {
    uint8_t expected_bit = bits[bit];
    int base = bit * half_windows * 2;

    for (int i = 0; i < half_windows; i++) {
      levels[base + i] = expected_bit ? 0U : 1U;
      levels[base + half_windows + i] = expected_bit;
    }
  }

  memset(dec_raw_bits, 0, EM_DECODED_BITS_CAP);
  for (int bit = 0; bit < 64; bit++) {
    int base = bit * half_windows * 2;
    uint8_t first = env_majority_level(levels, base, half_windows);
    uint8_t second =
        env_majority_level(levels, base + half_windows, half_windows);

    if (first == second) bad_pairs++;
    dec_raw_bits[bit] = second;
  }

  valid = EM4100_Full_Check(dec_raw_bits);
  decoded = decode_card_code(dec_raw_bits);
#if RFID_BOOT_SELFTEST_LOG
  LOG_WRN("[SELFTEST-manchester] valid=%d bad=%d raw40=%010llX", valid,
          bad_pairs, (unsigned long long)decoded);
#endif
  if (!valid || bad_pairs != 0 || decoded != EM_SELFTEST_CODE) {
    LOG_ERR("[SELFTEST-manchester] failed");
  }
}

#if EM_ALIGN_TARGET_LOW16 != 0U
static int em4100_low16_delta(uint16_t low16);
#endif

static int confirm_em4100_candidate(uint64_t code, const char* tag) {
  int slot = -1;
  int replace_slot = 0;
  uint8_t count;

  if (code == 0) {
#if EM_CANDIDATE_LOG_VERBOSE
    LOG_WRN("[CANDIDATE-%s] reject zero raw40", tag);
#endif
    return 0;
  }

#if EM_ALIGN_TARGET_LOW16 != 0U
  if (em4100_low16_delta((uint16_t)(code & 0xFFFFULL)) > 256) {
#if EM_CANDIDATE_LOG_VERBOSE
    LOG_WRN("[CANDIDATE-%s] reject far tgt low16=%04X", tag,
            (uint16_t)(code & 0xFFFFULL));
#endif
    return 0;
  }
#endif

  for (int i = 0; i < (int)ARRAY_SIZE(confirm_candidate_codes); i++) {
    if (confirm_candidate_counts[i] == 0) {
      replace_slot = i;
      break;
    }
    if (confirm_candidate_counts[i] < confirm_candidate_counts[replace_slot]) {
      replace_slot = i;
    }
    if (confirm_candidate_codes[i] == code) {
      slot = i;
      break;
    }
  }

  if (slot < 0) {
    slot = replace_slot;
    confirm_candidate_codes[slot] = code;
    confirm_candidate_counts[slot] = 0;
  }

  if (confirm_candidate_counts[slot] < UINT8_MAX) {
    confirm_candidate_counts[slot]++;
  }
  count = confirm_candidate_counts[slot];

