Wang860503/nrf5340_discrete_rfid/src/main.c
#if EM_CANDIDATE_LOG_VERBOSE
  LOG_WRN("[CANDIDATE-%s] raw40=%010llX low16=%04X pool=%u/%u", tag,
          (unsigned long long)code, (uint16_t)(code & 0xFFFFULL), count,
          EM_CANDIDATE_CONFIRM_COUNT);
#endif

#if EM_ALIGN_TARGET_LOW16 != 0U
  if ((uint16_t)(code & 0xFFFFULL) == EM_ALIGN_TARGET_LOW16) {
    LOG_WRN("[CARD_READY] raw40=%010llX low16=%04X tag=%s (target)",
            (unsigned long long)code, (uint16_t)(code & 0xFFFFULL), tag);
    em4100_streak_id = code;
    em4100_streak_count = EM_ID_STREAK_CONFIRM_COUNT;
    return 1;
  }
#endif

  if (count < EM_CANDIDATE_CONFIRM_COUNT) {
    return 0;
  }

  if (code == em4100_streak_id) {
    if (em4100_streak_count < UINT8_MAX) {
      em4100_streak_count++;
    }
  } else {
    em4100_streak_id = code;
    em4100_streak_count = 1U;
    em4100_latched_ready_id = 0ULL;
  }

  if (em4100_streak_count < EM_ID_STREAK_CONFIRM_COUNT) {
    return 0;
  }

  if (code != em4100_latched_ready_id) {
    LOG_WRN("[CARD_READY] raw40=%010llX low16=%04X pool=%u streak=%u via=%s",
            (unsigned long long)code, (uint16_t)(code & 0xFFFFULL), count,
            em4100_streak_count, tag);
    em4100_latched_ready_id = code;
  }
  return 1;
}

#if EM_ENABLE_TICK_FALLBACK_DIAG
static int count_bad_pairs_in_frame(int off);
static int em4100_frame_error_score(const uint8_t* bits, int off,
                                    int* header_err, int* row_err, int* col_err,
                                    int* stop_err);
static bool em4100_candidate_from_parity(const uint8_t* bits, int off,
                                         uint64_t* out_code,
                                         const char** reason);

static int __attribute__((unused)) try_em4100_slide(const uint8_t* bits,
                                                    int len,
                                                    uint64_t* out_code) {
  if (len < 64) return -1;
  for (int i = 0; i <= len - 64; i++) {
    if (em4100_valid_at(bits, len, i)) {
      *out_code = decode_card_code((uint8_t*)&bits[i]);
      return i;
    }
  }
  return -1;
}
#endif

static int count_bad_pairs_in_frame(int off) {
  int bad = 0;

  for (int i = 0; i < 64; i++) {
    bad += dec_pair_bad[off + i] ? 1 : 0;
  }
  return bad;
}

static int try_em4100_level_slide(const uint8_t* bits, int len,
                                  uint64_t* out_code, int* out_frame_bad) {
  if (len < 64) return -1;

  for (int i = 0; i <= len - 64; i++) {
    if (em4100_valid_at(bits, len, i)) {
      int frame_bad = count_bad_pairs_in_frame(i);
      if (frame_bad <= EM_LEVEL_MAX_FRAME_BAD_PAIRS) {
        *out_code = decode_card_code((uint8_t*)&bits[i]);
        *out_frame_bad = frame_bad;
        return i;
      }
    }
  }
  return -1;
}

static int em4100_frame_error_score(const uint8_t* bits, int off,
                                    int* header_err, int* row_err, int* col_err,
                                    int* stop_err) {
  uint8_t col_parity[4] = {0};

  *header_err = 0;
  *row_err = 0;
  *col_err = 0;
  *stop_err = bits[off + 63] != 0 ? 1 : 0;

  for (int j = 0; j < 9; j++) {
    if (bits[off + j] != 1) (*header_err)++;
  }

  for (int row = 0; row < 10; row++) {
    int base = off + 9 + row * 5;
    int row_sum = 0;
    for (int col = 0; col < 4; col++) {
      uint8_t val = bits[base + col];
      row_sum += val;
      col_parity[col] += val;
    }
    if ((row_sum + bits[base + 4]) % 2 != 0) (*row_err)++;
  }

  for (int col = 0; col < 4; col++) {
    if ((col_parity[col] + bits[off + 59 + col]) % 2 != 0) (*col_err)++;
  }

  return (*header_err * 2) + *row_err + *col_err + (*stop_err * 2);
}

static void em4100_log_shift_window(const uint8_t* bits, int len,
                                    int center_off, const char* tag) {
  int lo = center_off - RFID_EM4100_SHIFT_SCAN_RADIUS;
  int hi = center_off + RFID_EM4100_SHIFT_SCAN_RADIUS;

  if (len < 64 || center_off < 0) return;
  if (lo < 0) lo = 0;
  if (hi > len - 64) hi = len - 64;

#if RFID_DECODE_DIAG_LOG
  for (int off = lo; off <= hi; off++) {
    int header_err;
    int row_err;
    int col_err;
    int stop_err;
    int score = em4100_frame_error_score(bits, off, &header_err, &row_err,
                                         &col_err, &stop_err);
    uint64_t code = decode_card_code((uint8_t*)&bits[off]);
    LOG_WRN(
        "[%s_shift off=%d] score=%d hdr=%d row=%d col=%d stop=%d raw40=%010llX",
        tag, off, score, header_err, row_err, col_err, stop_err,
        (unsigned long long)code);
  }
#endif
}

static int find_header_offset(const uint8_t* bits, int len) {
  if (len < 64) return -1;

  for (int i = 0; i <= len - 64; i++) {
    bool match = true;
    for (int j = 0; j < 9; j++) {
      if (bits[i + j] != 1U) {
        match = false;
        break;
      }
    }
    if (match) return i;
  }
  return -1;
}

static bool em4100_header_clean(const uint8_t* bits, int off) {
  for (int j = 0; j < 9; j++) {
    if (bits[off + j] != 1U) {
      return false;
    }
  }
  return true;
}

static void reset_em4100_confirm_pool(void) {
  memset(confirm_candidate_codes, 0, sizeof(confirm_candidate_codes));
  memset(confirm_candidate_counts, 0, sizeof(confirm_candidate_counts));
}

static void reset_em4100_card_session(void) {
  reset_em4100_confirm_pool();
  em4100_streak_id = 0ULL;
  em4100_streak_count = 0U;
  em4100_latched_ready_id = 0ULL;
}

static void reset_cross_scan_vote_pool(void) {
  memset(cross_scan_vote_ones, 0, sizeof(cross_scan_vote_ones));
  cross_scan_vote_frames = 0;
}

static void reset_row_vote_pool(void) {
  memset(row_vote_group_used, 0, sizeof(row_vote_group_used));
  memset(row_vote_keys, 0, sizeof(row_vote_keys));
  memset(row_vote_seed_nibbles, 0, sizeof(row_vote_seed_nibbles));
  memset(row_vote_feed_nibbles, 0, sizeof(row_vote_feed_nibbles));
  memset(row_vote_ones, 0, sizeof(row_vote_ones));
  memset(row_vote_counts, 0, sizeof(row_vote_counts));
}

static void reset_row_vote_group(int group) {
  if (group < 0 || group >= EM_ROW_VOTE_GROUPS) return;
  row_vote_group_used[group] = false;
  row_vote_keys[group] = 0;
  memset(row_vote_seed_nibbles[group], 0, sizeof(row_vote_seed_nibbles[group]));
  memset(row_vote_feed_nibbles[group], 0, sizeof(row_vote_feed_nibbles[group]));
  memset(row_vote_ones[group], 0, sizeof(row_vote_ones[group]));
  memset(row_vote_counts[group], 0, sizeof(row_vote_counts[group]));
}

