Wang860503/nrf5340_discrete_rfid/src/main.c
static uint8_t em4100_row_data_nibble(const uint8_t* bits, int row) {
  uint8_t nibble = 0;
  int base = 9 + row * EM_ROW_VOTE_BITS;

  for (int bit = 0; bit < EM_ROW_VOTE_DATA_BITS; bit++) {
    nibble = (uint8_t)((nibble << 1) | (bits[base + bit] ? 1U : 0U));
  }
  return nibble;
}

static void seed_row_vote_group(int group, const uint8_t* bits, uint16_t key) {
  reset_row_vote_group(group);
  row_vote_group_used[group] = true;
  row_vote_keys[group] = key;
  for (int row = 0; row < EM_ROW_VOTE_ROWS; row++) {
    row_vote_seed_nibbles[group][row] = em4100_row_data_nibble(bits, row);
  }
}

static int row_vote_seed_match_rows(int group, const uint8_t* bits) {
  int matches = 0;

  if (group < 0 || group >= EM_ROW_VOTE_GROUPS || !row_vote_group_used[group]) {
    return 0;
  }

  for (int row = 0; row < EM_ROW_VOTE_ROWS; row++) {
    if (row_vote_seed_nibbles[group][row] ==
        em4100_row_data_nibble(bits, row)) {
      matches++;
    }
  }
  return matches;
}

static void row_vote_bits_to_hex(const uint8_t* bits, char* out_hex) {
  static const char hex[] = "0123456789ABCDEF";

  for (int row = 0; row < EM_ROW_VOTE_ROWS; row++) {
    out_hex[row] = hex[em4100_row_data_nibble(bits, row) & 0x0FU];
  }
  out_hex[EM_ROW_VOTE_ROWS] = '\0';
}

static void row_vote_feed_to_hex(int group, int feed, char* out_hex) {
  static const char hex[] = "0123456789ABCDEF";

  for (int row = 0; row < EM_ROW_VOTE_ROWS; row++) {
    out_hex[row] = hex[row_vote_feed_nibbles[group][feed][row] & 0x0FU];
  }
  out_hex[EM_ROW_VOTE_ROWS] = '\0';
}

static int row_vote_feed_support(int group, int feed, int* consensus_rows) {
  int score = 0;
  int rows_with_majority = 0;

  for (int row = 0; row < EM_ROW_VOTE_ROWS; row++) {
    int support = 0;
    uint8_t nibble = row_vote_feed_nibbles[group][feed][row];

    for (int other = 0; other < EM_ROW_VOTE_DEPTH; other++) {
      if (row_vote_feed_nibbles[group][other][row] == nibble) {
        support++;
      }
    }

    score += support;
    if (support > (EM_ROW_VOTE_DEPTH / 2)) {
      rows_with_majority++;
    }
  }

  if (consensus_rows != NULL) {
    *consensus_rows = rows_with_majority;
  }
  return score;
}

static int row_vote_select_best_feed(int group, int* best_score,
                                     int* best_consensus_rows,
                                     int* runner_up_score) {
  int selected_feed = -1;
  int selected_score = -1;
  int selected_consensus = -1;
  int second_score = -1;

  for (int feed = 0; feed < EM_ROW_VOTE_DEPTH; feed++) {
    int consensus_rows = 0;
    int score = row_vote_feed_support(group, feed, &consensus_rows);

    if (score > selected_score ||
        (score == selected_score && consensus_rows > selected_consensus)) {
      second_score = selected_score;
      selected_score = score;
      selected_consensus = consensus_rows;
      selected_feed = feed;
    } else if (score > second_score) {
      second_score = score;
    }
  }

  if (best_score != NULL) {
    *best_score = selected_score;
  }
  if (best_consensus_rows != NULL) {
    *best_consensus_rows = selected_consensus;
  }
  if (runner_up_score != NULL) {
    *runner_up_score = second_score;
  }
  return selected_feed;
}

static void stitch_row_vote_feed(int group, int feed, uint8_t* stitched) {
  uint8_t col_sum[EM_ROW_VOTE_DATA_BITS] = {0};

  memset(stitched, 0, 64);
  for (int bit = 0; bit < 9; bit++) {
    stitched[bit] = 1U;
  }

  for (int row = 0; row < EM_ROW_VOTE_ROWS; row++) {
    int base = 9 + row * EM_ROW_VOTE_BITS;
    uint8_t nibble = row_vote_feed_nibbles[group][feed][row];
    uint8_t row_sum = 0;

    for (int bit = 0; bit < EM_ROW_VOTE_DATA_BITS; bit++) {
      uint8_t data_bit = (nibble >> (EM_ROW_VOTE_DATA_BITS - 1 - bit)) & 1U;
      stitched[base + bit] = data_bit;
      row_sum += data_bit;
      col_sum[bit] += data_bit;
    }
    stitched[base + 4] = row_sum & 1U;
  }

  for (int col = 0; col < EM_ROW_VOTE_DATA_BITS; col++) {
    stitched[59 + col] = col_sum[col] & 1U;
  }
  stitched[63] = 0U;
}

static void dump_row_vote_nibbles(int group, const char* reason,
                                  const uint8_t* stitched, int header_err,
                                  int row_err, int col_err, int stop_err,
                                  int weak_data_bits, uint64_t code) {
  char final_hex[EM_ROW_VOTE_ROWS + 1];
  char feed_hex[EM_ROW_VOTE_ROWS + 1];

  if (group < 0 || group >= EM_ROW_VOTE_GROUPS) return;

  row_vote_bits_to_hex(stitched, final_hex);

#if RFID_VOTE_DIAG_LOG
  LOG_WRN("============== [NIBBLE-VOTE-DUMP-START] ==============");
  LOG_WRN("[NIBBLE-VOTE-DUMP] reason=%s group=%d seed=%u", reason, group,
          row_vote_keys[group]);
  LOG_WRN(
      "[NIBBLE-VOTE-DUMP] err header=%d row=%d col=%d stop=%d weak=%d "
      "raw40=%010llX low16=%u",
      header_err, row_err, col_err, stop_err, weak_data_bits,
      (unsigned long long)code, (uint16_t)(code & 0xFFFFULL));
  LOG_WRN("[NIBBLE-VOTE-DUMP] final=%s", final_hex);

  for (int feed = 0; feed < EM_ROW_VOTE_DEPTH; feed++) {
    row_vote_feed_to_hex(group, feed, feed_hex);
    LOG_WRN("[NIBBLE-VOTE-DUMP] feed[%d]=%s", feed, feed_hex);
  }
  LOG_WRN("==============  [NIBBLE-VOTE-DUMP-END]  ==============");
#endif
}

static void consider_scan_vote_candidate(scan_vote_candidate_t* candidates,
                                         const uint8_t* bits,
                                         const char* source, int score,
                                         int bad_pairs, int origin, int inv,
                                         uint64_t code) {
  int empty = -1;
  int worst = -1;
  int worst_score = -1;

  if (score > EM_SCAN_VOTE_MAX_SCORE ||
      bad_pairs > EM_CROSS_SCAN_VOTE_MAX_BAD_PAIRS || code == 0) {
    return;
  }

  for (int i = 0; i < EM_SCAN_VOTE_CANDIDATES; i++) {
    if (!candidates[i].used) {
      if (empty < 0) empty = i;
      continue;
    }
    if (candidates[i].code == code) {
      if (score >= candidates[i].score) return;
      empty = i;
      break;
    }
    if (candidates[i].score > worst_score) {
      worst_score = candidates[i].score;
      worst = i;
    }
  }

  if (empty < 0) {
    if (worst < 0 || score >= worst_score) return;
    empty = worst;
  }

