Wang860503/nrf5340_discrete_rfid/src/main.c
  candidates[empty].used = true;
  candidates[empty].source = source;
  candidates[empty].score = score;
  candidates[empty].bad = bad_pairs;
  candidates[empty].origin = origin;
  candidates[empty].inv = inv;
  candidates[empty].code = code;
  memcpy(candidates[empty].bits, bits, sizeof(candidates[empty].bits));
}

static bool __attribute__((unused)) feed_cross_scan_vote_frame(
    const uint8_t* bits, const char* source, int score, int bad_pairs,
    uint64_t* out_code) {
  uint8_t voted[64] = {0};
  int header_err;
  int row_err;
  int col_err;
  int stop_err;
  uint64_t code = decode_card_code((uint8_t*)bits);

  if (score > EM_CROSS_SCAN_VOTE_MAX_FEED_SCORE ||
      bad_pairs > EM_CROSS_SCAN_VOTE_MAX_BAD_PAIRS) {
    return false;
  }

  for (int bit = 0; bit < 64; bit++) {
    if (bits[bit]) cross_scan_vote_ones[bit]++;
  }
  cross_scan_vote_frames++;

#if RFID_VOTE_DIAG_LOG
  LOG_WRN("[VOTE-FEED-%s] frames=%u/%u score=%d bad=%d raw40=%010llX low16=%u",
          source, cross_scan_vote_frames, EM_CROSS_SCAN_VOTE_FRAMES, score,
          bad_pairs, (unsigned long long)code, (uint16_t)(code & 0xFFFFULL));
#endif

  if (cross_scan_vote_frames < EM_CROSS_SCAN_VOTE_FRAMES) {
    return false;
  }

  for (int bit = 0; bit < 64; bit++) {
    voted[bit] =
        cross_scan_vote_ones[bit] > (EM_CROSS_SCAN_VOTE_FRAMES / 2) ? 1U : 0U;
  }

  (void)em4100_frame_error_score(voted, 0, &header_err, &row_err, &col_err,
                                 &stop_err);
  code = decode_card_code(voted);

  if (EM4100_Full_Check(voted) && code != 0) {
#if RFID_VOTE_DIAG_LOG
    LOG_WRN("[VOTE-SUCCESS] raw40=%010llX low32=%08llX low16=%u",
            (unsigned long long)code,
            (unsigned long long)(code & 0xFFFFFFFFULL),
            (uint16_t)(code & 0xFFFFULL));
#endif
    *out_code = code;
    reset_cross_scan_vote_pool();
    return true;
  }

#if RFID_VOTE_DIAG_LOG
  LOG_WRN(
      "[VOTE-FAILED] frames=%u header=%d row=%d col=%d stop=%d raw40=%010llX "
      "low16=%u",
      cross_scan_vote_frames, header_err, row_err, col_err, stop_err,
      (unsigned long long)code, (uint16_t)(code & 0xFFFFULL));
#endif
  reset_cross_scan_vote_pool();
  return false;
}

static bool feed_row_vote_frame(const uint8_t* bits, const char* source,
                                int score, int bad_pairs, uint64_t* out_code) {
  uint8_t stitched[64] = {0};
  uint8_t accepted_rows = 0;
  bool all_rows_ready = true;
  int group = -1;
  int empty_group = -1;
  int best_group = -1;
  int best_matches = -1;
  int match_rows = 0;
  int header_err;
  int row_err;
  int col_err;
  int stop_err;
  int weak_data_bits = 0;
  int selected_feed = -1;
  int selected_score = -1;
  int selected_consensus_rows = 0;
  int runner_up_score = -1;
  uint64_t input_code = decode_card_code((uint8_t*)bits);
  uint16_t key = (uint16_t)(input_code & 0xFFFFULL);
  uint64_t code;

  if (score > EM_CROSS_SCAN_VOTE_MAX_FEED_SCORE ||
      bad_pairs > EM_CROSS_SCAN_VOTE_MAX_BAD_PAIRS || input_code == 0) {
    return false;
  }

  for (int g = 0; g < EM_ROW_VOTE_GROUPS; g++) {
    int group_count = 0;
    for (int row = 0; row < EM_ROW_VOTE_ROWS; row++) {
      group_count += row_vote_counts[g][row];
    }

    if (!row_vote_group_used[g] && group_count == 0) {
      if (empty_group < 0) empty_group = g;
      continue;
    }

    int matches = row_vote_seed_match_rows(g, bits);
    if (matches > best_matches) {
      best_matches = matches;
      best_group = g;
    }
  }

  if (group < 0) {
    if (best_group >= 0 && best_matches >= EM_ROW_VOTE_GROUP_MIN_MATCH_ROWS) {
      group = best_group;
      match_rows = best_matches;
    } else if (empty_group >= 0) {
      group = empty_group;
      seed_row_vote_group(group, bits, key);
      match_rows = EM_ROW_VOTE_ROWS;
    } else {
#if RFID_VOTE_DIAG_LOG
      LOG_WRN("[ROW-VOTE-DROP-%s] key=%u best_match=%d groups_full", source,
              key, best_matches);
#endif
      return false;
    }
  }

  for (int row = 0; row < EM_ROW_VOTE_ROWS; row++) {
    int base = 9 + row * EM_ROW_VOTE_BITS;
    int feed_slot = row_vote_counts[group][row];
    if (row_vote_counts[group][row] >= EM_ROW_VOTE_DEPTH) continue;

    row_vote_feed_nibbles[group][feed_slot][row] =
        em4100_row_data_nibble(bits, row);
    for (int bit = 0; bit < EM_ROW_VOTE_DATA_BITS; bit++) {
      if (bits[base + bit]) row_vote_ones[group][row][bit]++;
    }
    row_vote_counts[group][row]++;
    accepted_rows++;
  }

  uint8_t min_count = EM_ROW_VOTE_DEPTH;
  uint8_t max_count = 0;
  int total_count = 0;
  for (int row = 0; row < EM_ROW_VOTE_ROWS; row++) {
    uint8_t count = row_vote_counts[group][row];
    if (count < min_count) min_count = count;
    if (count > max_count) max_count = count;
    total_count += count;
  }

#if RFID_VOTE_DIAG_LOG
  LOG_WRN(
      "[ROW-VOTE-FEED-%s] key=%u seed=%u match=%d group=%d accepted=%u "
      "score=%d bad=%d total=%d min=%u max=%u",
      source, key, row_vote_keys[group], match_rows, group, accepted_rows,
      score, bad_pairs, total_count, min_count, max_count);
#endif

  for (int row = 0; row < EM_ROW_VOTE_ROWS; row++) {
    if (row_vote_counts[group][row] < EM_ROW_VOTE_DEPTH) {
      all_rows_ready = false;
      break;
    }
  }
  if (!all_rows_ready) return false;

  for (int row = 0; row < EM_ROW_VOTE_ROWS; row++) {
    for (int bit = 0; bit < EM_ROW_VOTE_DATA_BITS; bit++) {
      uint8_t ones = row_vote_ones[group][row][bit];
      if (ones == (EM_ROW_VOTE_DEPTH / 2) ||
          ones == ((EM_ROW_VOTE_DEPTH / 2) + 1)) {
        weak_data_bits++;
      }
    }
  }

  selected_feed = row_vote_select_best_feed(
      group, &selected_score, &selected_consensus_rows, &runner_up_score);
  if (selected_feed < 0) {
    reset_row_vote_group(group);
    return false;
  }
  stitch_row_vote_feed(group, selected_feed, stitched);

  (void)em4100_frame_error_score(stitched, 0, &header_err, &row_err, &col_err,
                                 &stop_err);
  code = decode_card_code(stitched);

  char selected_hex[EM_ROW_VOTE_ROWS + 1];
  row_vote_feed_to_hex(group, selected_feed, selected_hex);
#if RFID_VOTE_DIAG_LOG
  LOG_WRN(
      "[WHOLE-FEED-VOTE] group=%d seed=%u feed=%d score=%d runner=%d "
      "consensus=%d/%d raw40=%s",
      group, row_vote_keys[group], selected_feed, selected_score,
      runner_up_score, selected_consensus_rows, EM_ROW_VOTE_ROWS, selected_hex);
#endif

  if (EM4100_Full_Check(stitched) && code != 0) {
    int stitched_matches = row_vote_seed_match_rows(group, stitched);

