Wang860503/nrf5340_discrete_rfid/src/main.c
    if (selected_consensus_rows < EM_WHOLE_FEED_MIN_CONSENSUS_ROWS) {
#if RFID_VOTE_DIAG_LOG
      LOG_WRN(
          "[WHOLE-FEED-REJECT] seed=%u match=%d consensus=%d raw40=%010llX "
          "low16=%u weak=%d",
          row_vote_keys[group], stitched_matches, selected_consensus_rows,
          (unsigned long long)code, (uint16_t)(code & 0xFFFFULL),
          weak_data_bits);
#endif
      dump_row_vote_nibbles(group, "reject", stitched, header_err, row_err,
                            col_err, stop_err, weak_data_bits, code);
      reset_row_vote_group(group);
      return false;
    }

#if RFID_VOTE_DIAG_LOG
    LOG_WRN(
        "[WHOLE-FEED-CANDIDATE] seed=%u match=%d consensus=%d raw40=%010llX "
        "low32=%08llX low16=%u weak=%d",
        row_vote_keys[group], stitched_matches, selected_consensus_rows,
        (unsigned long long)code, (unsigned long long)(code & 0xFFFFFFFFULL),
        (uint16_t)(code & 0xFFFFULL), weak_data_bits);
#endif
    if (!confirm_em4100_candidate(code, "whole-feed")) {
      reset_row_vote_group(group);
      return false;
    }
    *out_code = code;
    reset_row_vote_group(group);
    return true;
  }

#if RFID_VOTE_DIAG_LOG
  LOG_WRN(
      "[ROW-VOTE-FAILED] key=%u header=%d row=%d col=%d stop=%d weak=%d "
      "raw40=%010llX low16=%u",
      key, header_err, row_err, col_err, stop_err, weak_data_bits,
      (unsigned long long)code, (uint16_t)(code & 0xFFFFULL));
#endif
  dump_row_vote_nibbles(group, "failed", stitched, header_err, row_err, col_err,
                        stop_err, weak_data_bits, code);
  reset_row_vote_group(group);
  return false;
}

static bool em4100_candidate_from_parity(const uint8_t* bits, int off,
                                         uint64_t* out_code,
                                         const char** reason) {
  int row_bad = -1;
  int row_bad_count = 0;
  int col_bad = -1;
  int col_bad_count = 0;
  int row_bad_idx[10] = {0};
  int col_bad_idx[4] = {0};
  uint8_t col_parity[4] = {0};

  int hdr_err = 0;
  for (int j = 0; j < 9; j++) {
    if (bits[off + j] != 1) hdr_err++;
  }
  if (hdr_err > 1) return false;
  if (bits[off + 63] != 0) return false;

  for (int row = 0; row < 10; row++) {
    int base = off + 9 + row * 5;
    int row_sum = 0;
    for (int col = 0; col < 4; col++) {
      uint8_t val = bits[base + col];
      row_sum += val;
      col_parity[col] += val;
    }
    if ((row_sum + bits[base + 4]) % 2 != 0) {
      row_bad = row;
      if (row_bad_count < (int)ARRAY_SIZE(row_bad_idx)) {
        row_bad_idx[row_bad_count] = row;
      }
      row_bad_count++;
    }
  }

  for (int col = 0; col < 4; col++) {
    if ((col_parity[col] + bits[off + 59 + col]) % 2 != 0) {
      col_bad = col;
      if (col_bad_count < (int)ARRAY_SIZE(col_bad_idx)) {
        col_bad_idx[col_bad_count] = col;
      }
      col_bad_count++;
    }
  }

  uint8_t corrected[64];
  memcpy(corrected, &bits[off], sizeof(corrected));

  if (row_bad_count == 0 && col_bad_count == 0) {
    *reason = "clean";
  } else if (row_bad_count > 0 && row_bad_count <= 3 && col_bad_count == 0) {
    for (int i = 0; i < row_bad_count; i++) {
      corrected[9 + row_bad_idx[i] * 5 + 4] ^= 1U;
    }
    if (!EM4100_Full_Check(corrected)) return false;
    *reason = "rowparity";
  } else if (row_bad_count == 0 && col_bad_count > 0 && col_bad_count <= 2) {
    for (int i = 0; i < col_bad_count; i++) {
      corrected[59 + col_bad_idx[i]] ^= 1U;
    }
    if (!EM4100_Full_Check(corrected)) return false;
    *reason = "colparity";
  } else if (row_bad_count == 1 && col_bad_count == 1) {
    corrected[9 + row_bad * 5 + col_bad] ^= 1U;
    if (!EM4100_Full_Check(corrected)) return false;
    *reason = "data1";
  } else if (row_bad_count == 2 && col_bad_count == 2) {
    for (int swap = 0; swap <= 1; swap++) {
      memcpy(corrected, &bits[off], sizeof(corrected));
      corrected[9 + row_bad_idx[0] * 5 + col_bad_idx[swap]] ^= 1U;
      corrected[9 + row_bad_idx[1] * 5 + col_bad_idx[1 - swap]] ^= 1U;
      if (EM4100_Full_Check(corrected)) {
        *out_code = decode_card_code(corrected);
        *reason = "data2";
        return true;
      }
    }
    return false;
  } else {
    /* A lone row/column parity error cannot locate a data bit reliably. */
    return false;
  }

  *out_code = decode_card_code(corrected);
  return true;
}

static bool em4100_candidate_from_relaxed_header_clean(const uint8_t* bits,
                                                       int off,
                                                       uint64_t* out_code,
                                                       const char** reason) {
  int header_err;
  int row_err;
  int col_err;
  int stop_err;

  (void)em4100_frame_error_score(bits, off, &header_err, &row_err, &col_err,
                                 &stop_err);
  if (stop_err != 0 || row_err != 0 || col_err != 0 || header_err > 1) {
    return false;
  }

  *out_code = decode_card_code((uint8_t*)&bits[off]);
  *reason = header_err == 0 ? "clean" : "header1-clean";
  return true;
}

#if EM_ALIGN_TARGET_LOW16 != 0U
static int em4100_low16_delta(uint16_t low16) {
  int delta = (int)low16 - (int)EM_ALIGN_TARGET_LOW16;

  if (delta < 0) {
    delta = -delta;
  }
  return delta;
}

static bool em4100_frame_near_target_low16(uint64_t code) {
  uint16_t low16 = (uint16_t)(code & 0xFFFFULL);
  unsigned ham =
      (unsigned)__builtin_popcount((unsigned)(low16 ^ EM_ALIGN_TARGET_LOW16));

  return ham <= EM_NEAR_TARGET_MAX_HAM ||
         em4100_low16_delta(low16) <= EM_NEAR_TARGET_MAX_DELTA;
}

static int em4100_decode_rank(int frame_score, uint64_t code) {
  int tgt_pen = em4100_low16_delta((uint16_t)(code & 0xFFFFULL));

  if (tgt_pen > 4095) {
    tgt_pen = 4095;
  }
  return frame_score * 4096 + tgt_pen;
}

static bool em4100_try_target_code(const uint8_t* trial, uint64_t* out_code) {
  uint64_t code;

  if (!EM4100_Full_Check((uint8_t*)trial)) {
    return false;
  }
  code = decode_card_code((uint8_t*)trial);
  if ((uint16_t)(code & 0xFFFFULL) != EM_ALIGN_TARGET_LOW16) {
    return false;
  }
  *out_code = code;
  return true;
}

static bool em4100_force_parity_repair(const uint8_t* frame64,
                                       uint64_t* out_code) {
  uint8_t trial[64];
  int hdr_bad = 0;

  memcpy(trial, frame64, 64);
  for (int j = 0; j < 9; j++) {
    if (trial[j] != 1U) {
      hdr_bad++;
    }
  }
  if (hdr_bad > 2) {
    return false;
  }

  for (int j = 0; j < 9; j++) {
    trial[j] = 1U;
  }
  trial[63] = 0U;

