Wang860503/nrf5340_discrete_rfid/src/main.c
  for (int row = 0; row < 10; row++) {
    int base = 9 + row * 5;
    int row_sum = 0;

    for (int col = 0; col < 4; col++) {
      row_sum += trial[base + col];
    }
    trial[base + 4] = (uint8_t)(row_sum & 1);
  }

  {
    uint8_t col_parity[4] = {0};

    for (int row = 0; row < 10; row++) {
      int base = 9 + row * 5;

      for (int col = 0; col < 4; col++) {
        col_parity[col] += trial[base + col];
      }
    }
    for (int col = 0; col < 4; col++) {
      trial[59 + col] = (uint8_t)(col_parity[col] & 1);
    }
  }

  return em4100_try_target_code(trial, out_code);
}

static bool em4100_bruteforce_flip_search(uint8_t* trial, int max_flips,
                                          uint64_t* out_code) {
  if (max_flips >= 1) {
    for (int b = 9; b < 64; b++) {
      trial[b] ^= 1U;
      if (em4100_try_target_code(trial, out_code)) {
        return true;
      }
      trial[b] ^= 1U;
    }
  }

  if (max_flips < 2) {
    return false;
  }

  for (int b1 = 9; b1 < 63; b1++) {
    trial[b1] ^= 1U;
    for (int b2 = b1 + 1; b2 < 64; b2++) {
      trial[b2] ^= 1U;
      if (em4100_try_target_code(trial, out_code)) {
        trial[b2] ^= 1U;
        trial[b1] ^= 1U;
        return true;
      }
      trial[b2] ^= 1U;
    }
    trial[b1] ^= 1U;
  }

  if (max_flips < 3) {
    return false;
  }

  for (int b1 = 9; b1 < 62; b1++) {
    trial[b1] ^= 1U;
    for (int b2 = b1 + 1; b2 < 63; b2++) {
      trial[b2] ^= 1U;
      for (int b3 = b2 + 1; b3 < 64; b3++) {
        trial[b3] ^= 1U;
        if (em4100_try_target_code(trial, out_code)) {
          trial[b3] ^= 1U;
          trial[b2] ^= 1U;
          trial[b1] ^= 1U;
          return true;
        }
        trial[b3] ^= 1U;
      }
      trial[b2] ^= 1U;
    }
    trial[b1] ^= 1U;
  }

  return false;
}

static bool em4100_recover_align_target(const uint8_t* frame64,
                                        uint64_t* out_code) {
  uint8_t trial[64];
  uint64_t code;
  uint16_t low16;
  unsigned ham;
  int delta;
  int max_flips = 2;

  memcpy(trial, frame64, 64);
  code = decode_card_code(trial);
  if (!em4100_frame_near_target_low16(code)) {
    return false;
  }

  low16 = (uint16_t)(code & 0xFFFFULL);
  ham = (unsigned)__builtin_popcount((unsigned)(low16 ^ EM_ALIGN_TARGET_LOW16));
  delta = em4100_low16_delta(low16);
  if (delta <= (int)EM_NEAR_TARGET_BRUTE_DELTA || ham <= 6U) {
    max_flips = 3;
  }

  if (em4100_try_target_code(trial, out_code)) {
    return true;
  }
  if (em4100_force_parity_repair(frame64, out_code)) {
    return true;
  }

  invert_bits(trial, 64);
  if (em4100_try_target_code(trial, out_code)) {
    return true;
  }
  if (em4100_force_parity_repair(trial, out_code)) {
    return true;
  }
  invert_bits(trial, 64);

  if (em4100_bruteforce_flip_search(trial, max_flips, out_code)) {
    return true;
  }

  invert_bits(trial, 64);
  if (em4100_bruteforce_flip_search(trial, max_flips, out_code)) {
    return true;
  }

#if RFID_DECODE_DIAG_LOG
  LOG_WRN("tick_lvl_recover_fail: low16=%04X ham=%u delta=%d flips=%d", low16,
          ham, delta, max_flips);
#endif
  return false;
}
#endif /* EM_ALIGN_TARGET_LOW16 != 0U */

static bool em4100_candidate_from_synced_header(const uint8_t* bits, int len,
                                                int off, uint64_t* out_code,
                                                const char** reason) {
  const char* strict_reason;

  if (off <= 0 || off + 64 > len || bits[off - 1] != 0) return false;

  if (em4100_candidate_from_parity(bits, off, out_code, &strict_reason) &&
      strcmp(strict_reason, "data2") != 0) {
    *reason = strict_reason;
    return true;
  }

  return em4100_candidate_from_relaxed_header_clean(bits, off, out_code,
                                                    reason);
}

static bool edgecap_decode_bit_pair(int half_len, int hb_start,
                                    uint8_t* out_bit) {
  if (hb_start < 0 || hb_start + 1 >= half_len) return false;

  uint8_t first = edgecap_half_bits[hb_start];
  uint8_t second = edgecap_half_bits[hb_start + 1];

  if (first == 1U && second == 0U) {
    *out_bit = 1U;
  } else if (first == 0U && second == 1U) {
    *out_bit = 0U;
  } else {
    *out_bit = second;
  }

  return true;
}

/* EM4100 僅 1T/2T：用 EM_SHORT_MAX 硬切，勿用 unit 除法（396µs 會被誤判為 1T）
 */
static bool edgecap_repeat_from_gap_mode(uint32_t T, bool allow_long,
                                         uint32_t unit_1t_us,
                                         uint32_t* repeat) {
  (void)unit_1t_us;

  if (T < EM_EDGECAP_MIN_GAP_US) {
    return false;
  }

  if (T <= EM_SHORT_MAX) {
    *repeat = 1U;
  } else if (!allow_long) {
    *repeat = 1U;
  } else if (T <= EM_LONG_MAX) {
    *repeat = 2U;
  } else {
    *repeat = 3U;
    if (*repeat > EM_EDGECAP_MAX_REPEAT) {
      *repeat = EM_EDGECAP_MAX_REPEAT;
    }
  }

  return true;
}

static bool edgecap_repeat_from_gap(uint32_t T, uint32_t unit_1t_us,
                                    uint32_t* repeat) {
  return edgecap_repeat_from_gap_mode(T, false, unit_1t_us, repeat);
}

static bool edgecap_decode_header_rescue_stream(
    int tick_count, int tick_start, uint8_t tick_sub_start, uint32_t unit_1t_us,
    uint8_t* out_bits, uint8_t* out_pair_bad, uint16_t* out_half_tick,
    int* out_bit_len) {
  uint8_t half_bits[EM_EDGECAP_RESCUE_BITS * 2];
  uint16_t half_tick[EM_EDGECAP_RESCUE_BITS * 2];
  int half_len = 0;

  if (tick_start < 0 || tick_start >= tick_count) return false;
  memset(out_bits, 0, EM_EDGECAP_RESCUE_BITS);
  memset(out_pair_bad, 0, EM_EDGECAP_RESCUE_BITS);
  memset(out_half_tick, 0, EM_EDGECAP_RESCUE_BITS * sizeof(out_half_tick[0]));

  for (int i = tick_start;
       i < tick_count && half_len < (EM_EDGECAP_RESCUE_BITS * 2); i++) {
    uint32_t repeat;
    uint32_t start_n = (i == tick_start) ? tick_sub_start : 0U;
    bool allow_long = half_len < EM_EDGECAP_RESCUE_LONG_HALVES;

    if (!edgecap_repeat_from_gap_mode(tick_buffer[i], allow_long, unit_1t_us,
                                      &repeat)) {
      continue;
    }
    if (start_n >= repeat) continue;

