Wang860503/nrf5340_discrete_rfid/src/main.c
    uint8_t half_bit = tick_edge_to_level[i] ? 0U : 1U;
    for (uint32_t n = start_n; n < repeat && half_len < 128; n++) {
      half_bits[half_len] = half_bit;
      half_tick[half_len] = (uint16_t)i;
      half_len++;
    }
  }

  if (half_len < 128) return false;

  *out_bit_len = half_len / 2;
  for (int bit = 0, pos = 0; bit < *out_bit_len; bit++, pos += 2) {
    uint8_t first = half_bits[pos];
    uint8_t second = half_bits[pos + 1];

    out_half_tick[bit] = half_tick[pos];
    if (first == 1U && second == 0U) {
      out_bits[bit] = 1U;
    } else if (first == 0U && second == 1U) {
      out_bits[bit] = 0U;
    } else {
      out_pair_bad[bit] = 1U;
      out_bits[bit] = second;
    }
  }

  return true;
}

static bool __attribute__((unused)) em4100_candidate_repeats_nearby(
    const uint8_t* bits, int len, int off, uint64_t code) {
  if (len < 128) return false;

  for (int frame_step = 1; frame_step <= 3; frame_step++) {
    const int centers[2] = {off + (64 * frame_step), off - (64 * frame_step)};

    for (int c = 0; c < 2; c++) {
      for (int delta = -2; delta <= 2; delta++) {
        int repeat_off = centers[c] + delta;
        uint64_t repeat_code;
        const char* repeat_reason;

        if (repeat_off < 0 || repeat_off + 64 > len || repeat_off == off) {
          continue;
        }

        if (em4100_candidate_from_parity(bits, repeat_off, &repeat_code,
                                         &repeat_reason) &&
            repeat_code == code) {
          return true;
        }
      }
    }
  }

  return false;
}

static bool em4100_candidate_from_repeated_frames(const uint8_t* bits, int len,
                                                  int off, uint64_t* out_code,
                                                  const char** reason,
                                                  int* out_frames,
                                                  int* out_weak_bits,
                                                  int* out_start_frame) {
  uint8_t voted[64];
  int total_frames;

  if (off < 0 || off + 64 > len) return false;
  if (off <= 0 || bits[off - 1] != 0) return false;

  total_frames = (len - off) / 64;
  if (total_frames < 3) return false;

  for (int start_frame = 0; start_frame < 1 && start_frame + 3 <= total_frames;
       start_frame++) {
    int max_frames = total_frames - start_frame;
    int frame_options[3] = {7, 5, 3};

    for (int option = 0; option < (int)ARRAY_SIZE(frame_options); option++) {
      int frames = frame_options[option];
      int weak_bits = 0;

      if (frames > max_frames) continue;

      for (int bit = 0; bit < 64; bit++) {
        int ones = 0;

        for (int frame = 0; frame < frames; frame++) {
          int idx = off + (start_frame + frame) * 64 + bit;
          ones += bits[idx] ? 1 : 0;
        }

        int zeros = frames - ones;
        if (ones == zeros ||
            (ones > zeros ? ones - zeros : zeros - ones) == 1) {
          weak_bits++;
        }
        voted[bit] = ones > zeros ? 1U : 0U;
      }

      if (weak_bits > 14) continue;

      const char* voted_reason;
      if (em4100_candidate_from_parity(voted, 0, out_code, &voted_reason)) {
        if (strcmp(voted_reason, "data2") == 0) continue;
      } else if (!em4100_candidate_from_relaxed_header_clean(voted, 0, out_code,
                                                             &voted_reason)) {
        continue;
      }

      *reason = "vote";
      *out_frames = frames;
      *out_weak_bits = weak_bits;
      *out_start_frame = start_frame;
      return true;
    }
  }

  return false;
}

static bool edgecap_decode_frame_from_halfbits(int half_len, int hb_start,
                                               int resync, uint8_t* out_bits,
                                               uint8_t* out_pair_bad,
                                               int* out_bad_pairs) {
  int pos = hb_start;
  int bad_pairs = 0;

  memset(out_bits, 0, 64);
  memset(out_pair_bad, 0, 64);

  for (int bit = 0; bit < 64; bit++) {
    if (pos + 1 >= half_len) return false;

    uint8_t first = edgecap_half_bits[pos];
    uint8_t second = edgecap_half_bits[pos + 1];
    bool bad_pair = false;

    if (first == 1U && second == 0U) {
      out_bits[bit] = 1U;
    } else if (first == 0U && second == 1U) {
      out_bits[bit] = 0U;
    } else {
      bad_pair = true;
      out_pair_bad[bit] = 1U;
      out_bits[bit] = second;
      bad_pairs++;
    }

    pos += (resync && bad_pair) ? 1 : 2;
  }

  *out_bad_pairs = bad_pairs;
  return true;
}

#if EM_ENABLE_TICK_FALLBACK_DIAG
static void __attribute__((unused)) log_em4100_best_score(const char* tag,
                                                          const uint8_t* bits,
                                                          int len) {
  int best_score = 1000;
  int best_off = -1;
  int best_header = 0;
  int best_row = 0;
  int best_col = 0;
  int best_stop = 0;
  uint64_t best_code = 0;

  if (len < 64) return;

  for (int off = 0; off <= len - 64; off++) {
    int header_err;
    int row_err;
    int col_err;
    int stop_err;
    int score = em4100_frame_error_score(bits, off, &header_err, &row_err,
                                         &col_err, &stop_err);

    if (score < best_score) {
      best_score = score;
      best_off = off;
      best_header = header_err;
      best_row = row_err;
      best_col = col_err;
      best_stop = stop_err;
      best_code = decode_card_code((uint8_t*)&bits[off]);
    }
  }

  LOG_INF("%s best: score=%d off=%d header=%d row=%d col=%d", tag, best_score,
          best_off, best_header, best_row, best_col);
  LOG_INF("%s best: stop=%d raw40=%010llX low16=%u", tag, best_stop,
          (unsigned long long)best_code, (uint16_t)(best_code & 0xFFFFULL));
  if (best_header <= 1 && best_row == 0 && best_col == 0 && best_stop == 0) {
    LOG_WRN("[NEAR-%s] header_err=%d raw40=%010llX low16=%u", tag, best_header,
            (unsigned long long)best_code, (uint16_t)(best_code & 0xFFFFULL));
  }
}
#endif

