Wang860503/nrf5340_discrete_rfid/src/main.c
static uint8_t env_majority_level(const uint8_t* levels, int start, int width) {
  int sum = 0;
  for (int i = 0; i < width; i++) {
    sum += levels[start + i] ? 1 : 0;
  }
  return (sum * 2 >= width) ? 1 : 0;
}

static uint8_t env_sample_level_q8(const uint8_t* levels, int len,
                                   uint32_t pos_q8) {
  int idx = (int)((pos_q8 + 128U) >> 8);

  if (idx < 0) return levels[0];
  if (idx >= len) return levels[len - 1];
  return levels[idx];
}

static uint8_t env_majority_level_q8(const uint8_t* levels, int len,
                                     uint32_t start_q8, uint32_t width_q8) {
  uint32_t quarter_q8 = width_q8 >> 2;
  uint32_t center_q8 = width_q8 >> 1;
  int sum = 0;

  sum += env_sample_level_q8(levels, len, start_q8 + quarter_q8) ? 1 : 0;
  sum += env_sample_level_q8(levels, len, start_q8 + center_q8) ? 1 : 0;
  sum += env_sample_level_q8(levels, len, start_q8 + width_q8 - quarter_q8) ? 1
                                                                            : 0;
  return sum >= 2 ? 1U : 0U;
}

static uint8_t env_sample_edges_q8(int len, uint32_t pos_q8) {
  int idx = (int)((pos_q8 + 128U) >> 8);

  if (idx < 0) return env_edge_samples[0];
  if (idx >= len) return env_edge_samples[len - 1];
  return env_edge_samples[idx];
}

static int env_edge_sum_q8(int len, uint32_t start_q8, uint32_t width_q8) {
  uint32_t sixth_q8 = width_q8 / 6U;
  uint32_t center_q8 = width_q8 >> 1;
  int sum = 0;

  sum += env_sample_edges_q8(len, start_q8 + sixth_q8);
  sum += env_sample_edges_q8(len, start_q8 + center_q8);
  sum += env_sample_edges_q8(len, start_q8 + width_q8 - sixth_q8);
  return sum;
}

static int try_em4100_level_decode(int level_len, uint64_t* out_code,
                                   int* out_bits, int* out_half_windows,
                                   int* out_offset, bool* out_inverted,
                                   int* out_bad_pairs, bool log_best) {
  int best_score = 1000;
  int best_h = 0;
  int best_off = 0;
  int best_bits = 0;
  int best_bad = 0;
  int best_frame_off = -1;
  int best_inv = 0;
  int best_header = 0;
  int best_row = 0;
  int best_col = 0;
  int best_stop = 0;
  uint64_t best_code = 0;

  for (int half_windows = EM_ENV_HALF_MIN_WINDOWS;
       half_windows <= EM_ENV_HALF_MAX_WINDOWS; half_windows++) {
    const int bit_windows = half_windows * 2;

    for (int offset = 0; offset < bit_windows; offset++) {
      int bit_len = 0;

      memset(dec_raw_bits, 0, EM_DECODED_BITS_CAP);
      memset(dec_pair_bad, 0, EM_DECODED_BITS_CAP);
      for (int pos = offset;
           pos + bit_windows <= level_len && bit_len < EM_DECODED_BITS_CAP;
           pos += bit_windows) {
        uint8_t first =
            env_majority_level(env_level_samples, pos, half_windows);
        uint8_t second = env_majority_level(env_level_samples,
                                            pos + half_windows, half_windows);

        if (first == second) {
          dec_pair_bad[bit_len] = 1;
        }
        /* EM4100 polarity can be inverted later; preserve bit clock even for
         * bad pairs. */
        dec_raw_bits[bit_len++] = second;
      }

      if (bit_len < 64) continue;

      for (int inv = 0; inv <= 1; inv++) {
        if (inv) invert_bits(dec_raw_bits, bit_len);
        for (int off = 0; off <= bit_len - 64; off++) {
          uint64_t candidate_code;
          const char* candidate_reason;
          int header_err;
          int row_err;
          int col_err;
          int stop_err;
          int frame_bad = count_bad_pairs_in_frame(off);
          int score = em4100_frame_error_score(dec_raw_bits, off, &header_err,
                                               &row_err, &col_err, &stop_err);
          if (score < best_score) {
            best_score = score;
            best_h = half_windows;
            best_off = offset;
            best_bits = bit_len;
            best_bad = frame_bad;
            best_frame_off = off;
            best_inv = inv;
            best_header = header_err;
            best_row = row_err;
            best_col = col_err;
            best_stop = stop_err;
            best_code = decode_card_code((uint8_t*)&dec_raw_bits[off]);
          }

          if (frame_bad <= EM_LEVEL_MAX_FRAME_BAD_PAIRS &&
              em4100_candidate_from_parity(dec_raw_bits, off, &candidate_code,
                                           &candidate_reason) &&
              strcmp(candidate_reason, "data2") != 0) {
            if (confirm_em4100_candidate(candidate_code, candidate_reason)) {
              *out_code = candidate_code;
              *out_bits = bit_len;
              *out_half_windows = half_windows;
              *out_offset = offset;
              *out_inverted = inv != 0;
              *out_bad_pairs = frame_bad;
              return off;
            }
          }
        }
        if (inv) invert_bits(dec_raw_bits, bit_len);
      }

      int frame_bad = 0;
      int slide =
          try_em4100_level_slide(dec_raw_bits, bit_len, out_code, &frame_bad);
      if (slide >= 0) {
        *out_bits = bit_len;
        *out_half_windows = half_windows;
        *out_offset = offset;
        *out_inverted = false;
        *out_bad_pairs = frame_bad;
        return slide;
      }

      invert_bits(dec_raw_bits, bit_len);
      slide =
          try_em4100_level_slide(dec_raw_bits, bit_len, out_code, &frame_bad);
      if (slide >= 0) {
        *out_bits = bit_len;
        *out_half_windows = half_windows;
        *out_offset = offset;
        *out_inverted = true;
        *out_bad_pairs = frame_bad;
        return slide;
      }
    }
  }

  if (!log_best) return -1;

  LOG_INF("level_best: score=%d h=%d off=%d frame=%d inv=%d", best_score,
          best_h, best_off, best_frame_off, best_inv);
  LOG_INF("level_best: bits=%d bad=%d header=%d row=%d col=%d stop=%d",
          best_bits, best_bad, best_header, best_row, best_col, best_stop);
  LOG_INF("level_best: raw40=%010llX low16=%u", (unsigned long long)best_code,
          (uint16_t)(best_code & 0xFFFFULL));
  if (best_header <= 1 && best_row == 0 && best_col == 0 && best_stop == 0) {
    LOG_WRN("[NEAR-Level h=%d off=%d frame=%d inv=%d] header_err=%d", best_h,
            best_off, best_frame_off, best_inv, best_header);
    LOG_WRN("[NEAR-Level] raw40=%010llX low16=%u",
            (unsigned long long)best_code, (uint16_t)(best_code & 0xFFFFULL));
  }
  return -1;
}

