Wang860503/nrf5340_discrete_rfid/src/main.c
/* frame_bad≤max：先翻轉曼徹斯特壞點再跑 EM4100 parity 救援 */
static bool saadc_pair_parity_rescue_at(uint8_t* bits, const uint8_t* pair_bad,
                                        int bit_len, int frame_off,
                                        int max_bad_pairs, uint64_t* out_code,
                                        const char** out_reason) {
  int bad_pos[12];
  int n = 0;

  for (int i = 0; i < 64; i++) {
    const int idx = frame_off + i;

    if (idx >= bit_len) {
      break;
    }
    if (pair_bad[idx]) {
      if (n < (int)ARRAY_SIZE(bad_pos)) {
        bad_pos[n++] = idx;
      }
    }
  }
  if (n > max_bad_pairs) {
    return false;
  }

  const int masks = 1 << n;

  for (int mask = 0; mask < masks; mask++) {
    for (int b = 0; b < n; b++) {
      if (mask & (1 << b)) {
        bits[bad_pos[b]] ^= 1U;
      }
    }

    const char* reason = NULL;

    if (em4100_candidate_from_parity(bits, frame_off, out_code, &reason) &&
        reason != NULL) {
      *out_reason = reason;
      for (int b = 0; b < n; b++) {
        if (mask & (1 << b)) {
          bits[bad_pos[b]] ^= 1U;
        }
      }
      return true;
    }

    for (int b = 0; b < n; b++) {
      if (mask & (1 << b)) {
        bits[bad_pos[b]] ^= 1U;
      }
    }
  }

  return false;
}

/* 單一 (half_q8, phase_q8) 曼徹斯特解碼；成功回傳 frame offset，否則 -1 */
static int saadc_pair_try_phase_config(
    int level_len, uint32_t level_limit_q8, uint32_t half_q8, uint32_t phase_q8,
    int* best_score, int* best_bad, uint32_t* best_half_q8,
    uint32_t* best_phase_q8, int* best_off, int* best_inv, int* best_header,
    int* best_row, int* best_col, int* best_stop, int* best_bits,
    uint64_t* best_code, uint64_t* out_code, int* out_bits,
    int* out_half_windows, int* out_offset, bool* out_inverted,
    int* out_bad_pairs) {
  const uint32_t bit_q8 = half_q8 * 2U;
  int bit_len = 0;

  memset(dec_raw_bits, 0, EM_DECODED_BITS_CAP);
  memset(dec_pair_bad, 0, EM_DECODED_BITS_CAP);

  for (uint32_t pos_q8 = phase_q8;
       pos_q8 + bit_q8 <= level_limit_q8 && bit_len < EM_DECODED_BITS_CAP;
       pos_q8 += bit_q8) {
    uint8_t first =
        env_majority_level_q8(env_level_samples, level_len, pos_q8, half_q8);
    uint8_t second = env_majority_level_q8(env_level_samples, level_len,
                                           pos_q8 + half_q8, half_q8);

    if (first == second) {
      dec_pair_bad[bit_len] = 1U;
    }
    dec_raw_bits[bit_len++] = second;
  }

  if (bit_len < 64) {
    return -1;
  }

  dec_bad_prefix[0] = 0U;
  for (int i = 0; i < bit_len; i++) {
    dec_bad_prefix[i + 1] =
        (uint16_t)(dec_bad_prefix[i] + (dec_pair_bad[i] ? 1U : 0U));
  }

  for (int inv = 0; inv <= 1; inv++) {
    if (inv) {
      invert_bits(dec_raw_bits, bit_len);
    }

    for (int off = 0; off <= bit_len - 64; off++) {
      int header_err;
      int row_err;
      int col_err;
      int stop_err;
      int frame_bad = dec_bad_prefix[off + 64] - dec_bad_prefix[off];

      if (frame_bad > 0) {
        int bad_header;
        int bad_row;
        int bad_col;
        int bad_stop;
        int bad_score = em4100_frame_error_score(dec_raw_bits, off, &bad_header,
                                                 &bad_row, &bad_col, &bad_stop);

        if (frame_bad < *best_bad ||
            (frame_bad == *best_bad && bad_score < *best_score)) {
          *best_bad = frame_bad;
          *best_half_q8 = half_q8;
          *best_phase_q8 = phase_q8;
          *best_off = off;
          *best_inv = inv;
          *best_header = bad_header;
          *best_row = bad_row;
          *best_col = bad_col;
          *best_stop = bad_stop;
          *best_bits = bit_len;
          *best_code = decode_card_code((uint8_t*)&dec_raw_bits[off]);
          *best_score = bad_score;
        }
        continue;
      }

      int score = em4100_frame_error_score(dec_raw_bits, off, &header_err,
                                           &row_err, &col_err, &stop_err);
      uint64_t code = decode_card_code((uint8_t*)&dec_raw_bits[off]);

      if (score < *best_score ||
          (score == *best_score && frame_bad < *best_bad)) {
        *best_score = score;
        *best_bad = frame_bad;
        *best_half_q8 = half_q8;
        *best_phase_q8 = phase_q8;
        *best_off = off;
        *best_inv = inv;
        *best_header = header_err;
        *best_row = row_err;
        *best_col = col_err;
        *best_stop = stop_err;
        *best_bits = bit_len;
        *best_code = code;
      }

      if (frame_bad == 0) {
        uint64_t parity_code;
        const char* parity_reason = NULL;

        if (em4100_candidate_from_parity(dec_raw_bits, off, &parity_code,
                                         &parity_reason)) {
#if RFID_SAADC_REQUIRE_HEADER_CLEAN
          if (!em4100_header_clean(dec_raw_bits, off)) {
            continue;
          }
#endif
          *out_code = parity_code;
          *out_bits = bit_len;
          *out_half_windows = (int)half_q8;
          *out_offset = (int)phase_q8;
          *out_inverted = inv != 0;
          *out_bad_pairs = frame_bad;
          if (inv) {
            invert_bits(dec_raw_bits, bit_len);
          }
#if !RFID_LOG_MINIMAL
          LOG_WRN(
              "[SUCCESS-SAADC-01-10 half_q8=%d phase_q8=%d inv=%d bad=%d "
              "parity=%s header=0]",
              (int)half_q8, (int)phase_q8, inv, frame_bad,
              parity_reason != NULL ? parity_reason : "?");
          LOG_WRN("[SUCCESS-SAADC-01-10] ID: %010llX",
                  (unsigned long long)parity_code);
#endif
          return off;
        }
        if (em4100_valid_at(dec_raw_bits, bit_len, off)) {
#if RFID_SAADC_REQUIRE_HEADER_CLEAN
          if (!em4100_header_clean(dec_raw_bits, off)) {
            continue;
          }
#endif
          *out_code = code;
          *out_bits = bit_len;
          *out_half_windows = (int)half_q8;
          *out_offset = (int)phase_q8;
          *out_inverted = inv != 0;
          *out_bad_pairs = frame_bad;
          if (inv) {
            invert_bits(dec_raw_bits, bit_len);
          }
#if !RFID_LOG_MINIMAL
          LOG_WRN(
              "[SUCCESS-SAADC-01-10 half_q8=%d phase_q8=%d inv=%d bad=%d "
              "parity=clean header=0]",
              (int)half_q8, (int)phase_q8, inv, frame_bad);
          LOG_WRN("[SUCCESS-SAADC-01-10] ID: %010llX",
                  (unsigned long long)code);
#endif
          return off;
        }
      }
    }

