Wang860503/nrf5340_discrete_rfid/src/main.c
    if (inv) {
      invert_bits(dec_raw_bits, bit_len);
    }
  }

  return -1;
}

static int try_em4100_saadc_pair_decode(int level_len, uint64_t* out_code,
                                        int* out_bits, int* out_half_windows,
                                        int* out_offset, bool* out_inverted,
                                        int* out_bad_pairs, bool log_best) {
  /* 供 strict fail 時做「穩定候選」收斂展示用（不代表 strict success）。 */
  extern uint64_t rfid_saadc_pair_last_best_code;
  extern int rfid_saadc_pair_last_best_bad;
  extern int rfid_saadc_pair_last_best_score;
  int best_score = 1000;
  int best_bad = 1000;
  uint32_t best_half_q8 = 0;
  uint32_t best_phase_q8 = 0;
  int best_off = -1;
  int best_inv = 0;
  int best_header = 0;
  int best_row = 0;
  int best_col = 0;
  int best_stop = 0;
  int best_bits = 0;
  uint64_t best_code = 0;

  if (level_len < 128) return -1;

  const uint32_t level_limit_q8 = (uint32_t)(level_len - 1) << 8;
  uint32_t half_lo = RFID_SAADC_MANCHESTER_HALF_MIN_Q8;
  uint32_t half_hi = RFID_SAADC_MANCHESTER_HALF_MAX_Q8;
  const bool narrow_scan = rfid_saadc_phase_valid;
  bool guided_wide = false;
  const uint32_t phase_step_q8 = narrow_scan
                                     ? RFID_SAADC_MANCHESTER_OFFSET_STEP_Q8
                                     : RFID_SAADC_PHASE_WIDE_STEP_Q8;

#if RFID_SAADC_PHASE_TRACK_ENABLE && RFID_SAADC_PHASE_LOCK_NARROW
  if (rfid_saadc_phase_valid) {
    half_lo =
        (rfid_saadc_tracked_half_q8 > RFID_SAADC_PHASE_REFINE_HALF_RADIUS_Q8)
            ? (rfid_saadc_tracked_half_q8 -
               RFID_SAADC_PHASE_REFINE_HALF_RADIUS_Q8)
            : RFID_SAADC_MANCHESTER_HALF_MIN_Q8;
    half_hi =
        rfid_saadc_tracked_half_q8 + RFID_SAADC_PHASE_REFINE_HALF_RADIUS_Q8;
    if (half_hi > RFID_SAADC_MANCHESTER_HALF_MAX_Q8) {
      half_hi = RFID_SAADC_MANCHESTER_HALF_MAX_Q8;
    }
  } else if (rfid_saadc_tracked_bad < RFID_SAADC_PHASE_GUIDED_BAD_LT) {
    rfid_saadc_wide_round++;
    if ((rfid_saadc_wide_round % RFID_SAADC_PHASE_FULL_WIDE_EVERY) != 0U) {
      guided_wide = true;
      half_lo =
          (rfid_saadc_tracked_half_q8 > RFID_SAADC_PHASE_REFINE_HALF_RADIUS_Q8)
              ? (rfid_saadc_tracked_half_q8 -
                 RFID_SAADC_PHASE_REFINE_HALF_RADIUS_Q8)
              : RFID_SAADC_MANCHESTER_HALF_MIN_Q8;
      half_hi =
          rfid_saadc_tracked_half_q8 + RFID_SAADC_PHASE_REFINE_HALF_RADIUS_Q8;
      if (half_hi > RFID_SAADC_MANCHESTER_HALF_MAX_Q8) {
        half_hi = RFID_SAADC_MANCHESTER_HALF_MAX_Q8;
      }
    }
  } else {
    rfid_saadc_wide_round++;
  }
#endif

  if (log_best && RFID_DECODE_DIAG_LOG) {
    const char* mode = narrow_scan ? "narrow" : guided_wide ? "guided" : "wide";

    LOG_WRN("saadc_decode: %s half=%u..%u step=%u trk=%u/%u bad=%d", mode,
            half_lo, half_hi, (unsigned)phase_step_q8,
            rfid_saadc_tracked_half_q8, rfid_saadc_tracked_phase_q8,
            rfid_saadc_tracked_bad);
  }

#if RFID_SAADC_PHASE_REFINE_ENABLE
  if (!narrow_scan && rfid_saadc_tracked_bad <= 20 &&
      rfid_saadc_tracked_bad < 1000) {
    uint32_t hint_half_lo =
        (rfid_saadc_tracked_half_q8 > RFID_SAADC_PHASE_REFINE_HALF_RADIUS_Q8)
            ? (rfid_saadc_tracked_half_q8 -
               RFID_SAADC_PHASE_REFINE_HALF_RADIUS_Q8)
            : RFID_SAADC_MANCHESTER_HALF_MIN_Q8;
    uint32_t hint_half_hi =
        rfid_saadc_tracked_half_q8 + RFID_SAADC_PHASE_REFINE_HALF_RADIUS_Q8;

    if (hint_half_hi > RFID_SAADC_MANCHESTER_HALF_MAX_Q8) {
      hint_half_hi = RFID_SAADC_MANCHESTER_HALF_MAX_Q8;
    }

    for (uint32_t half_q8 = hint_half_lo; half_q8 <= hint_half_hi;
         half_q8 += RFID_SAADC_MANCHESTER_HALF_STEP_Q8) {
      const uint32_t bit_q8 = half_q8 * 2U;
      uint32_t phase_lo =
          (rfid_saadc_tracked_phase_q8 > RFID_SAADC_PHASE_REFINE_RADIUS_Q8)
              ? (rfid_saadc_tracked_phase_q8 -
                 RFID_SAADC_PHASE_REFINE_RADIUS_Q8)
              : 0U;
      uint32_t phase_hi =
          rfid_saadc_tracked_phase_q8 + RFID_SAADC_PHASE_REFINE_RADIUS_Q8;

      if (phase_hi >= bit_q8) {
        phase_hi = bit_q8 - 1U;
      }

      for (uint32_t phase_q8 = phase_lo; phase_q8 <= phase_hi;
           phase_q8 += RFID_SAADC_PHASE_REFINE_STEP_Q8) {
        int hit = saadc_pair_try_phase_config(
            level_len, level_limit_q8, half_q8, phase_q8, &best_score,
            &best_bad, &best_half_q8, &best_phase_q8, &best_off, &best_inv,
            &best_header, &best_row, &best_col, &best_stop, &best_bits,
            &best_code, out_code, out_bits, out_half_windows, out_offset,
            out_inverted, out_bad_pairs);
        if (hit >= 0) {
          return hit;
        }
      }
    }
  }
#endif

  for (uint32_t half_q8 = half_lo; half_q8 <= half_hi;
       half_q8 += RFID_SAADC_MANCHESTER_HALF_STEP_Q8) {
    const uint32_t bit_q8 = half_q8 * 2U;
    uint32_t phase_start = 0U;
    uint32_t phase_end = bit_q8;

#if RFID_SAADC_PHASE_TRACK_ENABLE
    if (rfid_saadc_phase_valid) {
      phase_start =
          (rfid_saadc_tracked_phase_q8 > RFID_SAADC_PHASE_TRACK_WINDOW_Q8)
              ? (rfid_saadc_tracked_phase_q8 - RFID_SAADC_PHASE_TRACK_WINDOW_Q8)
              : 0U;
      phase_end =
          rfid_saadc_tracked_phase_q8 + RFID_SAADC_PHASE_TRACK_WINDOW_Q8;
      if (phase_end > bit_q8) {
        phase_end = bit_q8;
      }
    }
#endif

    for (uint32_t phase_q8 = phase_start; phase_q8 < phase_end;
         phase_q8 += phase_step_q8) {
      int hit = saadc_pair_try_phase_config(
          level_len, level_limit_q8, half_q8, phase_q8, &best_score, &best_bad,
          &best_half_q8, &best_phase_q8, &best_off, &best_inv, &best_header,
          &best_row, &best_col, &best_stop, &best_bits, &best_code, out_code,
          out_bits, out_half_windows, out_offset, out_inverted, out_bad_pairs);
      if (hit >= 0) {
        return hit;
      }
    }
  }

#if RFID_SAADC_PHASE_REFINE_ENABLE
  if (best_off >= 0) {
    const uint32_t refine_radius_q8 =
        (best_bad <= (int)RFID_SAADC_PHASE_LOCK_MAX_BAD)
            ? RFID_SAADC_PHASE_REFINE_WIDE_RADIUS_Q8
            : RFID_SAADC_PHASE_REFINE_RADIUS_Q8;
    uint32_t half_lo =
        (best_half_q8 > RFID_SAADC_PHASE_REFINE_HALF_RADIUS_Q8)
            ? (best_half_q8 - RFID_SAADC_PHASE_REFINE_HALF_RADIUS_Q8)
            : RFID_SAADC_MANCHESTER_HALF_MIN_Q8;
    uint32_t half_hi = best_half_q8 + RFID_SAADC_PHASE_REFINE_HALF_RADIUS_Q8;

    if (half_hi > RFID_SAADC_MANCHESTER_HALF_MAX_Q8) {
      half_hi = RFID_SAADC_MANCHESTER_HALF_MAX_Q8;
    }

    for (uint32_t half_q8 = half_lo; half_q8 <= half_hi;
         half_q8 += RFID_SAADC_MANCHESTER_HALF_STEP_Q8) {
      const uint32_t bit_q8 = half_q8 * 2U;
      uint32_t phase_lo = (best_phase_q8 > refine_radius_q8)
                              ? (best_phase_q8 - refine_radius_q8)
                              : 0U;
      uint32_t phase_hi = best_phase_q8 + refine_radius_q8;

      if (phase_hi >= bit_q8) {
        phase_hi = bit_q8 - 1U;
      }

      for (uint32_t phase_q8 = phase_lo; phase_q8 <= phase_hi;
           phase_q8 += RFID_SAADC_PHASE_REFINE_STEP_Q8) {
        int hit = saadc_pair_try_phase_config(
            level_len, level_limit_q8, half_q8, phase_q8, &best_score,
            &best_bad, &best_half_q8, &best_phase_q8, &best_off, &best_inv,
            &best_header, &best_row, &best_col, &best_stop, &best_bits,
            &best_code, out_code, out_bits, out_half_windows, out_offset,
            out_inverted, out_bad_pairs);
        if (hit >= 0) {
          return hit;
        }
      }
    }
  }
#endif

  if (best_off >= 0 && best_bad > 0 &&
      best_bad <= (int)RFID_SAADC_STRICT_MAX_BAD_PAIRS) {
    const uint32_t bit_q8 = best_half_q8 * 2U;
    int rescue_bit_len = 0;

