Wang860503/nrf5340_discrete_rfid/src/main.c
    memset(dec_raw_bits, 0, EM_DECODED_BITS_CAP);
    memset(dec_pair_bad, 0, EM_DECODED_BITS_CAP);

    for (uint32_t pos_q8 = best_phase_q8; pos_q8 + bit_q8 <= level_limit_q8 &&
                                          rescue_bit_len < EM_DECODED_BITS_CAP;
         pos_q8 += bit_q8) {
      uint8_t first = env_majority_level_q8(env_level_samples, level_len,
                                            pos_q8, best_half_q8);
      uint8_t second = env_majority_level_q8(
          env_level_samples, level_len, pos_q8 + best_half_q8, best_half_q8);

      if (first == second) {
        dec_pair_bad[rescue_bit_len] = 1U;
      }
      dec_raw_bits[rescue_bit_len++] = second;
    }

    if (rescue_bit_len >= 64 && best_off + 64 <= rescue_bit_len) {
      if (best_inv) {
        invert_bits(dec_raw_bits, rescue_bit_len);
      }

      uint64_t rescued_code;
      const char* rescue_reason = NULL;

#if RFID_DECODE_DIAG_LOG
      LOG_WRN(
          "[RESCUE-ATTEMPT] best_off=%d best_bad=%d best_inv=%d half=%u "
          "phase=%u",
          best_off, best_bad, best_inv, best_half_q8, best_phase_q8);
#endif
      if (saadc_pair_parity_rescue_at(dec_raw_bits, dec_pair_bad,
                                      rescue_bit_len, best_off,
                                      (int)RFID_SAADC_STRICT_MAX_BAD_PAIRS,
                                      &rescued_code, &rescue_reason)) {
#if RFID_SAADC_REQUIRE_HEADER_CLEAN
        if (!em4100_header_clean(dec_raw_bits, best_off)) {
          if (best_inv) {
            invert_bits(dec_raw_bits, rescue_bit_len);
          }
        } else
#endif
        {
          *out_code = rescued_code;
          *out_bits = rescue_bit_len;
          *out_half_windows = (int)best_half_q8;
          *out_offset = (int)best_phase_q8;
          *out_inverted = best_inv != 0;
          *out_bad_pairs = best_bad;
          if (best_inv) {
            invert_bits(dec_raw_bits, rescue_bit_len);
          }
#if !RFID_LOG_MINIMAL
          LOG_WRN(
              "[SUCCESS-SAADC-01-10 half_q8=%d phase_q8=%d inv=%d bad=%d "
              "parity=%s header=0]",
              (int)best_half_q8, (int)best_phase_q8, best_inv, best_bad,
              rescue_reason != NULL ? rescue_reason : "?");
          LOG_WRN("[SUCCESS-SAADC-01-10] ID: %010llX",
                  (unsigned long long)rescued_code);
#endif
          return best_off;
        }
      }

      if (best_inv) {
        invert_bits(dec_raw_bits, rescue_bit_len);
      }
    }
  }

  if (log_best && !RFID_SAADC_LOG_IMPORTANT_ONLY) {
    LOG_INF(
        "saadc_pair_best: score=%d bad=%d half_q8=%u phase_q8=%u frame=%d "
        "inv=%d",
        best_score, best_bad, best_half_q8, best_phase_q8, best_off, best_inv);
    LOG_INF("saadc_pair_best: bits=%d header=%d row=%d col=%d stop=%d",
            best_bits, best_header, best_row, best_col, best_stop);
    LOG_INF("saadc_pair_best: raw40=%010llX low16=%u",
            (unsigned long long)best_code, (uint16_t)(best_code & 0xFFFFULL));
  }

#if RFID_SAADC_PHASE_TRACK_ENABLE
  if (best_off >= 0) {
    bool update_lock = !rfid_saadc_phase_valid ||
                       best_bad < rfid_saadc_tracked_bad -
                                      (int)RFID_SAADC_PHASE_LOCK_HYST_BAD ||
                       (best_bad < rfid_saadc_tracked_bad &&
                        best_score < rfid_saadc_tracked_score) ||
                       (best_bad == rfid_saadc_tracked_bad &&
                        best_score < rfid_saadc_tracked_score);

    if (update_lock) {
      rfid_saadc_tracked_half_q8 = best_half_q8;
      rfid_saadc_tracked_phase_q8 = best_phase_q8;
      rfid_saadc_tracked_bad = best_bad;
      rfid_saadc_tracked_score = best_score;
      rfid_saadc_phase_hold_streak = 0U;
      if (best_bad <= (int)RFID_SAADC_PHASE_LOCK_MAX_BAD) {
        rfid_saadc_phase_valid = true;
        if (log_best) {
          LOG_WRN(
              "saadc_phase_lock: half_q8=%u phase_q8=%u bad=%d score=%d "
              "CH_A=%u",
              best_half_q8, best_phase_q8, best_bad, best_score,
              (unsigned)rfid_pwm_ch_a_ref_runtime);
        }
      } else {
        rfid_saadc_phase_valid = false;
        if (log_best) {
          LOG_WRN(
              "saadc_phase_probe: half_q8=%u phase_q8=%u bad=%d "
              "(>%u, wide next)",
              best_half_q8, best_phase_q8, best_bad,
              (unsigned)RFID_SAADC_PHASE_LOCK_MAX_BAD);
        }
      }
    } else if (log_best) {
      rfid_saadc_phase_hold_streak++;
      LOG_WRN(
          "saadc_phase_hold: half_q8=%u phase_q8=%u bad=%d (cand "
          "bad=%d score=%d)",
          rfid_saadc_tracked_half_q8, rfid_saadc_tracked_phase_q8,
          rfid_saadc_tracked_bad, best_bad, best_score);
      if (rfid_saadc_phase_hold_streak >= RFID_SAADC_PHASE_HOLD_RESCAN_GT &&
          rfid_saadc_tracked_bad > (int)RFID_SAADC_PHASE_LOCK_MAX_BAD) {
        rfid_saadc_phase_valid = false;
        rfid_saadc_phase_hold_streak = 0U;
        LOG_WRN("saadc_phase_rescan: bad=%d stuck, next=wide",
                rfid_saadc_tracked_bad);
      }
    }
  }
#endif

#if RFID_SAADC_CHA_REF_SWEEP_ENABLE
  if (best_off >= 0 && best_bad > (int)RFID_SAADC_CHA_REF_SWEEP_BAD_GT) {
    static const uint8_t cha_table[] = {22U, 23U, 24U};
    static uint8_t cha_idx;

    cha_idx = (uint8_t)((cha_idx + 1U) % (uint8_t)ARRAY_SIZE(cha_table));
    if (rfid_pwm_ch_a_ref_runtime != cha_table[cha_idx]) {
      rfid_pwm_ch_a_ref_runtime = cha_table[cha_idx];
#if RFID_SAADC_PHASE_TRACK_ENABLE
      rfid_saadc_phase_valid = false;
#endif
      (void)rfid_pwm_apply_duty(rfid_pwm_active_duty);
      LOG_WRN("saadc_cha_ref_sweep: CH_A=%u (bad=%d > %u)",
              (unsigned)rfid_pwm_ch_a_ref_runtime, best_bad,
              (unsigned)RFID_SAADC_CHA_REF_SWEEP_BAD_GT);
    }
  }
#endif

  rfid_saadc_pair_last_best_code = best_code;
  rfid_saadc_pair_last_best_bad = best_bad;
  rfid_saadc_pair_last_best_score = best_score;

  if (best_bad <= 20 && best_off >= 0 && best_off + 64 <= EM_DECODED_BITS_CAP) {
    char bits_str[65];
    for (int i = 0; i < 64; i++) {
      bits_str[i] = dec_raw_bits[best_off + i] ? '1' : '0';
    }
    bits_str[64] = '\0';
    LOG_WRN("[DEBUG-BITS] bad=%d inv=%d raw=%s", best_bad, best_inv, bits_str);
  }

  return -1;
}

