Wang860503/nrf5340_discrete_rfid/src/main.c
uint64_t rfid_saadc_pair_last_best_code;
int rfid_saadc_pair_last_best_bad;
int rfid_saadc_pair_last_best_score;

static void rfid_saadc_candidate_consensus(const char* tag, uint64_t code,
                                           int score, int bad) {
  /* 連續一致候選即報告（展示/診斷用）。 */
  static uint64_t last_code;
  static uint8_t streak;
  static int last_score;
  static int last_bad;

  if (code == 0 || score >= 1000 || bad >= 1000) {
    streak = 0;
    last_code = 0;
    return;
  }

  if (code == last_code) {
    if (streak < UINT8_MAX) streak++;
    if (score < last_score) last_score = score;
    if (bad < last_bad) last_bad = bad;
  } else {
    last_code = code;
    streak = 1;
    last_score = score;
    last_bad = bad;
  }

#if RFID_DECODE_DIAG_LOG
  if (streak >= 3) {
    LOG_WRN("[CANDIDATE-SAADC tag=%s streak=%u score<=%d bad<=%d] ID: %010llX",
            tag, (unsigned)streak, last_score, last_bad,
            (unsigned long long)last_code);
  }
#endif
}

static int try_em4100_fractional_level_decode(
    int level_len, uint64_t* out_code, int* out_bits, int* out_half_windows,
    int* out_offset, bool* out_inverted, int* out_bad_pairs, bool log_best,
    const char* tag) {
  int best_score = 1000;
  uint32_t best_half_q8 = 0;
  uint32_t best_offset_q8 = 0;
  int best_bits = 0;
  int best_bad = 0;
  int best_frame_off = -1;
  int best_inv = 0;
  int best_header = 0;
  int best_row = 0;
  int best_col = 0;
  int best_stop = 0;
  uint64_t best_code = 0;
  int noisy_bad = 1000;
  int noisy_bits = 0;
  uint32_t noisy_half_q8 = 0;
  uint32_t noisy_offset_q8 = 0;
  int noisy_frame_off = -1;
  int noisy_inv = 0;
  uint64_t noisy_code = 0;
  const char* noisy_reason = NULL;

  if (level_len < 128) return -1;

  const uint32_t level_limit_q8 = (uint32_t)(level_len - 1) << 8;

  for (uint32_t half_q8 = EM_FRAC_HALF_MIN_Q8; half_q8 <= EM_FRAC_HALF_MAX_Q8;
       half_q8 += EM_FRAC_HALF_STEP_Q8) {
    const uint32_t bit_q8 = half_q8 * 2U;

    for (uint32_t offset_q8 = 0; offset_q8 < bit_q8;
         offset_q8 += EM_FRAC_OFFSET_STEP_Q8) {
      int bit_len = 0;

      memset(dec_raw_bits, 0, EM_DECODED_BITS_CAP);
      memset(dec_pair_bad, 0, EM_DECODED_BITS_CAP);

      for (uint32_t pos_q8 = offset_q8;
           pos_q8 + bit_q8 <= level_limit_q8 && bit_len < EM_DECODED_BITS_CAP;
           pos_q8 += bit_q8) {
        uint8_t first = env_majority_level_q8(env_level_samples, level_len,
                                              pos_q8, half_q8);
        uint8_t second = env_majority_level_q8(env_level_samples, level_len,
                                               pos_q8 + half_q8, half_q8);

        if (first == second) {
          dec_pair_bad[bit_len] = 1;
        }
        dec_raw_bits[bit_len++] = second;
      }

      if (bit_len < 64) continue;

      for (int inv = 0; inv <= 1; inv++) {
        if (inv) invert_bits(dec_raw_bits, bit_len);

        for (int off = 0; off <= bit_len - 64; off++) {
          uint64_t candidate_code;
          const char* candidate_reason;
          int header_err;
          int row_err;
          int col_err;
          int stop_err;
          int frame_bad = count_bad_pairs_in_frame(off);
          int score = em4100_frame_error_score(dec_raw_bits, off, &header_err,
                                               &row_err, &col_err, &stop_err);
          uint64_t code = decode_card_code((uint8_t*)&dec_raw_bits[off]);

          if (score < best_score) {
            best_score = score;
            best_half_q8 = half_q8;
            best_offset_q8 = offset_q8;
            best_bits = bit_len;
            best_bad = frame_bad;
            best_frame_off = off;
            best_inv = inv;
            best_header = header_err;
            best_row = row_err;
            best_col = col_err;
            best_stop = stop_err;
            best_code = code;
          }

          if (frame_bad <= EM_LEVEL_MAX_FRAME_BAD_PAIRS &&
              em4100_candidate_from_parity(dec_raw_bits, off, &candidate_code,
                                           &candidate_reason) &&
              strcmp(candidate_reason, "data2") != 0) {
            if (confirm_em4100_candidate(candidate_code, candidate_reason)) {
              *out_code = candidate_code;
              *out_bits = bit_len;
              *out_half_windows = (int)half_q8;
              *out_offset = (int)offset_q8;
              *out_inverted = inv != 0;
              *out_bad_pairs = frame_bad;
              return off;
            }
          }

          if (score == 0 && frame_bad < noisy_bad &&
              frame_bad <= EM_NOISY_MAX_FRAME_BAD_PAIRS) {
            noisy_bad = frame_bad;
            noisy_bits = bit_len;
            noisy_half_q8 = half_q8;
            noisy_offset_q8 = offset_q8;
            noisy_frame_off = off;
            noisy_inv = inv;
            noisy_code = code;
            noisy_reason = "frac-noisy-clean";
          }
        }

        if (inv) invert_bits(dec_raw_bits, bit_len);
      }
    }
  }

  if (noisy_reason != NULL) {
#if RFID_DECODE_DIAG_LOG
    LOG_WRN("[NOISY-%s] bad=%d raw40=%010llX low16=%u", noisy_reason, noisy_bad,
            (unsigned long long)noisy_code, (uint16_t)(noisy_code & 0xFFFFULL));
#endif
    if (confirm_em4100_candidate(noisy_code, noisy_reason)) {
      *out_code = noisy_code;
      *out_bits = noisy_bits;
      *out_half_windows = (int)noisy_half_q8;
      *out_offset = (int)noisy_offset_q8;
      *out_inverted = noisy_inv != 0;
      *out_bad_pairs = noisy_bad;
      return noisy_frame_off;
    }
  }

  if (log_best) {
    LOG_INF("%s_best: score=%d half_q8=%u off_q8=%u frame=%d inv=%d", tag,
            best_score, best_half_q8, best_offset_q8, best_frame_off, best_inv);
    LOG_INF("%s_best: bits=%d bad=%d header=%d row=%d col=%d stop=%d", tag,
            best_bits, best_bad, best_header, best_row, best_col, best_stop);
    LOG_INF("%s_best: raw40=%010llX low16=%u", tag,
            (unsigned long long)best_code, (uint16_t)(best_code & 0xFFFFULL));
  }

  return -1;
}

static int try_em4100_clocked_resync_decode(int level_len, uint64_t* out_code,
                                            int* out_bits,
                                            int* out_half_windows,
                                            int* out_offset, bool* out_inverted,
                                            int* out_bad_pairs, bool log_best) {
  int best_score = 1000;
  uint32_t best_half_q8 = 0;
  uint32_t best_offset_q8 = 0;
  int best_bits = 0;
  int best_bad = 0;
  int best_frame_off = -1;
  int best_inv = 0;
  int best_header = 0;
  int best_row = 0;
  int best_col = 0;
  int best_stop = 0;
  uint64_t best_code = 0;

