Wang860503/nrf5340_discrete_rfid/src/main.c
  if (level_len < 128) return -1;

  const uint32_t level_limit_q8 = (uint32_t)(level_len - 1) << 8;

  for (uint32_t half_q8 = EM_FRAC_HALF_MIN_Q8; half_q8 <= EM_FRAC_HALF_MAX_Q8;
       half_q8 += EM_FRAC_HALF_STEP_Q8) {
    const uint32_t bit_q8 = half_q8 * 2U;

    for (uint32_t offset_q8 = 0; offset_q8 < bit_q8;
         offset_q8 += EM_FRAC_OFFSET_STEP_Q8) {
      int bit_len = 0;
      uint32_t pos_q8 = offset_q8;

      memset(dec_raw_bits, 0, EM_DECODED_BITS_CAP);
      memset(dec_pair_bad, 0, EM_DECODED_BITS_CAP);

      while (pos_q8 + bit_q8 <= level_limit_q8 &&
             bit_len < EM_DECODED_BITS_CAP) {
        uint8_t first = env_majority_level_q8(env_level_samples, level_len,
                                              pos_q8, half_q8);
        uint8_t second = env_majority_level_q8(env_level_samples, level_len,
                                               pos_q8 + half_q8, half_q8);
        bool bad_pair = first == second;

        if (bad_pair) dec_pair_bad[bit_len] = 1;
        dec_raw_bits[bit_len++] = second;

        /* EM4095-style resync: when the sampled bit repeats unexpectedly,
         * shift the next sampling point by a half bit instead of staying
         * permanently out of phase. */
        pos_q8 += bad_pair ? half_q8 : bit_q8;
      }

      if (bit_len < 64) continue;

      for (int inv = 0; inv <= 1; inv++) {
        if (inv) invert_bits(dec_raw_bits, bit_len);

        for (int off = 0; off <= bit_len - 64; off++) {
          uint64_t candidate_code;
          const char* candidate_reason;
          int header_err;
          int row_err;
          int col_err;
          int stop_err;
          int frame_bad = count_bad_pairs_in_frame(off);
          int score = em4100_frame_error_score(dec_raw_bits, off, &header_err,
                                               &row_err, &col_err, &stop_err);
          uint64_t code = decode_card_code((uint8_t*)&dec_raw_bits[off]);

          if (score < best_score) {
            best_score = score;
            best_half_q8 = half_q8;
            best_offset_q8 = offset_q8;
            best_bits = bit_len;
            best_bad = frame_bad;
            best_frame_off = off;
            best_inv = inv;
            best_header = header_err;
            best_row = row_err;
            best_col = col_err;
            best_stop = stop_err;
            best_code = code;
          }

          if (frame_bad <= EM_LEVEL_MAX_FRAME_BAD_PAIRS &&
              em4100_candidate_from_parity(dec_raw_bits, off, &candidate_code,
                                           &candidate_reason)) {
            if (confirm_em4100_candidate(candidate_code, candidate_reason)) {
              *out_code = candidate_code;
              *out_bits = bit_len;
              *out_half_windows = (int)half_q8;
              *out_offset = (int)offset_q8;
              *out_inverted = inv != 0;
              *out_bad_pairs = frame_bad;
              return off;
            }
          }
        }

        if (inv) invert_bits(dec_raw_bits, bit_len);
      }
    }
  }

  if (log_best) {
    LOG_INF("clocked_best: score=%d half_q8=%u off_q8=%u frame=%d inv=%d",
            best_score, best_half_q8, best_offset_q8, best_frame_off, best_inv);
    LOG_INF("clocked_best: bits=%d bad=%d header=%d row=%d col=%d stop=%d",
            best_bits, best_bad, best_header, best_row, best_col, best_stop);
    LOG_INF("clocked_best: raw40=%010llX low16=%u",
            (unsigned long long)best_code, (uint16_t)(best_code & 0xFFFFULL));
  }

  return -1;
}

/* ============================================================
 * 邊緣計時 EM4100 Manchester 解碼器
 * 不需要預先知道 bit rate，直接從 edge 間距推算 T/2。
 * 適用 RF/64(T/2=2win=256µs) 和 RF/96(T/2=3win=384µs) 等不同速率。
 *
 * Manchester 規則（Thomas convention，EM4100 採用）：
 *   "1" bit = 前半 HIGH、後半 LOW；mid-bit edge = H→L
 *   "0" bit = 前半 LOW、後半 HIGH；mid-bit edge = L→H
 *   同類 bit 相連 → bit boundary 有 edge（SHORT 間距）
 *   不同類 bit 相連 → boundary 無 edge（LONG 間距 ≈ T = 2×T/2）
 * ============================================================ */
static void saadc_edge_timing_decode_log(int level_len) {
#if !RFID_DECODE_DIAG_LOG
  return;
#endif
  if (level_len < 64) return;

  /* ---- Step 1: 門限 127，找出所有邊緣 ---- */
  int n_edges = 0;
  uint8_t prev = env_edge_samples[0] > 127U ? 1U : 0U;
  for (int i = 1; i < level_len && n_edges < 799; i++) {
    uint8_t cur = env_edge_samples[i] > 127U ? 1U : 0U;
    if (cur != prev) {
      em_et_edge_pos[n_edges] = (int16_t)i;
      em_et_edge_dir[n_edges] = (int8_t)(cur ? 1 : -1);
      n_edges++;
    }
    prev = cur;
  }
  if (n_edges < 16) {
    LOG_WRN("!!! [EDGE-DEC] edges=%d too few (threshold=127)", n_edges);
    return;
  }

  /* ---- Step 2: 統計間距直方圖，找出 T/2 ---- */
  int hist[16] = {0};
  for (int i = 1; i < n_edges; i++) {
    int iv = em_et_edge_pos[i] - em_et_edge_pos[i - 1];
    if (iv >= 1 && iv < 16) hist[iv]++;
  }
  int half_t = 2;
  int max_cnt = 0;
  for (int t = 1; t <= 8; t++) {
    if (hist[t] > max_cnt) {
      max_cnt = hist[t];
      half_t = t;
    }
  }
  /* 印出間距分佈（bins 1..10） */
  LOG_WRN(
      "!!! [EDGE-DEC] edges=%d half_t=%d (cnt=%d) hist:"
      " 1=%d 2=%d 3=%d 4=%d 5=%d 6=%d 7=%d 8=%d 9=%d 10=%d",
      n_edges, half_t, max_cnt, hist[1], hist[2], hist[3], hist[4], hist[5],
      hist[6], hist[7], hist[8], hist[9], hist[10]);

  /* SHORT 門限：< 1.5 × T/2；LONG：≥ 1.5 × T/2 */
  /* 整數版：SHORT if (2*iv) < 3*half_t */
  int short_limit2 = 3 * half_t; /* 2×interval < 3×half_t → SHORT */

  /* ---- Step 3: 嘗試兩種起始 edge (0 = 假設 mid-bit, 1 = 假設從 boundary 後)
   * ---- */
  int best_row_err = 99, best_col_err = 99;
  uint64_t best_code = 0;
  int best_half_t = half_t, best_n_bits = 0;

  for (int start_ei = 0; start_ei <= 1; start_ei++) {
    /* 解碼 bit 串 */
    int n_bits = 0;
    int ei = start_ei;
    while (ei < n_edges && n_bits < 799) {
      /* 視 ei 為 mid-bit edge */
      uint8_t bit = (em_et_edge_dir[ei] < 0) ? 1U : 0U; /* H→L="1", L→H="0" */
      em_et_bits[n_bits++] = bit;

      if (ei + 1 >= n_edges) break;
      int iv = em_et_edge_pos[ei + 1] - em_et_edge_pos[ei];

      if ((2 * iv) < short_limit2) {
        /* SHORT：同類 bit → boundary edge 存在，跳過 boundary */
        ei += 2;
      } else {
        /* LONG：不同類 bit → 直接到下一個 mid-bit edge */
        ei += 1;
      }
    }
    if (n_bits < 64) continue;

    /* ---- Step 4: 在 bit 串中搜尋 EM4100 header (9+ 個 "1") ---- */
    int found_in_stream = 0;
    for (int s = 0; s + 64 <= n_bits; s++) {
      int hdr = 0;
      while (s + hdr < n_bits && em_et_bits[s + hdr]) hdr++;
      if (hdr < 9) continue;

      int P = s + hdr;
      if (P + 55 > n_bits) continue;

      /* 解 10 rows × 5 bits + 5 col/stop */
      uint8_t rd[10][4];
      int row_err = 0;
      for (int r = 0; r < 10; r++) {
        uint8_t par = 0;
        for (int b = 0; b < 4; b++) {
          rd[r][b] = em_et_bits[P + r * 5 + b];
          par ^= rd[r][b];
        }
        if (par != em_et_bits[P + r * 5 + 4]) row_err++;
      }
      int col_err = 0;
      for (int c = 0; c < 4; c++) {
        uint8_t cp = 0;
        for (int r = 0; r < 10; r++) cp ^= rd[r][c];
        if (cp != em_et_bits[P + 50 + c]) col_err++;
      }

      uint64_t code = 0;
      for (int r = 0; r < 10; r++) {
        for (int b = 0; b < 4; b++) code = (code << 1) | rd[r][b];
      }
      uint16_t low16 = (uint16_t)(code & 0xFFFFULL);

      /* 只印 parity 相對好的候選（≤ 3 total errors） */
      if (row_err + col_err <= 4) {
        LOG_WRN(
            "!!! [EDGE-DEC] si=%d bits=%d hdr=%d P=%d"
            " row=%d col=%d raw40=%010llX low16=%04X",
            start_ei, n_bits, hdr, P, row_err, col_err,
            (unsigned long long)code, (unsigned int)low16);
        if (low16 == EM_ALIGN_TARGET_LOW16) {
          LOG_WRN("!!! [EDGE-MATCH] TARGET 0x%04X FOUND by edge-timing!",
                  EM_ALIGN_TARGET_LOW16);
        }
        if (row_err + col_err < best_row_err + best_col_err) {
          best_row_err = row_err;
          best_col_err = col_err;
          best_code = code;
          best_n_bits = n_bits;
          best_half_t = half_t;
        }
        found_in_stream++;
        if (found_in_stream >= 4) break;
      }
    }
    if (!found_in_stream && start_ei == 1) {
      LOG_WRN("!!! [EDGE-DEC] si=%d bits=%d no valid frame", start_ei, n_bits);
    }
  } /* end start_ei loop */

