Wang860503/nrf5340_discrete_rfid/src/main.c
  if (best_row_err + best_col_err <= 3) {
    LOG_WRN(
        "!!! [EDGE-BEST] half_t=%d bits=%d row=%d col=%d"
        " raw40=%010llX low16=%04X",
        best_half_t, best_n_bits, best_row_err, best_col_err,
        (unsigned long long)best_code, (unsigned int)(best_code & 0xFFFFULL));
  }
}

static int try_em4100_edge_delta_decode(int level_len, uint64_t* out_code,
                                        int* out_bits, int* out_half_windows,
                                        int* out_offset, bool* out_inverted,
                                        int* out_bad_pairs, bool log_best) {
  int best_score = 1000;
  uint32_t best_half_q8 = 0;
  uint32_t best_offset_q8 = 0;
  int best_bits = 0;
  int best_bad = 0;
  int best_frame_off = -1;
  int best_inv = 0;
  int best_header = 0;
  int best_row = 0;
  int best_col = 0;
  int best_stop = 0;
  uint64_t best_code = 0;
  int best_bits_snapshot_len = 0;
  uint32_t best_half_q8_snap = 0;
  int best_inv_snap = 0;
  uint32_t best_off_q8_snap = 0;
  int inv_best_hits[2] = {0, 0};
  int inv_parity_hits[2] = {0, 0};
  int inv_bad_sum[2] = {0, 0};

  if (level_len < 128) return -1;

  const uint32_t level_limit_q8 = (uint32_t)(level_len - 1) << 8;

  const uint32_t delta_half_start_q8 =
#if EM_DELTA_DEBUG_RAW_MODE
      EM_DELTA_DEBUG_HALF_Q8;
#else
      EM_DELTA_HALF_MIN_Q8;
#endif
  const uint32_t delta_half_end_q8 =
#if EM_DELTA_DEBUG_RAW_MODE
      EM_DELTA_DEBUG_HALF_Q8;
#else
      EM_DELTA_HALF_MAX_Q8;
#endif

  for (uint32_t half_q8 = delta_half_start_q8; half_q8 <= delta_half_end_q8;
       half_q8 += EM_DELTA_HALF_STEP_Q8) {
    const uint32_t bit_q8 = half_q8 * 2U;

    for (uint32_t offset_q8 =
#if EM_DELTA_DEBUG_RAW_MODE
             EM_DELTA_DEBUG_OFF_Q8;
#else
             0;
#endif
         offset_q8 <
#if EM_DELTA_DEBUG_RAW_MODE
         (EM_DELTA_DEBUG_OFF_Q8 + 1U);
#else
         bit_q8;
#endif
         offset_q8 += EM_DELTA_OFFSET_STEP_Q8) {
      int bit_len = 0;

      memset(dec_raw_bits, 0, EM_DECODED_BITS_CAP);
      memset(dec_pair_bad, 0, EM_DECODED_BITS_CAP);

      for (uint32_t pos_q8 = offset_q8;
           pos_q8 + bit_q8 <= level_limit_q8 && bit_len < EM_DECODED_BITS_CAP;
           pos_q8 += bit_q8) {
        int first_sum = env_edge_sum_q8(level_len, pos_q8, half_q8);
        int second_sum = env_edge_sum_q8(level_len, pos_q8 + half_q8, half_q8);
        int diff = second_sum - first_sum;

        if (diff < 0) diff = -diff;
        if (diff <= EM_DELTA_MIN_DIFF) {
          dec_pair_bad[bit_len] = 1;
        }
        dec_raw_bits[bit_len++] = second_sum > first_sum ? 1U : 0U;
      }

      if (bit_len < 64) continue;

      for (int inv = 0; inv <= 1; inv++) {
        if (inv) invert_bits(dec_raw_bits, bit_len);
        int pass_begin = 0;
        int pass_end = 1;
        int off_min = 0;
        int off_max = bit_len - 64;
        bool have_focus = em_delta_tracked_frame_off >= off_min &&
                          em_delta_tracked_frame_off <= off_max;
        if (!have_focus) {
          pass_begin = 1;
          pass_end = 1;
        }

        for (int pass = pass_begin; pass <= pass_end; pass++) {
          int focus_lo = off_min;
          int focus_hi = off_max;

          if (pass == 0) {
            focus_lo = em_delta_tracked_frame_off - EM_DELTA_TRACK_OFF_WINDOW;
            focus_hi = em_delta_tracked_frame_off + EM_DELTA_TRACK_OFF_WINDOW;
            if (focus_lo < off_min) focus_lo = off_min;
            if (focus_hi > off_max) focus_hi = off_max;
          }

          for (int off = focus_lo; off <= focus_hi; off++) {
            if (pass == 1 && have_focus) {
              int d = off - em_delta_tracked_frame_off;
              if (d < 0) d = -d;
              if (d <= EM_DELTA_TRACK_OFF_WINDOW) {
                continue;
              }
            }

            uint64_t candidate_code;
            const char* candidate_reason;
            int header_err;
            int row_err;
            int col_err;
            int stop_err;
            int frame_bad = count_bad_pairs_in_frame(off);
            int score = em4100_frame_error_score(dec_raw_bits, off, &header_err,
                                                 &row_err, &col_err, &stop_err);
            uint64_t code = decode_card_code((uint8_t*)&dec_raw_bits[off]);

            if (header_err <= 1 && !RFID_SAADC_LOG_IMPORTANT_ONLY) {
              LOG_WRN(
                  "[FRAME-CANDIDATE] off=%d inv=%d raw40=%010llX hdr=%d row=%d "
                  "col=%d stop=%d bad=%d score=%d",
                  off, inv, (unsigned long long)code, header_err, row_err,
                  col_err, stop_err, frame_bad, score);
            }

            inv_bad_sum[inv] += frame_bad;

            if (score < best_score) {
              best_score = score;
              best_half_q8 = half_q8;
              best_offset_q8 = offset_q8;
              best_bits = bit_len;
              best_bad = frame_bad;
              best_frame_off = off;
              best_inv = inv;
              best_header = header_err;
              best_row = row_err;
              best_col = col_err;
              best_stop = stop_err;
              best_code = code;
              inv_best_hits[inv]++;
              memcpy(em_delta_best_bits_snapshot, dec_raw_bits,
                     (size_t)bit_len);
              best_bits_snapshot_len = bit_len;
              best_half_q8_snap = half_q8;
              best_inv_snap = inv;
              best_off_q8_snap = offset_q8;
            }

            if (frame_bad <= EM_LEVEL_MAX_FRAME_BAD_PAIRS &&
                em4100_candidate_from_parity(dec_raw_bits, off, &candidate_code,
                                             &candidate_reason)) {
              inv_parity_hits[inv]++;
              if (confirm_em4100_candidate(candidate_code, candidate_reason)) {
                *out_code = candidate_code;
                *out_bits = bit_len;
                *out_half_windows = (int)half_q8;
                *out_offset = (int)offset_q8;
                *out_inverted = inv != 0;
                *out_bad_pairs = frame_bad;
                em_delta_tracked_frame_off = off;
#if EM_DELTA_DEBUG_RAW_MODE
                LOG_WRN("[DEBUG-RAW] raw40=%010llX bits=%d off=%d inv=%d",
                        (unsigned long long)candidate_code, bit_len, off, inv);
                if (inv) invert_bits(dec_raw_bits, bit_len);
                return -1;
#else
                return off;
#endif
              }
            }
          }
        }

        if (inv) invert_bits(dec_raw_bits, bit_len);
      }
    }
  }

  if (log_best) {
    LOG_INF("delta_best: score=%d half_q8=%u off_q8=%u frame=%d inv=%d",
            best_score, best_half_q8, best_offset_q8, best_frame_off, best_inv);
    LOG_INF("delta_best: bits=%d bad=%d header=%d row=%d col=%d stop=%d",
            best_bits, best_bad, best_header, best_row, best_col, best_stop);
    LOG_INF("delta_best: raw40=%010llX low16=%u", (unsigned long long)best_code,
            (uint16_t)(best_code & 0xFFFFULL));
    LOG_WRN(
        "delta_inv_stats: inv0 best=%d parity=%d bad_sum=%d | inv1 best=%d "
        "parity=%d bad_sum=%d",
        inv_best_hits[0], inv_parity_hits[0], inv_bad_sum[0], inv_best_hits[1],
        inv_parity_hits[1], inv_bad_sum[1]);
    if (best_bits_snapshot_len >= 64) {
      int h_off = find_header_offset(em_delta_best_bits_snapshot,
                                     best_bits_snapshot_len);
      if (h_off >= 0) {
        uint64_t code =
            decode_card_code((uint8_t*)&em_delta_best_bits_snapshot[h_off]);
        LOG_WRN("!!! [MANUAL-DECODE] Found Header at offset=%d, ID=%010llX",
                h_off, (unsigned long long)code);
        (void)confirm_em4100_candidate(code, "manual-delta");
      } else {
        LOG_WRN(
            "!!! [MANUAL-DECODE] No header found. First bits: %d%d%d%d%d%d%d%d",
            em_delta_best_bits_snapshot[0], em_delta_best_bits_snapshot[1],
            em_delta_best_bits_snapshot[2], em_delta_best_bits_snapshot[3],
            em_delta_best_bits_snapshot[4], em_delta_best_bits_snapshot[5],
            em_delta_best_bits_snapshot[6], em_delta_best_bits_snapshot[7]);
      }
#if EM_DELTA_DEBUG_RAW_MODE
      char raw_bits_inv[65];
      uint16_t head_hex = 0;

