Wang860503/nrf5340_discrete_rfid/src/main.c
      memcpy(em_delta_inv_bits, em_delta_best_bits_snapshot,
             (size_t)best_bits_snapshot_len);
      invert_bits(em_delta_inv_bits, best_bits_snapshot_len);
      for (int k = 0; k < 64; k++) {
        raw_bits_inv[k] = em_delta_inv_bits[k] ? '1' : '0';
      }
      raw_bits_inv[64] = '\0';
      for (int k = 0; k < 16; k++) {
        head_hex =
            (uint16_t)((head_hex << 1) | (em_delta_inv_bits[k] ? 1U : 0U));
      }
      LOG_WRN("!!! [RAW-BITS-INV] %s", raw_bits_inv);
      LOG_WRN("!!! [RAW-HEAD-HEX] %04X", head_hex);
#endif
    }
    if (best_frame_off >= 0) {
      em_delta_tracked_frame_off = best_frame_off;
    }
    em_delta_shift_log_div++;
    if (best_frame_off >= 0 && best_bits_snapshot_len >= 64 &&
        (em_delta_shift_log_div % EM_DELTA_SHIFT_LOG_EVERY) == 0U) {
      em4100_log_shift_window(em_delta_best_bits_snapshot,
                              best_bits_snapshot_len, best_frame_off, "delta");
    }
    if (best_frame_off >= 0 && best_bits_snapshot_len >= 64) {
      /* 暴力位移掃描：0~127 shift，命中目標 ID 就印出 */
      for (int shift = 0; shift < 128; shift++) {
        uint64_t test_code = 0ULL;
        for (int i = 0; i < 40; i++) {
          int idx = (best_frame_off + shift + i) % best_bits_snapshot_len;
          test_code = (test_code << 1) |
                      (em_delta_best_bits_snapshot[idx] ? 1ULL : 0ULL);
        }
        uint16_t low16 = (uint16_t)(test_code & 0xFFFFULL);
        uint16_t low16_rev = reverse16(low16);
        if ((low16 == EM_ALIGN_TARGET_LOW16) ||
            (low16_rev == EM_ALIGN_TARGET_LOW16)) {
          LOG_WRN(
              "!!! [FOUND-ALIGNMENT] shift=%d, code=%010llX low16=%04X "
              "low16_rev=%04X",
              shift, (unsigned long long)test_code, (unsigned int)low16,
              (unsigned int)low16_rev);
          /* 完整循環掃描 snapshot 所有起點（兩種極性）。
           * 重要：FOUND-ALIGNMENT 的 low16=500F 是比對「原始 40
           * 位元」的最後16位元， 這不等於解碼後的卡片 ID
           * low16！所以要分開追蹤： (A) 全局最佳 score frame（任何 ID） (B)
           * 解碼後 low16==TARGET 的最佳 score frame 兩者都回報，(B)
           * 才是真正找到目標卡。 */
          {
            int fa_len2 = best_bits_snapshot_len;
            int fa_scan_found = 0;
            /* (A) 全局最佳 */
            int fa_best_sc = 99, fa_best_s = -1, fa_best_pol = 0;
            uint64_t fa_best_code = 0;
            /* (B) 目標 ID 最佳 */
            int fa_tgt_sc = 99, fa_tgt_s = -1, fa_tgt_pol = 0;
            uint64_t fa_tgt_code = 0;
            for (int fa_pol = 0; fa_pol <= 1; fa_pol++) {
              for (int fa_s = 0; fa_s < fa_len2; fa_s++) {
                int fa_hok = 1;
                for (int k = 0; k < 9 && fa_hok; k++) {
                  if ((em_delta_best_bits_snapshot[(fa_s + k) % fa_len2] ^
                       fa_pol) == 0)
                    fa_hok = 0;
                }
                if (!fa_hok) continue;
                uint8_t fa_f[64];
                for (int k = 0; k < 64; k++)
                  fa_f[k] = em_delta_best_bits_snapshot[(fa_s + k) % fa_len2] ^
                            (uint8_t)fa_pol;
                int fa_row = 0;
                uint8_t fa_cs[4] = {0, 0, 0, 0};
                for (int r = 0; r < 10; r++) {
                  int b = 9 + r * 5;
                  uint8_t p = 0;
                  for (int c = 0; c < 4; c++) {
                    p ^= fa_f[b + c];
                    fa_cs[c] ^= fa_f[b + c];
                  }
                  if (p != fa_f[b + 4]) fa_row++;
                }
                int fa_col = 0;
                for (int c = 0; c < 4; c++)
                  if (fa_cs[c] != fa_f[59 + c]) fa_col++;
                int fa_sc = fa_row + fa_col + (fa_f[63] ? 1 : 0);
                uint64_t fc = decode_card_code(fa_f);
                uint16_t fl16 = (uint16_t)(fc & 0xFFFFULL);
                /* (A) 追蹤全域最佳 score */
                if (fa_sc < fa_best_sc) {
                  fa_best_sc = fa_sc;
                  fa_best_s = fa_s;
                  fa_best_pol = fa_pol;
                  fa_best_code = fc;
                }
                /* (B) 追蹤解碼後 low16=TARGET 的最佳 score */
                if (fl16 == EM_ALIGN_TARGET_LOW16 && fa_sc < fa_tgt_sc) {
                  fa_tgt_sc = fa_sc;
                  fa_tgt_s = fa_s;
                  fa_tgt_pol = fa_pol;
                  fa_tgt_code = fc;
                }
                /* score=0 直接 confirm */
                if (fa_sc == 0 && fa_scan_found < 4) {
                  LOG_WRN("!!! [FA-SCAN p=%d s=%d] ID=%010llX l16=%04X", fa_pol,
                          fa_s, (unsigned long long)fc, (unsigned int)fl16);
                  fa_scan_found++;
                  (void)confirm_em4100_candidate(fc, "fa-scan");
                }
              }
            }
            /* 目標卡：回報解碼後 low16=TARGET 的最佳 frame（不管 score） */
            if (fa_tgt_s >= 0) {
              uint16_t tl16 = (uint16_t)(fa_tgt_code & 0xFFFFULL);
              LOG_WRN("!!! [FA-TARGET sc=%d p=%d s=%d] ID=%010llX l16=%04X",
                      fa_tgt_sc, fa_tgt_pol, fa_tgt_s,
                      (unsigned long long)fa_tgt_code, (unsigned int)tl16);
              if (fa_tgt_sc == 0)
                (void)confirm_em4100_candidate(fa_tgt_code, "fa-target");
            }
            /* 若未找到 score=0，回報全域最佳 */
            if (!fa_scan_found) {
              uint16_t fl16b = (uint16_t)(fa_best_code & 0xFFFFULL);
              LOG_WRN("!!! [FA-SCAN] best sc=%d p=%d s=%d ID=%010llX l16=%04X",
                      fa_best_sc, fa_best_pol, fa_best_s,
                      (unsigned long long)fa_best_code, (unsigned int)fl16b);
            }
          }
        }
      }
      /* 診斷：找出最長的連續 1 串 (應≥9 才能包含 EM4100 header) 以及最長 0 串
       */
      int max_run1 = 0, cur_run1 = 0, max_run1_pos = -1, cur_run1_start = 0;
      int max_run0 = 0, cur_run0 = 0, max_run0_pos = -1, cur_run0_start = 0;
      for (int i = 0; i < best_bits_snapshot_len; i++) {
        if (em_delta_best_bits_snapshot[i]) {
          if (cur_run1 == 0) cur_run1_start = i;
          cur_run1++;
          if (cur_run1 > max_run1) {
            max_run1 = cur_run1;
            max_run1_pos = cur_run1_start;
          }
          cur_run0 = 0;
        } else {
          if (cur_run0 == 0) cur_run0_start = i;
          cur_run0++;
          if (cur_run0 > max_run0) {
            max_run0 = cur_run0;
            max_run0_pos = cur_run0_start;
          }
          cur_run1 = 0;
        }
      }
      LOG_WRN("!!! [MAX-RUN-1] len=%d pos=%d bits_total=%d half_q8=%u inv=%d",
              max_run1, max_run1_pos, best_bits_snapshot_len,
              (unsigned)best_half_q8_snap, best_inv_snap);
      LOG_WRN("!!! [MAX-RUN-0] len=%d pos=%d", max_run0, max_run0_pos);
      /* 印出從 MAX-RUN-1 位置起的 48 bits (= 真正 header 起點) */
      {
        char bits48[49];
        int snap_start = (max_run1_pos >= 0) ? max_run1_pos : 0;
        int snap_avail = best_bits_snapshot_len - snap_start;
        int snap_print = (snap_avail < 48) ? snap_avail : 48;
        for (int i = 0; i < snap_print; i++) {
          bits48[i] = em_delta_best_bits_snapshot[snap_start + i] ? '1' : '0';
        }
        bits48[snap_print] = '\0';
        LOG_WRN("!!! [SNAP-HEAD@%d] 48bits: %s", snap_start, bits48);
      }
      /* 從最長 1-run header 位置重新解碼 (最可靠的 header 起點) */
      if (max_run1 >= 9 && (max_run1_pos + 64) <= best_bits_snapshot_len) {
        uint64_t code_bh = decode_card_code(
            (uint8_t*)&em_delta_best_bits_snapshot[max_run1_pos]);
        uint16_t bh_low16 = (uint16_t)(code_bh & 0xFFFFULL);
        LOG_WRN("!!! [BEST-HDR-DEC] hdr_pos=%d len=%d ID=%010llX low16=%04X",
                max_run1_pos, max_run1, (unsigned long long)code_bh,
                (unsigned int)bh_low16);
        if (bh_low16 == EM_ALIGN_TARGET_LOW16) {
          LOG_WRN("!!! [BEST-HDR-MATCH] TARGET %04X FOUND!",
                  EM_ALIGN_TARGET_LOW16);
        }
        (void)confirm_em4100_candidate(code_bh, "best-hdr");
      }
      /* Differential Manchester 解碼診斷：計算相鄰 bit XOR 串的最長連續 1 */
      /* DM 編碼中 "1 bit" = 方向轉換，若卡片使用 DM，header 9個"1"會在 XOR
       * 串中呈現為 9個連續的1（每個相鄰 bit 都不同）或9個連續的0（每個相鄰 bit
       * 都相同） */
      {
        int dm_max1 = 0, dm_cur1 = 0, dm_max1_pos = -1, dm_cur1_start = 0;
        int dm_max0 = 0, dm_cur0 = 0, dm_max0_pos = -1, dm_cur0_start = 0;
        for (int i = 1; i < best_bits_snapshot_len; i++) {
          uint8_t xor_bit = em_delta_best_bits_snapshot[i] ^
                            em_delta_best_bits_snapshot[i - 1];
          if (xor_bit) {
            if (dm_cur1 == 0) dm_cur1_start = i;
            dm_cur1++;
            if (dm_cur1 > dm_max1) {
              dm_max1 = dm_cur1;
              dm_max1_pos = dm_cur1_start;
            }
            dm_cur0 = 0;
          } else {
            if (dm_cur0 == 0) dm_cur0_start = i;
            dm_cur0++;
            if (dm_cur0 > dm_max0) {
              dm_max0 = dm_cur0;
              dm_max0_pos = dm_cur0_start;
            }
            dm_cur1 = 0;
          }
        }
        LOG_WRN(
            "!!! [DM-RUN] trans-1=%d pos=%d same-0=%d pos=%d (DM header needs "
            "8+)",
            dm_max1, dm_max1_pos, dm_max0, dm_max0_pos);

        /* 嘗試 Differential Manchester EM4100 解碼：
         * XOR stream dm_bit[i] = snap[i+1] XOR snap[i] = DM 解碼後資料位元。
         * 掃描所有資料起始位置 P：要求 P 前面有 7..9 個連續 XOR=1 (DM header)。
         * 每個候選位置嘗試解 10 rows × 5 bit + 5 col/stop。 */
        {
          int xlen = best_bits_snapshot_len - 1;
          /* 建立 XOR 串 (reuse em_delta_inv_bits as temp buffer) */
          for (int i = 0; i < xlen; i++) {
            em_delta_inv_bits[i] = em_delta_best_bits_snapshot[i + 1] ^
                                   em_delta_best_bits_snapshot[i];
          }
          int dm_found = 0; /* 本輪找到有效 DM frame 次數 */
          /* 對每個候選資料起始位置 P 做測試 */
          for (int P = 7; P <= xlen - 55; P++) {
            /* 計算 P 前面連續 XOR=1 的長度（最多回看 10 位） */
            int hlen = 0;
            for (int h = 1; h <= 10 && (P - h) >= 0; h++) {
              if (em_delta_inv_bits[P - h])
                hlen++;
              else
                break;
            }
            if (hlen < 7) continue; /* header 太短，跳過 */
            /* 確認 P-hlen-1 位置（header 前一位）為 XOR=0 或超出邊界
             * 若沒有這個邊界，說明 P 不是資料起始而是 header 中間 */
            int before_hdr = P - hlen - 1;
            if (before_hdr >= 0 && em_delta_inv_bits[before_hdr]) {
              continue; /* header 前面仍是 XOR=1 → P 不是資料起始 */
            }
            /* 嘗試解碼 EM4100 資料：10 rows × 5 bits + 5 col/stop */
            uint8_t row_data[10][4];
            int row_err = 0;
            for (int r = 0; r < 10; r++) {
              uint8_t parity = 0;
              for (int b = 0; b < 4; b++) {
                uint8_t d = em_delta_inv_bits[P + r * 5 + b];
                row_data[r][b] = d;
                parity ^= d;
              }
              if (parity != em_delta_inv_bits[P + r * 5 + 4]) row_err++;
            }
            if (row_err > 2) continue;
            /* Column parities */
            int col_err = 0;
            for (int c = 0; c < 4; c++) {
              uint8_t cparity = 0;
              for (int r = 0; r < 10; r++) cparity ^= row_data[r][c];
              if (cparity != em_delta_inv_bits[P + 50 + c]) col_err++;
            }
            if (col_err > 2) continue;
            uint8_t stop_bit = em_delta_inv_bits[P + 54];
            /* 組合 raw40 */
            uint64_t dm_raw40 = 0;
            for (int r = 0; r < 10; r++) {
              for (int b = 0; b < 4; b++) {
                dm_raw40 = (dm_raw40 << 1) | row_data[r][b];
              }
            }
            uint16_t dm_low16 = (uint16_t)(dm_raw40 & 0xFFFFULL);
            dm_found++;
            LOG_WRN(
                "!!! [DM-DECODE] hdr=%d P=%d row_err=%d col_err=%d"
                " stop=%d raw40=%010llX low16=%04X",
                hlen, P, row_err, col_err, (int)stop_bit,
                (unsigned long long)dm_raw40, (unsigned int)dm_low16);
            if (dm_low16 == EM_ALIGN_TARGET_LOW16) {
              LOG_WRN("!!! [DM-MATCH] TARGET FOUND! low16=0x%04X (%u)",
                      (unsigned int)dm_low16, (unsigned int)dm_low16);
            }
            if (dm_found >= 6) break; /* 最多印 6 個，避免 log 爆炸 */
          }
          if (dm_found == 0) {
            LOG_WRN("!!! [DM-DECODE] no valid frame (row+col<=2 each)");
          }
        }

