Wang860503/nrf5340_discrete_rfid/src/main.c
        /* 印出 snapshot 起始位置的前 24 個 env_edge_samples 原始振幅值
         * （4 windows/bit × 6 bits = 24 值，可看出 Manchester / DM 波形特徵）
         */
        {
          int win_start = (int)(best_off_q8_snap >> 8U);
          if (win_start < 0) win_start = 0;
          char env_buf[128];
          int ew = 0;
          int print_cnt = 0;
          for (int w = win_start;
               w < win_start + 24 && w < level_len && print_cnt < 24;
               w++, print_cnt++) {
            int written = snprintf(env_buf + ew, (int)sizeof(env_buf) - ew - 1,
                                   "%u ", (unsigned)env_edge_samples[w]);
            if (written < 0 || ew + written >= (int)sizeof(env_buf) - 1) break;
            ew += written;
          }
          env_buf[ew] = '\0';
          LOG_WRN("!!! [ENV-DUMP] win=%d(4win/bit): %s", win_start, env_buf);
        }
      }
    }
#if EM_DELTA_DEBUG_RAW_MODE
    LOG_WRN("[DEBUG-RAW] raw40=%010llX bits=%d frame=%d inv=%d",
            (unsigned long long)best_code, best_bits, best_frame_off, best_inv);
#endif
  }

#if EM_DELTA_DEBUG_RAW_MODE
  return -1;
#else
  return -1;
#endif
}

#if EM_ENABLE_EDGE_THRESHOLD_SWEEP
static int try_em4100_edge_threshold_decode(
    int level_len, uint32_t min_edges, uint32_t max_edges, uint64_t* out_code,
    int* out_bits, int* out_half_windows, int* out_offset, bool* out_inverted,
    int* out_bad_pairs, uint32_t* out_threshold) {
  if (level_len < 128 || max_edges <= min_edges) return -1;

  for (uint32_t threshold = min_edges; threshold < max_edges; threshold++) {
    for (int i = 0; i < level_len; i++) {
      env_level_samples[i] = env_edge_samples[i] > threshold ? 1U : 0U;
    }

    int slide = try_em4100_fractional_level_decode(
        level_len, out_code, out_bits, out_half_windows, out_offset,
        out_inverted, out_bad_pairs, false, "edge_frac");
    if (slide >= 0) {
      *out_threshold = threshold;
      return slide;
    }
  }

  return -1;
}
#endif

#if EM_ENABLE_TICK_FALLBACK_DIAG
void decode_bitstream_variant(uint16_t total_ticks, uint8_t* out_bits,
                              int* out_len, uint8_t initial_val,
                              int initial_short_state) {
  int bit_idx = 0;
  uint8_t current_val = initial_val;
  int state = initial_short_state;

  memset(out_bits, 0, EM_DECODED_BITS_CAP);
  *out_len = 0;

  for (int i = 0; i < total_ticks; i++) {
    uint32_t T = tick_buffer[i];
    uint32_t num_1t;

    if (T < EM_EDGE_MIN_US) {
      state = 0;
      continue;
    }

    num_1t = (T + (EM_CLOCK_BASE_1T_US / 2U)) / EM_CLOCK_BASE_1T_US;
    if (num_1t == 0U) {
      state = 0;
      continue;
    }
    if (num_1t > EM_TICK_SPLIT_MAX_PARTS) {
      num_1t = EM_TICK_SPLIT_MAX_PARTS;
    }

    for (uint32_t part = 0; part < num_1t; part++) {
      if (part + 1U < num_1t) {
        current_val = !current_val;
        if (bit_idx < EM_DECODED_BITS_CAP) out_bits[bit_idx++] = current_val;
        state = 0;
        part++;
      } else {
        if (state == 0) {
          state = 1;
        } else {
          if (bit_idx < EM_DECODED_BITS_CAP) out_bits[bit_idx++] = current_val;
          state = 0;
        }
      }
    }
  }
  *out_len = bit_idx;
}

void decode_bitstream(uint16_t total_ticks, uint8_t* out_bits, int* out_len) {
  decode_bitstream_variant(total_ticks, out_bits, out_len, 1, 0);
}

static int try_em4100_edge_capture_decode(int tick_count, uint64_t* out_code,
                                          int* out_bits, bool* out_inverted) {
  int best_score = 1000;
  uint32_t best_unit_us = 0;
  uint32_t best_tol_pct = 0;
  int best_resync = 0;
  int best_phase = 0;
  int best_bits = 0;
  int best_bad = 0;
  int best_frame = -1;
  int best_inv = 0;
  int best_header = 0;
  int best_row = 0;
  int best_col = 0;
  int best_stop = 0;
  uint64_t best_code = 0;
  uint64_t reported_codes[8] = {0};
  int reported_count = 0;
  int rescue_best_score = 1000;
  int rescue_best_hb = -1;
  int rescue_best_off = -1;
  int rescue_best_inv = 0;
  int rescue_best_bad = 0;
  int rescue_best_header = 0;
  int rescue_best_row = 0;
  int rescue_best_col = 0;
  int rescue_best_stop = 0;
  uint64_t rescue_best_code = 0;
  scan_vote_candidate_t scan_vote_candidates[EM_SCAN_VOTE_CANDIDATES] = {0};

  for (uint32_t unit_us = EM_EDGECAP_UNIT_MIN_US;
       unit_us <= EM_EDGECAP_UNIT_MAX_US; unit_us += EM_EDGECAP_UNIT_STEP_US) {
    for (uint32_t tol_pct = EM_EDGECAP_TOL_MIN_PCT;
         tol_pct <= EM_EDGECAP_TOL_PCT; tol_pct += EM_EDGECAP_TOL_STEP_PCT) {
      int half_len = 0;

      memset(edgecap_half_bits, 0, EM_DECODED_BITS_CAP);
      memset(edgecap_half_tick_idx, 0, sizeof(edgecap_half_tick_idx));
      memset(edgecap_half_sub_idx, 0, sizeof(edgecap_half_sub_idx));

      for (int i = 0; i < tick_count && half_len < EM_DECODED_BITS_CAP; i++) {
        uint32_t T = tick_buffer[i];
        /* Paper flow: falling edge stores 1, rising edge stores 0. */
        uint8_t half_bit = tick_edge_to_level[i] ? 0U : 1U;
        uint32_t repeat;

        if (!edgecap_repeat_from_gap(T, unit_us, &repeat)) continue;
        if (repeat > EM_EDGECAP_MAX_REPEAT) continue;

        for (uint32_t n = 0; n < repeat && half_len < EM_DECODED_BITS_CAP;
             n++) {
          edgecap_half_bits[half_len] = half_bit;
          edgecap_half_tick_idx[half_len] = (uint16_t)i;
          edgecap_half_sub_idx[half_len] = (uint8_t)n;
          half_len++;
        }
      }

      if (half_len < 128) continue;

      for (int hb_start = 0; hb_start + 127 < half_len; hb_start++) {
        uint8_t rescue_bits[EM_EDGECAP_RESCUE_BITS];
        uint8_t rescue_pair_bad[EM_EDGECAP_RESCUE_BITS];
        uint16_t rescue_half_tick[EM_EDGECAP_RESCUE_BITS];
        int rescue_len = 0;
        int tick_start = edgecap_half_tick_idx[hb_start];
        uint8_t tick_sub_start = edgecap_half_sub_idx[hb_start];

        if (!edgecap_decode_header_rescue_stream(
                tick_count, tick_start, tick_sub_start, unit_us, rescue_bits,
                rescue_pair_bad, rescue_half_tick, &rescue_len)) {
          continue;
        }

        for (int inv = 0; inv <= 1; inv++) {
          uint64_t candidate_code;
          const char* candidate_reason;
          uint8_t sentinel_bit = 1U;

