Wang860503/nrf5340_discrete_rfid/src/main.c
          if (inv) invert_bits(rescue_bits, rescue_len);
          for (int rescue_off = 0; rescue_off + 64 <= rescue_len;
               rescue_off++) {
            int rescue_bad = 0;
            for (int b = 0; b < 64; b++) {
              rescue_bad += rescue_pair_bad[rescue_off + b] ? 1 : 0;
            }
            sentinel_bit = 1U;
            if (rescue_off > 0) {
              sentinel_bit = rescue_bits[rescue_off - 1];
            } else if (edgecap_decode_bit_pair(half_len, hb_start - 2,
                                               &sentinel_bit)) {
              if (inv) sentinel_bit ^= 1U;
            }

            int rescue_header;
            int rescue_row;
            int rescue_col;
            int rescue_stop;
            int rescue_frame_score = em4100_frame_error_score(
                rescue_bits, rescue_off, &rescue_header, &rescue_row,
                &rescue_col, &rescue_stop);
            int rescue_score =
                rescue_frame_score + rescue_bad + (sentinel_bit == 0U ? 0 : 2);
            uint64_t rescue_code =
                decode_card_code((uint8_t*)&rescue_bits[rescue_off]);

            if (rescue_stop == 0) {
              consider_scan_vote_candidate(
                  scan_vote_candidates, &rescue_bits[rescue_off],
                  "rescue-group", rescue_score, rescue_bad,
                  (hb_start / 2) + rescue_off, inv, rescue_code);
            }

            if (rescue_score < rescue_best_score) {
              rescue_best_score = rescue_score;
              rescue_best_hb = hb_start;
              rescue_best_off = rescue_off;
              rescue_best_inv = inv;
              rescue_best_bad = rescue_bad;
              rescue_best_header = rescue_header;
              rescue_best_row = rescue_row;
              rescue_best_col = rescue_col;
              rescue_best_stop = rescue_stop;
              rescue_best_code = rescue_code;
            }

            if (rescue_bad > EM_LEVEL_MAX_FRAME_BAD_PAIRS) continue;

            if (sentinel_bit == 0U &&
                ((em4100_candidate_from_parity(rescue_bits, rescue_off,
                                               &candidate_code,
                                               &candidate_reason) &&
                  strcmp(candidate_reason, "data2") != 0) ||
                 em4100_candidate_from_relaxed_header_clean(
                     rescue_bits, rescue_off, &candidate_code,
                     &candidate_reason))) {
              bool already_reported = false;
              for (int r = 0; r < reported_count; r++) {
                if (reported_codes[r] == candidate_code) {
                  already_reported = true;
                  break;
                }
              }

              if (!already_reported) {
                if (reported_count < (int)ARRAY_SIZE(reported_codes)) {
                  reported_codes[reported_count++] = candidate_code;
                }
#if RFID_DECODE_DIAG_LOG
                LOG_WRN(
                    "[HEADER-RESCUE hb=%d off=%d tick=%d sub=%u bad=%d "
                    "unit_us=%u tol=%u]",
                    hb_start, rescue_off, rescue_half_tick[rescue_off],
                    tick_sub_start, rescue_bad, unit_us, tol_pct);
#endif
                if (confirm_em4100_candidate(candidate_code,
                                             candidate_reason)) {
                  *out_code = candidate_code;
                  *out_bits = 64;
                  *out_inverted = inv != 0;
                  return (hb_start / 2) + rescue_off;
                }
              }
            }
          }

          if (inv) invert_bits(rescue_bits, rescue_len);
        }
      }

      for (int frame_resync = 0; frame_resync <= 1; frame_resync++) {
        uint8_t frame_bits[64];
        uint8_t frame_pair_bad[64];

        for (int hb_start = 0; hb_start + 127 < half_len; hb_start++) {
          int frame_bad = 0;

          if (!edgecap_decode_frame_from_halfbits(half_len, hb_start,
                                                  frame_resync, frame_bits,
                                                  frame_pair_bad, &frame_bad)) {
            continue;
          }
          if (frame_bad > 2) continue;

          for (int inv = 0; inv <= 1; inv++) {
            uint64_t candidate_code;
            const char* candidate_reason;
            uint8_t sentinel_bit = 1U;

            if (inv) invert_bits(frame_bits, 64);
            if (edgecap_decode_bit_pair(half_len, hb_start - 2,
                                        &sentinel_bit)) {
              if (inv) sentinel_bit ^= 1U;
            }
            if (sentinel_bit != 0U) {
              if (inv) invert_bits(frame_bits, 64);
              continue;
            }

            if ((em4100_candidate_from_parity(frame_bits, 0, &candidate_code,
                                              &candidate_reason) &&
                 strcmp(candidate_reason, "data2") != 0) ||
                em4100_candidate_from_relaxed_header_clean(
                    frame_bits, 0, &candidate_code, &candidate_reason)) {
              bool already_reported = false;
              for (int r = 0; r < reported_count; r++) {
                if (reported_codes[r] == candidate_code) {
                  already_reported = true;
                  break;
                }
              }

              if (!already_reported) {
                if (reported_count < (int)ARRAY_SIZE(reported_codes)) {
                  reported_codes[reported_count++] = candidate_code;
                }

#if RFID_DECODE_DIAG_LOG
                LOG_WRN(
                    "[FRAME-edgecap hb=%d resync=%d bad=%d unit_us=%u tol=%u]",
                    hb_start, frame_resync, frame_bad, unit_us, tol_pct);
#endif
                if (confirm_em4100_candidate(candidate_code,
                                             candidate_reason)) {
                  *out_code = candidate_code;
                  *out_bits = 64;
                  *out_inverted = inv != 0;
                  return hb_start / 2;
                }
              }
            }

            if (inv) invert_bits(frame_bits, 64);
          }
        }
      }

      for (int resync = 0; resync <= 1; resync++) {
        for (int phase = 0; phase <= 1; phase++) {
          int bit_len = 0;
          int pos = phase;

