Wang860503/nrf5340_discrete_rfid/src/main.c
          memset(dec_raw_bits, 0, EM_DECODED_BITS_CAP);
          memset(dec_pair_bad, 0, EM_DECODED_BITS_CAP);
          memset(dec_bit_half_pos, 0, sizeof(dec_bit_half_pos));

          while (pos + 1 < half_len && bit_len < EM_DECODED_BITS_CAP) {
            uint8_t first = edgecap_half_bits[pos];
            uint8_t second = edgecap_half_bits[pos + 1];
            bool bad_pair = false;
            int bit_idx = bit_len;

            if (first == 1U && second == 0U) {
              dec_raw_bits[bit_len++] = 1U;
            } else if (first == 0U && second == 1U) {
              dec_raw_bits[bit_len++] = 0U;
            } else {
              bad_pair = true;
              dec_pair_bad[bit_len] = 1U;
              dec_raw_bits[bit_len++] = second;
            }
            dec_bit_half_pos[bit_idx] = (uint16_t)pos;

            pos += (resync && bad_pair) ? 1 : 2;
          }

          if (bit_len < 64) continue;

          for (int inv = 0; inv <= 1; inv++) {
            if (inv) invert_bits(dec_raw_bits, bit_len);

            for (int off = 0; off <= bit_len - 64; off++) {
              uint64_t candidate_code;
              const char* candidate_reason;
              uint64_t vote_code;
              const char* vote_reason;
              int vote_frames = 0;
              int vote_weak_bits = 0;
              int vote_start_frame = 0;
              int header_err;
              int row_err;
              int col_err;
              int stop_err;
              int frame_bad = count_bad_pairs_in_frame(off);
              int frame_score =
                  em4100_frame_error_score(dec_raw_bits, off, &header_err,
                                           &row_err, &col_err, &stop_err);
              int unit_penalty = (int)((unit_us > EM_CLOCK_BASE_1T_US)
                                           ? (unit_us - EM_CLOCK_BASE_1T_US)
                                           : (EM_CLOCK_BASE_1T_US - unit_us)) /
                                 8;
              int score = frame_score + frame_bad + unit_penalty;
              uint64_t code = decode_card_code((uint8_t*)&dec_raw_bits[off]);

              if (stop_err == 0) {
                consider_scan_vote_candidate(scan_vote_candidates,
                                             &dec_raw_bits[off], "edge-group",
                                             score, frame_bad, off, inv, code);
              }

              if (score < best_score) {
                best_score = score;
                best_unit_us = unit_us;
                best_tol_pct = tol_pct;
                best_resync = resync;
                best_phase = phase;
                best_bits = bit_len;
                best_bad = frame_bad;
                best_frame = off;
                best_inv = inv;
                best_header = header_err;
                best_row = row_err;
                best_col = col_err;
                best_stop = stop_err;
                best_code = code;
              }

              if (off < 64 &&
                  em4100_candidate_from_repeated_frames(
                      dec_raw_bits, bit_len, off, &vote_code, &vote_reason,
                      &vote_frames, &vote_weak_bits, &vote_start_frame)) {
                bool already_reported = false;
                for (int r = 0; r < reported_count; r++) {
                  if (reported_codes[r] == vote_code) {
                    already_reported = true;
                    break;
                  }
                }
                if (!already_reported) {
                  if (reported_count < (int)ARRAY_SIZE(reported_codes)) {
                    reported_codes[reported_count++] = vote_code;
                  }

                  LOG_WRN(
                      "[VOTE-edgecap frames=%d start=%d weak=%d off=%d "
                      "unit_us=%u]",
                      vote_frames, vote_start_frame, vote_weak_bits, off,
                      unit_us);
                  if (confirm_em4100_candidate(vote_code, vote_reason)) {
                    *out_code = vote_code;
                    *out_bits = bit_len;
                    *out_inverted = inv != 0;
                    return off;
                  }
                }
              }

              if (frame_bad <= EM_LEVEL_MAX_FRAME_BAD_PAIRS &&
                  em4100_candidate_from_synced_header(dec_raw_bits, bit_len,
                                                      off, &candidate_code,
                                                      &candidate_reason)) {
                bool already_reported = false;
                for (int r = 0; r < reported_count; r++) {
                  if (reported_codes[r] == candidate_code) {
                    already_reported = true;
                    break;
                  }
                }
                if (already_reported) continue;

                if (reported_count < (int)ARRAY_SIZE(reported_codes)) {
                  reported_codes[reported_count++] = candidate_code;
                }

                if (confirm_em4100_candidate(candidate_code,
                                             candidate_reason)) {
                  *out_code = candidate_code;
                  *out_bits = bit_len;
                  *out_inverted = inv != 0;
                  return off;
                }
              }
            }

            if (inv) invert_bits(dec_raw_bits, bit_len);
          }
        }
      }
    }
  }

#if RFID_DECODE_DIAG_LOG
  LOG_INF(
      "edgecap_best: score=%d unit_us=%u tol=%u resync=%d phase=%d bits=%d "
      "bad=%d",
      best_score, best_unit_us, best_tol_pct, best_resync, best_phase,
      best_bits, best_bad);
  LOG_INF("edgecap_best: frame=%d inv=%d header=%d row=%d col=%d stop=%d",
          best_frame, best_inv, best_header, best_row, best_col, best_stop);
  LOG_INF("edgecap_best: raw40=%010llX low16=%u", (unsigned long long)best_code,
          (uint16_t)(best_code & 0xFFFFULL));
  if (rescue_best_hb >= 0) {
    LOG_WRN(
        "RESCUE-best: score=%d hb=%d off=%d inv=%d bad=%d header=%d row=%d "
        "col=%d stop=%d",
        rescue_best_score, rescue_best_hb, rescue_best_off, rescue_best_inv,
        rescue_best_bad, rescue_best_header, rescue_best_row, rescue_best_col,
        rescue_best_stop);
    LOG_WRN("RESCUE-best: raw40=%010llX low16=%u",
            (unsigned long long)rescue_best_code,
            (uint16_t)(rescue_best_code & 0xFFFFULL));
  }
#endif
  for (int i = 0; i < EM_SCAN_VOTE_CANDIDATES; i++) {
    uint64_t voted_code;
    if (!scan_vote_candidates[i].used) continue;
    if (feed_row_vote_frame(scan_vote_candidates[i].bits,
                            scan_vote_candidates[i].source,
                            scan_vote_candidates[i].score,
                            scan_vote_candidates[i].bad, &voted_code)) {
      *out_code = voted_code;
      *out_bits = 64;
      *out_inverted = scan_vote_candidates[i].inv != 0;
      return scan_vote_candidates[i].origin >= 0
                 ? scan_vote_candidates[i].origin
                 : 0;
    }
  }

  return -1;
}

