Wang860503/nrf5340_discrete_rfid/src/main.c
static int try_em4100_tick_halfcell_decode(int tick_count, uint64_t* out_code,
                                           int* out_bits, int* out_half_us,
                                           int* out_offset, bool* out_inverted,
                                           int* out_bad_pairs) {
  int best_score = 1000;
  int best_half_us = 0;
  int best_offset = 0;
  int best_bits = 0;
  int best_bad = 0;
  int best_frame = -1;
  int best_inv = 0;
  int best_header = 0;
  int best_row = 0;
  int best_col = 0;
  int best_stop = 0;
  uint64_t best_code = 0;

  for (int half_us = EM_TICK_HALFCELL_MIN_US;
       half_us <= EM_TICK_HALFCELL_MAX_US;
       half_us += EM_TICK_HALFCELL_STEP_US) {
    for (uint8_t initial_level = 0; initial_level <= 1; initial_level++) {
      int half_len = 0;
      uint8_t level = initial_level;

      memset(env_level_samples, 0, EM_ENV_LEVEL_CAP);
      for (int i = 0; i < tick_count && half_len < EM_ENV_LEVEL_CAP; i++) {
        uint32_t repeat =
            (tick_buffer[i] + (uint32_t)(half_us / 2)) / (uint32_t)half_us;

        if (repeat < 1U) repeat = 1U;
        if (repeat > EM_TICK_HALFCELL_MAX_REPEAT) {
          repeat = EM_TICK_HALFCELL_MAX_REPEAT;
        }
        for (uint32_t n = 0; n < repeat && half_len < EM_ENV_LEVEL_CAP; n++) {
          env_level_samples[half_len++] = level;
        }
        level = !level;
      }

      for (int offset = 0; offset <= 1; offset++) {
        int bit_len = 0;

        memset(dec_raw_bits, 0, EM_DECODED_BITS_CAP);
        memset(dec_pair_bad, 0, EM_DECODED_BITS_CAP);
        for (int pos = offset;
             pos + 1 < half_len && bit_len < EM_DECODED_BITS_CAP; pos += 2) {
          uint8_t first = env_level_samples[pos];
          uint8_t second = env_level_samples[pos + 1];

          if (first == second) dec_pair_bad[bit_len] = 1;
          dec_raw_bits[bit_len++] = second;
        }
        if (bit_len < 64) continue;

        for (int inv = 0; inv <= 1; inv++) {
          if (inv) invert_bits(dec_raw_bits, bit_len);
          for (int off = 0; off <= bit_len - 64; off++) {
            uint64_t candidate_code;
            const char* candidate_reason;
            int header_err;
            int row_err;
            int col_err;
            int stop_err;
            int frame_bad = count_bad_pairs_in_frame(off);
            int score = em4100_frame_error_score(dec_raw_bits, off, &header_err,
                                                 &row_err, &col_err, &stop_err);
            uint64_t code = decode_card_code((uint8_t*)&dec_raw_bits[off]);

            if (score < best_score) {
              best_score = score;
              best_half_us = half_us;
              best_offset = offset;
              best_bits = bit_len;
              best_bad = frame_bad;
              best_frame = off;
              best_inv = inv;
              best_header = header_err;
              best_row = row_err;
              best_col = col_err;
              best_stop = stop_err;
              best_code = code;
            }

            if (frame_bad <= EM_TICK_HALF_MAX_FRAME_BAD_PAIRS) {
              bool parity_ok = em4100_candidate_from_parity(
                  dec_raw_bits, off, &candidate_code, &candidate_reason);
              bool relaxed_ok = em4100_candidate_from_relaxed_header_clean(
                  dec_raw_bits, off, &candidate_code, &candidate_reason);

              if (parity_ok || relaxed_ok) {
                if (confirm_em4100_candidate(candidate_code,
                                             candidate_reason)) {
                  *out_code = candidate_code;
                  *out_bits = bit_len;
                  *out_half_us = half_us;
                  *out_offset = offset;
                  *out_inverted = inv != 0;
                  *out_bad_pairs = frame_bad;
                  return off;
                }
              }
            }
          }
          if (inv) invert_bits(dec_raw_bits, bit_len);
        }
      }
    }
  }

#if RFID_DECODE_DIAG_LOG
  LOG_INF("tick_half_best: score=%d half_us=%d off=%d frame=%d inv=%d",
          best_score, best_half_us, best_offset, best_frame, best_inv);
  LOG_INF("tick_half_best: bits=%d bad=%d header=%d row=%d col=%d stop=%d",
          best_bits, best_bad, best_header, best_row, best_col, best_stop);
  LOG_INF("tick_half_best: raw40=%010llX low16=%u",
          (unsigned long long)best_code, (uint16_t)(best_code & 0xFFFFULL));
#endif
  return -1;
}

/* env128：依 short/long 分桶固定半位數（與 env_short/env_long 統計一致） */
static uint32_t env_tick_gap_to_half_repeat(uint32_t gap_us) {
  if (gap_us >= EM_LONG_MIN) {
    if (gap_us <= EM_LONG_MAX) {
      return EM_ENV_LONG_HALVES;
    }
    /* 超長 gap：按 512µs bit 週期延伸，每週期 4 半位 */
    uint32_t n = ((gap_us + EM_CLOCK_BASE_1T_US) / (EM_CLOCK_BASE_1T_US * 2U)) *
                 EM_ENV_LONG_HALVES;

    if (n < EM_ENV_LONG_HALVES) {
      n = EM_ENV_LONG_HALVES;
    }
    if (n > EM_TICK_HALFCELL_MAX_REPEAT) {
      n = EM_TICK_HALFCELL_MAX_REPEAT;
    }
    return n;
  }
  if (gap_us >= EM_SHORT_MIN) {
    return EM_ENV_SHORT_HALVES;
  }
  return 1U;
}

static int env_tick_expand_stored_levels(int tick_count) {
  int half_len = 0;

  memset(env_level_samples, 0, EM_ENV_LEVEL_CAP);
  for (int i = 0; i < tick_count && half_len < EM_ENV_LEVEL_CAP; i++) {
    uint32_t repeat = env_tick_gap_to_half_repeat(tick_buffer[i]);
    uint8_t half_val = tick_edge_to_level[i] ? 0U : 1U;

    for (uint32_t n = 0; n < repeat && half_len < EM_ENV_LEVEL_CAP; n++) {
      env_level_samples[half_len++] = half_val;
    }
  }
  return half_len;
}

/* env128 tick：包絡電平 + 固定門檻間距展開半位（不掃 half_us） */
static int try_em4100_tick_stored_level_decode(
    int tick_count, uint64_t* out_code, int* out_bits, int* out_half_us,
    int* out_offset, bool* out_inverted, int* out_bad_pairs) {
  int best_score = 1000;
#if EM_ALIGN_TARGET_LOW16 != 0U
  int best_rank = 1000000;
#endif
  const int fixed_half_us = (int)EM_ENV_WINDOW_US;
  int best_half_us = fixed_half_us;
  int best_offset = 0;
  int best_bits = 0;
  int best_bad = 0;
  int best_frame = -1;
  int best_inv = 0;
  int best_header = 0;
  int best_row = 0;
  int best_col = 0;
  int best_stop = 0;
  uint64_t best_code = 0;
  uint8_t best_frame_bits[64];
  bool have_best_frame = false;

#if RFID_COMP_DIRECT_EDGE_DECODE
  {
    const int half_len = env_tick_expand_stored_levels(tick_count);

    if (half_len >= 64) {
      for (int offset = 0; offset <= 1; offset++) {
        for (int inv_pass = 0; inv_pass <= 1; inv_pass++) {
          const int inv = comp_phase_valid
                              ? (inv_pass == 0 ? comp_last_best_inv
                                               : (comp_last_best_inv ^ 1))
                              : inv_pass;
          int bit_len = 0;

