Wang860503/nrf5340_discrete_rfid/src/main.c
          memset(dec_raw_bits, 0, EM_DECODED_BITS_CAP);
          memset(dec_pair_bad, 0, EM_DECODED_BITS_CAP);
          for (int pos = offset;
               pos + 1 < half_len && bit_len < EM_DECODED_BITS_CAP; pos += 2) {
            uint8_t first = env_level_samples[pos];
            uint8_t second = env_level_samples[pos + 1];

            if (inv) {
              first ^= 1U;
              second ^= 1U;
            }
            if (first == 1U && second == 0U) {
              dec_raw_bits[bit_len++] = 1U;
            } else if (first == 0U && second == 1U) {
              dec_raw_bits[bit_len++] = 0U;
            } else {
              dec_pair_bad[bit_len] = 1U;
              dec_raw_bits[bit_len++] = second;
            }
          }
          if (bit_len < 64) {
            continue;
          }

          for (int off = 0; off <= bit_len - 64; off++) {
            uint64_t candidate_code;
            const char* candidate_reason;
            int header_err;
            int row_err;
            int col_err;
            int stop_err;
            int frame_bad = count_bad_pairs_in_frame(off);
            int score = em4100_frame_error_score(dec_raw_bits, off, &header_err,
                                                 &row_err, &col_err, &stop_err);
            uint64_t code = decode_card_code((uint8_t*)&dec_raw_bits[off]);
#if EM_ALIGN_TARGET_LOW16 != 0U
            int rank = em4100_decode_rank(score, code);
#endif

#if EM_ALIGN_TARGET_LOW16 != 0U
            if (rank < best_rank) {
              best_rank = rank;
#else
            if (score < best_score) {
#endif
              best_score = score;
              best_half_us = fixed_half_us;
              best_offset = offset;
              best_bits = bit_len;
              best_bad = frame_bad;
              best_frame = off;
              best_inv = inv;
              best_header = header_err;
              best_row = row_err;
              best_col = col_err;
              best_stop = stop_err;
              best_code = code;
              memcpy(best_frame_bits, &dec_raw_bits[off],
                     sizeof(best_frame_bits));
              have_best_frame = true;
            }

            if (frame_bad <= EM_TICK_HALF_MAX_FRAME_BAD_PAIRS) {
              bool parity_ok =
                  em4100_candidate_from_parity(
                      dec_raw_bits, off, &candidate_code, &candidate_reason) &&
                  strcmp(candidate_reason, "data2") != 0;
              bool relaxed_ok = em4100_candidate_from_relaxed_header_clean(
                  dec_raw_bits, off, &candidate_code, &candidate_reason);

              if (parity_ok || relaxed_ok) {
                if (confirm_em4100_candidate(candidate_code,
                                             candidate_reason)) {
#if RFID_COMP_DIRECT_EDGE_DECODE
                  comp_last_best_inv = inv;
                  comp_phase_valid = true;
#endif
                  *out_code = candidate_code;
                  *out_bits = bit_len;
                  *out_half_us = fixed_half_us;
                  *out_offset = offset;
                  *out_inverted = inv != 0;
                  *out_bad_pairs = frame_bad;
                  return off;
                }
              }
            }
          }
        }
      }
    }
  }
#endif

#if EM_COMP_LOG_LEVEL_SNAPSHOT
  if (have_best_frame) {
    int snap_len = 0;
    const int snap_n = 20;

    for (int i = 0; i < tick_count && snap_len < EM_ENV_LEVEL_CAP; i++) {
      uint32_t repeat = env_tick_gap_to_half_repeat(tick_buffer[i]);
      uint8_t half_val = tick_edge_to_level[i] ? 0U : 1U;

      for (uint32_t n = 0; n < repeat && snap_len < EM_ENV_LEVEL_CAP; n++) {
        env_level_samples[snap_len++] = half_val;
      }
    }
    if (snap_len > snap_n) {
      snap_len = snap_n;
    }
    LOG_WRN(
        "lvl_snap inv=%d half_us=%d: %u,%u,%u,%u,%u,%u,%u,%u,%u,%u,"
        "%u,%u,%u,%u,%u,%u,%u,%u,%u,%u",
        best_inv, best_half_us, snap_len > 0 ? env_level_samples[0] : 0U,
        snap_len > 1 ? env_level_samples[1] : 0U,
        snap_len > 2 ? env_level_samples[2] : 0U,
        snap_len > 3 ? env_level_samples[3] : 0U,
        snap_len > 4 ? env_level_samples[4] : 0U,
        snap_len > 5 ? env_level_samples[5] : 0U,
        snap_len > 6 ? env_level_samples[6] : 0U,
        snap_len > 7 ? env_level_samples[7] : 0U,
        snap_len > 8 ? env_level_samples[8] : 0U,
        snap_len > 9 ? env_level_samples[9] : 0U,
        snap_len > 10 ? env_level_samples[10] : 0U,
        snap_len > 11 ? env_level_samples[11] : 0U,
        snap_len > 12 ? env_level_samples[12] : 0U,
        snap_len > 13 ? env_level_samples[13] : 0U,
        snap_len > 14 ? env_level_samples[14] : 0U,
        snap_len > 15 ? env_level_samples[15] : 0U,
        snap_len > 16 ? env_level_samples[16] : 0U,
        snap_len > 17 ? env_level_samples[17] : 0U,
        snap_len > 18 ? env_level_samples[18] : 0U,
        snap_len > 19 ? env_level_samples[19] : 0U);
  }
#endif

#if RFID_DECODE_DIAG_LOG
  LOG_INF("tick_lvl_best: score=%d sh=%u lg=%u off=%d frame=%d inv=%d bad=%d",
          best_score, (unsigned)EM_ENV_SHORT_HALVES,
          (unsigned)EM_ENV_LONG_HALVES, best_offset, best_frame, best_inv,
          best_bad);
  LOG_INF("tick_lvl_best: raw40=%010llX low16=%u",
          (unsigned long long)best_code, (uint16_t)(best_code & 0xFFFFULL));
#endif

#if RFID_COMP_DIRECT_EDGE_DECODE
  if (have_best_frame &&
#if EM_ALIGN_TARGET_LOW16 != 0U
      (best_score <= 4 || em4100_frame_near_target_low16(best_code))) {
#else
      (best_score <= 4)) {
#endif
    comp_last_best_inv = best_inv;
    comp_phase_valid = true;
#if RFID_DECODE_DIAG_LOG
    LOG_INF("comp_phase_lock: sh=%u lg=%u inv=%d score=%d",
            (unsigned)EM_ENV_SHORT_HALVES, (unsigned)EM_ENV_LONG_HALVES,
            best_inv, best_score);
#endif
  } else if (best_score > 18) {
    comp_phase_valid = false;
  }
#endif

#if EM_ALIGN_TARGET_LOW16 != 0U
  {
    uint16_t low16 = (uint16_t)(best_code & 0xFFFFULL);
    unsigned ham =
        (unsigned)__builtin_popcount((unsigned)(low16 ^ EM_ALIGN_TARGET_LOW16));
    int delta = em4100_low16_delta(low16);

    if (ham <= EM_NEAR_TARGET_MAX_HAM || delta <= EM_NEAR_TARGET_MAX_DELTA) {
      LOG_WRN(
          "tick_lvl_near_tgt: ham=%u delta=%d low16=%04X tgt=%04X score=%d "
          "hdr=%d row=%d col=%d stop=%d bad=%d",
          ham, delta, low16, EM_ALIGN_TARGET_LOW16, best_score, best_header,
          best_row, best_col, best_stop, best_bad);
    }
  }
#endif

