Wang860503/nrf5340_discrete_rfid/src/main.c
#if EM_ALIGN_TARGET_LOW16 != 0U
  if (have_best_frame &&
      (em4100_frame_near_target_low16(best_code) || best_score <= 4)) {
    uint64_t repaired;

    if (em4100_recover_align_target(best_frame_bits, &repaired)) {
#if RFID_DECODE_DIAG_LOG
      LOG_WRN("[TickLvl-recover] raw40=%010llX low16=%04X",
              (unsigned long long)repaired, (uint16_t)(repaired & 0xFFFFULL));
#endif
#if RFID_COMP_DIRECT_EDGE_DECODE
      comp_last_best_inv = best_inv;
      comp_phase_valid = true;
#endif
      *out_code = repaired;
      *out_bits = best_bits;
      *out_half_us = fixed_half_us;
      *out_offset = best_offset;
      *out_inverted = best_inv != 0;
      *out_bad_pairs = best_bad;
      return best_frame;
    }
  }
#endif

  if (have_best_frame && best_score <= 12) {
    uint64_t candidate_code;
    const char* candidate_reason;

    if ((em4100_candidate_from_parity(best_frame_bits, 0, &candidate_code,
                                      &candidate_reason) &&
         strcmp(candidate_reason, "data2") != 0) ||
        em4100_candidate_from_relaxed_header_clean(
            best_frame_bits, 0, &candidate_code, &candidate_reason)) {
#if RFID_DECODE_DIAG_LOG
      LOG_WRN("[TickLvl-retry] raw40=%010llX low16=%u reason=%s",
              (unsigned long long)candidate_code,
              (uint16_t)(candidate_code & 0xFFFFULL), candidate_reason);
#endif
      if (confirm_em4100_candidate(candidate_code, candidate_reason)) {
        *out_code = candidate_code;
        *out_bits = best_bits;
        *out_half_us = best_half_us;
        *out_offset = best_offset;
        *out_inverted = best_inv != 0;
        *out_bad_pairs = best_bad;
        return best_frame;
      }
    }
  }

  return -1;
}

static int try_comp_env_tick_decode(int tick_count, uint64_t* out_code,
                                    int* out_bits, bool* out_inverted) {
  int slide;
  int bad_pairs = 0;
  int half_us = 0;
  int offset = 0;

  /* env128 固定分桶解碼先跑（快）；EdgeCap 全掃 unit 很慢 */
  slide = try_em4100_tick_stored_level_decode(tick_count, out_code, out_bits,
                                              &half_us, &offset, out_inverted,
                                              &bad_pairs);
  if (slide >= 0) {
    return slide;
  }

  slide =
      try_em4100_tick_halfcell_decode(tick_count, out_code, out_bits, &half_us,
                                      &offset, out_inverted, &bad_pairs);
  if (slide >= 0) {
    return slide;
  }

  slide = try_em4100_edge_capture_decode(tick_count, out_code, out_bits,
                                         out_inverted);
  if (slide >= 0) {
    return slide;
  }

  return -1;
}
#endif

static void tick_buffer_append(uint32_t diff_us, uint8_t edge_to_level,
                               int* demod_counter, bool* tick_window_slid) {
  if (*demod_counter >= TICK_BUFFER_SIZE) {
    const size_t half = TICK_BUFFER_SIZE / 2;
    memmove(tick_buffer, tick_buffer + half, half * sizeof(tick_buffer[0]));
    memmove(tick_edge_to_level, tick_edge_to_level + half,
            half * sizeof(tick_edge_to_level[0]));
    *demod_counter = (int)half;
    *tick_window_slid = true;
  }
  tick_buffer[*demod_counter] = diff_us;
  tick_edge_to_level[*demod_counter] = edge_to_level;
  (*demod_counter)++;
}

#if RFID_USE_SAADC_RECEIVER
static void rfid_saadc_capture_reset(void) {
  rfid_saadc_capture_done = false;
  rfid_saadc_raw_samples = 0;
  rfid_saadc_sample_errors = 0;
  rfid_saadc_clip_samples = 0;
  rfid_saadc_clip_pos_samples = 0;
  rfid_saadc_clip_neg_samples = 0;
  rfid_saadc_next_buffer = 0;
  rfid_saadc_window_samples = 0;
  rfid_saadc_window_abs_sum = 0;
  rfid_saadc_window_min = INT16_MAX;
  rfid_saadc_window_max = INT16_MIN;
  rfid_saadc_window_signed_sum = 0;
  rfid_saadc_raw_abs_sum = 0;
  rfid_saadc_raw_sum = 0;
  rfid_saadc_raw_min = INT16_MAX;
  rfid_saadc_raw_max = INT16_MIN;
  rfid_saadc_env_level_count = 0;
#if RFID_SAADC_DC_BIAS_ENABLE
  saadc_dc_bias_accumulator = 0;
  saadc_dc_bias_sample_count = 0;
  saadc_dc_offset = 0;
#endif
#if ACTIVE_DECODE_MODE == DECODE_MODE_FSK
  fsk_window_crosses = 0;
  last_fsk_sample = 0;
  memset(fsk_cross_history, 0, sizeof(fsk_cross_history));
#endif
}

static void rfid_saadc_process_sample(int16_t sample) {
#if RFID_SAADC_DC_BIAS_ENABLE
  if (saadc_dc_bias_sample_count < RFID_SAADC_DC_BIAS_LEARN_SAMPLES) {
    saadc_dc_bias_accumulator += (int32_t)sample;
    saadc_dc_bias_sample_count++;
    saadc_dc_offset = (int16_t)(saadc_dc_bias_accumulator /
                                (int32_t)saadc_dc_bias_sample_count);
  }
  {
    int32_t corrected = (int32_t)sample - (int32_t)saadc_dc_offset;

    if (corrected > INT16_MAX) {
      corrected = INT16_MAX;
    } else if (corrected < INT16_MIN) {
      corrected = INT16_MIN;
    }
    sample = (int16_t)corrected;
  }
#endif
#if RFID_SAADC_SAMPLE_RSHIFT > 0
  sample = (int16_t)(sample >> RFID_SAADC_SAMPLE_RSHIFT);
#endif
  uint32_t abs_sample = (sample < 0) ? (uint32_t)(-sample) : (uint32_t)sample;

#if ACTIVE_DECODE_MODE == DECODE_MODE_FSK
  if ((sample >= 0 && last_fsk_sample < 0) ||
      (sample < 0 && last_fsk_sample >= 0)) {
    fsk_window_crosses++;
  }
  last_fsk_sample = sample;
#endif

  rfid_saadc_raw_samples++;
  rfid_saadc_raw_sum += sample;
  rfid_saadc_raw_abs_sum += abs_sample;
  if (sample <= -(int16_t)RFID_SAADC_CLIP_LEVEL_ACTIVE ||
      sample >= (int16_t)RFID_SAADC_CLIP_LEVEL_ACTIVE) {
    rfid_saadc_clip_samples++;
    if (sample >= (int16_t)RFID_SAADC_CLIP_LEVEL_ACTIVE) {
      rfid_saadc_clip_pos_samples++;
    }
    if (sample <= -(int16_t)RFID_SAADC_CLIP_LEVEL_ACTIVE) {
      rfid_saadc_clip_neg_samples++;
    }
  }
  if (sample < rfid_saadc_raw_min) rfid_saadc_raw_min = sample;
  if (sample > rfid_saadc_raw_max) rfid_saadc_raw_max = sample;

  if (rfid_saadc_window_samples == 0U) {
    rfid_saadc_window_min = sample;
    rfid_saadc_window_max = sample;
  } else {
    if (sample < rfid_saadc_window_min) {
      rfid_saadc_window_min = sample;
    }
    if (sample > rfid_saadc_window_max) {
      rfid_saadc_window_max = sample;
    }
  }

  rfid_saadc_window_signed_sum += sample;
  rfid_saadc_window_abs_sum += abs_sample;
  rfid_saadc_window_samples++;
  if (rfid_saadc_window_samples >= RFID_SAADC_SAMPLES_PER_WINDOW) {
    int count = rfid_saadc_env_level_count;

