Wang860503/nrf5340_discrete_rfid/src/main.c
    if (count < EM_ENV_LEVEL_CAP) {
#if ACTIVE_DECODE_MODE == DECODE_MODE_FSK
      fsk_cross_history[count] =
          (uint8_t)((fsk_window_crosses > 255) ? 255 : fsk_window_crosses);
      fsk_window_crosses = 0;
#endif
      int16_t pp = (int16_t)(rfid_saadc_window_max - rfid_saadc_window_min);
      int32_t signed_avg =
          rfid_saadc_window_signed_sum / (int32_t)rfid_saadc_window_samples;

      if (pp < 0) {
        pp = 0;
      }
      if (signed_avg > INT16_MAX) {
        signed_avg = INT16_MAX;
      } else if (signed_avg < INT16_MIN) {
        signed_avg = INT16_MIN;
      }
      adc_window_avg_samples[count] =
          (int16_t)(rfid_saadc_window_abs_sum / rfid_saadc_window_samples);
      adc_window_pp_samples[count] = pp;
      adc_window_signed_samples[count] = (int16_t)signed_avg;
      rfid_saadc_env_level_count = count + 1;
    }

    rfid_saadc_window_abs_sum = 0;
    rfid_saadc_window_signed_sum = 0;
    rfid_saadc_window_samples = 0;
    rfid_saadc_window_min = INT16_MAX;
    rfid_saadc_window_max = INT16_MIN;

    if (rfid_saadc_env_level_count >= (int)rfid_saadc_target_windows) {
      rfid_saadc_capture_done = true;
    }
  }
}

static void rfid_saadc_event_handler(nrfx_saadc_evt_t const* p_event) {
  switch (p_event->type) {
    case NRFX_SAADC_EVT_BUF_REQ:
      if (!rfid_saadc_capture_done) {
        uint32_t idx = rfid_saadc_next_buffer++ % RFID_SAADC_BUFFER_COUNT;
        nrfx_err_t err =
            nrfx_saadc_buffer_set((nrf_saadc_value_t*)rfid_saadc_buffers[idx],
                                  RFID_SAADC_BUFFER_SIZE);
        if (err != NRFX_SUCCESS) {
          rfid_saadc_sample_errors++;
        }
      }
      break;

    case NRFX_SAADC_EVT_DONE:
      for (uint16_t i = 0; i < p_event->data.done.size; i++) {
        if (rfid_saadc_capture_done) break;
        int16_t sample = NRFX_SAADC_SAMPLE_GET(p_event->data.done.p_buffer, i);
        rfid_saadc_process_sample(sample);
      }
      break;

    default:
      break;
  }
}

static int16_t rfid_saadc_env_value_at(int idx) {
  const int16_t abs_v = adc_window_avg_samples[idx];
  const int16_t pp_v = adc_window_pp_samples[idx];
  const int16_t sgn_v = adc_window_signed_samples[idx];
  const int16_t sgn_abs = (int16_t)((sgn_v < 0) ? -sgn_v : sgn_v);

  switch (rfid_saadc_active_env_mode) {
    case RFID_SAADC_ENV_MODE_PP:
      return pp_v;
    case RFID_SAADC_ENV_MODE_SIGNED:
      return sgn_abs;
    case RFID_SAADC_ENV_MODE_BLEND:
      return (int16_t)((abs_v + pp_v) / 2);
    case RFID_SAADC_ENV_MODE_PP_CAP_BLEND: {
      int16_t ppc = pp_v;

      if (ppc > (int16_t)RFID_SAADC_ENV_PP_CAP_ACTIVE) {
        ppc = (int16_t)RFID_SAADC_ENV_PP_CAP_ACTIVE;
      }
      return (int16_t)((abs_v + ppc) / 2);
    }
    default:
      return abs_v;
  }
}

static int32_t rfid_adc_smoothed_env(int idx, int len) {
  int32_t left = rfid_saadc_env_value_at(idx > 0 ? idx - 1 : idx);
  int32_t mid = rfid_saadc_env_value_at(idx);
  int32_t right = rfid_saadc_env_value_at((idx + 1 < len) ? idx + 1 : idx);

  return (left + (mid * 2) + right) / 4;
}

#if RFID_SAADC_EXPORT_RAW_WINDOWS
static const struct device* rfid_raw_uart_dev;

static void rfid_raw_uart_putc(char c) {
  uart_poll_out(rfid_raw_uart_dev, (unsigned char)c);
}

static void rfid_raw_uart_puts(const char* s) {
  while (s != NULL && *s != '\0') {
    rfid_raw_uart_putc(*s++);
  }
}

static void rfid_saadc_dump_window_csv(int env_level_count) {
  static int dumps_left = (int)RFID_SAADC_RAW_DUMP_MAX;
  char line[80];

  if (dumps_left <= 0) {
    return;
  }
  dumps_left--;

  if (rfid_raw_uart_dev == NULL) {
    if (!device_is_ready(DEVICE_DT_GET(DT_CHOSEN(zephyr_console)))) {
      LOG_ERR("raw_dump: console UART not ready");
      return;
    }
    rfid_raw_uart_dev = DEVICE_DT_GET(DT_CHOSEN(zephyr_console));
  }

  LOG_WRN("raw_dump_uart: exporting %d windows (bypass log buffer)",
          env_level_count);

  rfid_raw_uart_puts("\n====== [RAW-ADC-DATA-START] ======\n");
  snprintf(
      line, sizeof(line),
      "meta,window_us=%u,samples_per_window=%lu,sample_hz=%lu,env_count=%d\n",
      RFID_SAADC_ENV_WINDOW_US, (unsigned long)RFID_SAADC_SAMPLES_PER_WINDOW,
      (unsigned long)RFID_SAADC_SAMPLE_HZ, env_level_count);
  rfid_raw_uart_puts(line);
  rfid_raw_uart_puts("Index,Signed_Diff_Raw,Abs_Avg_Raw\n");

  for (int d_idx = 0; d_idx < env_level_count; d_idx++) {
    snprintf(line, sizeof(line), "%d,%d,%d\n", d_idx,
             (int)adc_window_signed_samples[d_idx],
             (int)adc_window_avg_samples[d_idx]);
    rfid_raw_uart_puts(line);
    if ((d_idx & 0x0F) == 0x0F) {
      k_sleep(K_MSEC(2));
    }
  }

  snprintf(line, sizeof(line),
           "====== [RAW-ADC-DATA-END] env_count=%d ======\n\n",
           env_level_count);
  rfid_raw_uart_puts(line);
  LOG_WRN("raw_dump_uart: done");
}
#endif

static int rfid_saadc_decode_from_envelope(int env_level_count,
                                           const char* tag) {
#if ACTIVE_DECODE_MODE == DECODE_MODE_FSK
  if (env_level_count < 128) {
    return 0;
  }

  /* 4-window (256µs) 滑動總和 → 0/1 偽包絡，交給 ASK Manchester 解碼器 */
  for (int i = 0; i < env_level_count; i++) {
    int sum_cross = 0;
    int win_count = 0;

    for (int j = i; j < i + 4 && j < env_level_count; j++) {
      sum_cross += (int)fsk_cross_history[j];
      win_count++;
    }
    if (win_count <= 0) {
      env_level_samples[i] = 0U;
      env_edge_samples[i] = 0U;
      continue;
    }
    const int normalized_cross = (sum_cross * 4) / win_count;

    env_level_samples[i] = (normalized_cross >= FSK_CROSS_THRESHOLD) ? 1U : 0U;
    env_edge_samples[i] = env_level_samples[i] ? 255U : 0U;
  }

#if RFID_SAADC_DECODE_ENABLE
  if (em4095_try_level_decoders(env_level_count, "fsk", 0, 0)) {
    return 1;
  }
#endif
  ARG_UNUSED(tag);
  return 2;

#else
  uint32_t adc_hist[8] = {0};
  uint32_t transitions = 0;
  uint32_t high_windows = 0;
  int32_t env_sum = 0;
  int16_t env_min = INT16_MAX;
  int16_t env_max = INT16_MIN;

  if (env_level_count < 128) {
    return 0;
  }

  for (int i = 0; i < env_level_count; i++) {
    int32_t smooth = rfid_adc_smoothed_env(i, env_level_count);

