Wang860503/nrf5340_discrete_rfid/src/main.c
    env_sum += smooth;
    if (smooth < env_min) {
      env_min = (int16_t)smooth;
    }
    if (smooth > env_max) {
      env_max = (int16_t)smooth;
    }
  }

  if (env_min == INT16_MAX || env_max == INT16_MIN) {
    return 0;
  }

  const int32_t env_range = (int32_t)env_max - (int32_t)env_min;
  uint32_t env_pct_hist[64] = {0};
  int32_t p20 = env_min;
  int32_t p80 = env_max;

  if (env_range > 0) {
    for (int i = 0; i < env_level_count; i++) {
      int32_t avg = rfid_adc_smoothed_env(i, env_level_count);
      uint32_t bin = (uint32_t)(((avg - env_min) * 63) / env_range);

      if (bin > 63U) {
        bin = 63U;
      }
      env_pct_hist[bin]++;
    }

    uint32_t acc = 0;
    uint32_t target20 = (uint32_t)env_level_count / 5U;
    uint32_t target80 = ((uint32_t)env_level_count * 4U) / 5U;
    bool got20 = false;

    for (uint32_t bin = 0; bin < 64U; bin++) {
      acc += env_pct_hist[bin];
      if (!got20 && acc >= target20) {
        p20 = env_min + ((int32_t)bin * env_range) / 63;
        got20 = true;
      }
      if (acc >= target80) {
        p80 = env_min + ((int32_t)bin * env_range) / 63;
        break;
      }
    }
  }

  const int32_t pct_range = p80 - p20;
  const int32_t threshold =
      p20 + ((pct_range * (int32_t)RFID_SAADC_ENV_THRESHOLD_PCT) / 100);
  const int32_t hysteresis = pct_range > 64 ? (pct_range / 8) : 4;
  uint8_t last_level = 0;
  bool have_last_level = false;
  uint8_t level_state =
      (rfid_adc_smoothed_env(0, env_level_count) > threshold) ? 1U : 0U;

  for (int i = 0; i < env_level_count; i++) {
    int32_t avg = rfid_adc_smoothed_env(i, env_level_count);
    uint32_t norm = 0;

    if (avg > threshold + hysteresis) {
      level_state = 1U;
    } else if (avg + hysteresis < threshold) {
      level_state = 0U;
    }

    if (env_range > 0) {
      norm = (uint32_t)(((avg - env_min) * 255) / env_range);
      if (norm > 255U) {
        norm = 255U;
      }
    }

    env_edge_samples[i] = (uint8_t)norm;
    env_level_samples[i] = level_state;
    adc_hist[(norm >= 255U) ? 7U : (norm / 32U)]++;
    if (level_state) {
      high_windows++;
    }
    if (have_last_level && level_state != last_level) {
      transitions++;
    }
    last_level = level_state;
    have_last_level = true;
  }

#if RFID_SAADC_VERBOSE_ENV_LOG
  LOG_INF("saadc_env[%s]: avg=%d min=%d max=%d range=%d p20=%d p80=%d", tag,
          env_level_count ? (env_sum / env_level_count) : 0, env_min, env_max,
          env_range, p20, p80);
  LOG_INF("saadc_thr[%s]: threshold=%d hyst=%d pct_range=%d", tag, threshold,
          hysteresis, pct_range);
  LOG_INF("saadc_levels[%s]: high=%u/%d transitions=%u", tag, high_windows,
          env_level_count, transitions);
#endif

  if (env_range < RFID_SAADC_MIN_RANGE_COUNTS) {
#if RFID_SAADC_VERBOSE_ENV_LOG
    LOG_INF("saadc_range_skip[%s]: range=%d/%d", tag, env_range,
            RFID_SAADC_MIN_RANGE_COUNTS);
#endif
    return 0;
  }

#if RFID_SAADC_DECODE_ENABLE
  if (em4095_try_level_decoders(env_level_count, tag, env_min, env_max)) {
    return 1;
  }
#endif
  return 2;
#endif /* ACTIVE_DECODE_MODE != DECODE_MODE_FSK */
}

static int em4095_try_level_decoders(int env_level_count, const char* frac_tag,
                                     int32_t sample_min, int32_t sample_max) {
  uint64_t level_code;
  int level_bits = 0;
  int half_windows = 0;
  int level_offset = 0;
  int level_bad_pairs = 0;
  bool level_inverted = false;

  int level_slide = try_em4100_saadc_pair_decode(
      env_level_count, &level_code, &level_bits, &half_windows, &level_offset,
      &level_inverted, &level_bad_pairs, RFID_DECODE_DIAG_LOG);
  if (level_slide >= 0) {
#if !RFID_LOG_MINIMAL
    LOG_WRN(
        "[SUCCESS-SAADC-01-10 half_q8=%d phase_q8=%d inv=%d bad=%d "
        "slide=%d bits=%d]",
        half_windows, level_offset, level_inverted, level_bad_pairs,
        level_slide, level_bits);
    LOG_WRN("[SUCCESS-SAADC-01-10] ID: %010llX",
            (unsigned long long)level_code);
#endif
    return 1;
  }

#if RFID_SAADC_STRICT_MANCHESTER_ONLY
  bool strict_pair_blocked = false;
  rfid_saadc_candidate_consensus(frac_tag, rfid_saadc_pair_last_best_code,
                                 rfid_saadc_pair_last_best_score,
                                 rfid_saadc_pair_last_best_bad);
  if (rfid_saadc_pair_last_best_bad > (int)RFID_SAADC_STRICT_MAX_BAD_PAIRS) {
    strict_pair_blocked = true;
    if (!RFID_SAADC_LOG_IMPORTANT_ONLY) {
      LOG_INF(
          "%s_strict_pair_fail: levels=%d bad=%d max=%u half_q8=%u..%u "
          "sample=%d..%d",
          frac_tag, env_level_count, rfid_saadc_pair_last_best_bad,
          (unsigned)RFID_SAADC_STRICT_MAX_BAD_PAIRS,
          RFID_SAADC_MANCHESTER_HALF_MIN_Q8, RFID_SAADC_MANCHESTER_HALF_MAX_Q8,
          sample_min, sample_max);
    }
#if RFID_DECODE_DIAG_LOG
    LOG_WRN("%s_strict_pair_fail: continue delta diagnostics", frac_tag);
#endif
  }
  /* bad≤STRICT_MAX：放行 parity 容錯解碼路徑 */
#endif
  /*
    level_slide = try_em4100_clocked_resync_decode(
        env_level_count, &level_code, &level_bits, &half_windows, &level_offset,
        &level_inverted, &level_bad_pairs, true);
    if (level_slide >= 0) {
      LOG_WRN("[SUCCESS-Clocked half_q8=%d off_q8=%d inv=%d bad=%d slide=%d]",
              half_windows, level_offset, level_inverted, level_bad_pairs,
              level_slide);
      LOG_WRN("[SUCCESS-Clocked] ID: %08llX", (unsigned long long)level_code);
      return 1;
    }

    level_slide = try_em4100_fractional_level_decode(
        env_level_count, &level_code, &level_bits, &half_windows, &level_offset,
        &level_inverted, &level_bad_pairs, true, frac_tag);
    if (level_slide >= 0) {
      LOG_WRN("[SUCCESS-%s half_q8=%d off_q8=%d inv=%d bad=%d slide=%d]",
              frac_tag, half_windows, level_offset, level_inverted,
              level_bad_pairs, level_slide);
      LOG_WRN("[SUCCESS-%s] ID: %08llX", frac_tag,
              (unsigned long long)level_code);
      return 1;
    }

    level_slide = try_em4100_level_decode(
        env_level_count, &level_code, &level_bits, &half_windows, &level_offset,
        &level_inverted, &level_bad_pairs, true);
    if (level_slide >= 0) {
      LOG_WRN("[SUCCESS-Level h=%d off=%d inv=%d bad=%d slide=%d bits=%d]",
              half_windows, level_offset, level_inverted, level_bad_pairs,
              level_slide, level_bits);
      LOG_WRN("[SUCCESS-Level] ID: %08llX", (unsigned long long)level_code);
      return 1;
    }
  */
  /* 邊緣計時解碼：不依賴 bit rate，從 edge 間距自動推算 T/2 */
  saadc_edge_timing_decode_log(env_level_count);

  level_slide = try_em4100_edge_delta_decode(
      env_level_count, &level_code, &level_bits, &half_windows, &level_offset,
      &level_inverted, &level_bad_pairs, RFID_DECODE_DIAG_LOG);
  if (level_slide >= 0) {
#if !RFID_LOG_MINIMAL
    LOG_WRN("[SUCCESS-Delta half_q8=%d off_q8=%d inv=%d bad=%d slide=%d]",
            half_windows, level_offset, level_inverted, level_bad_pairs,
            level_slide);
    LOG_WRN("[SUCCESS-Delta] ID: %08llX", (unsigned long long)level_code);
#endif
    return 1;
  }
#if RFID_SAADC_STRICT_MANCHESTER_ONLY
  if (strict_pair_blocked) {
    return 0;
  }
#endif

  if (!RFID_SAADC_LOG_IMPORTANT_ONLY) {
    LOG_INF("%s_decode_fail: levels=%d half=%u..%u bad_max=%u sample=%d..%d",
            frac_tag, env_level_count, EM_ENV_HALF_MIN_WINDOWS,
            EM_ENV_HALF_MAX_WINDOWS, EM_LEVEL_MAX_FRAME_BAD_PAIRS, sample_min,
            sample_max);
  }
  return 0;
}

static int rfid_saadc_configure(void) {
  nrfx_err_t err;

  if (rfid_saadc_ready) return 0;

#if !RFID_USE_SAADC_RECEIVER && RFID_COMP_RX_GPIO_PINCNF_ENABLE
  rfid_rx_ain_gpio_configure();
#endif

#if defined(__ZEPHYR__)
  if (!rfid_saadc_irq_connected) {
    IRQ_CONNECT(NRFX_IRQ_NUMBER_GET(NRF_SAADC), IRQ_PRIO_LOWEST,
                nrfx_saadc_irq_handler, 0, 0);
    irq_enable(NRFX_IRQ_NUMBER_GET(NRF_SAADC));
    rfid_saadc_irq_connected = true;
  }
#endif

  if (!nrfx_saadc_init_check()) {
    err = nrfx_saadc_init(NRFX_SAADC_DEFAULT_CONFIG_IRQ_PRIORITY);
    if (err != NRFX_SUCCESS && err != NRFX_ERROR_ALREADY) {
      LOG_ERR("SAADC init failed: %d", err);
      return -EIO;
    }
  }

