Wang860503/nrf5340_discrete_rfid/src/main.c
  /* P0.04=AIN0=CMP_P, P0.05=AIN1=1.65V ref（nRF5340 AIN0=P0.04, AIN1=P0.05） */
  /*
  nrfx_saadc_channel_t channel = NRFX_SAADC_DEFAULT_CHANNEL_DIFFERENTIAL(
      NRF_SAADC_INPUT_AIN0, NRF_SAADC_INPUT_AIN1, RFID_SAADC_CHANNEL_INDEX);
      */
  nrfx_saadc_channel_t channel = NRFX_SAADC_DEFAULT_CHANNEL_SE(
      NRF_SAADC_INPUT_AIN0, RFID_SAADC_CHANNEL_INDEX);
  channel.channel_config.gain = NRF_SAADC_GAIN1_6;
  channel.channel_config.acq_time = NRF_SAADC_ACQTIME_3US;

  err = nrfx_saadc_channel_config(&channel);
  if (err != NRFX_SUCCESS) {
    LOG_ERR("SAADC channel config failed: %d", err);
    return -EIO;
  }

  nrfx_saadc_adv_config_t adv_config = NRFX_SAADC_DEFAULT_ADV_CONFIG;
  adv_config.internal_timer_cc = RFID_SAADC_TIMER_CC;
  adv_config.start_on_end = true;

  err = nrfx_saadc_advanced_mode_set(1UL << RFID_SAADC_CHANNEL_INDEX,
                                     NRF_SAADC_RESOLUTION_12BIT, &adv_config,
                                     rfid_saadc_event_handler);
  if (err != NRFX_SUCCESS) {
    LOG_ERR("SAADC advanced mode failed: %d", err);
    return -EIO;
  }

  err = nrfx_saadc_offset_calibrate(NULL);
  if (err != NRFX_SUCCESS) {
    LOG_WRN("SAADC offset calibration skipped/failed: %d", err);
  }

  rfid_saadc_ready = true;
  LOG_INF(
      "SAADC: differential AIN0(P0.04)-AIN1(P0.05), %luHz timer_cc=%lu "
      "env=%uus",
      (unsigned long)RFID_SAADC_SAMPLE_HZ, (unsigned long)RFID_SAADC_TIMER_CC,
      RFID_SAADC_ENV_WINDOW_US);
  LOG_INF("SAADC scale: rshift=%u clip=%u card_min=%u thr_pct=%u%%",
          RFID_SAADC_SAMPLE_RSHIFT, RFID_SAADC_CLIP_LEVEL_ACTIVE,
          RFID_SAADC_CARD_MIN_ABS_AVG_ACTIVE, RFID_SAADC_ENV_THRESHOLD_PCT);
  return 0;
}

int em4095_saadc_receiver(void) {
  int env_level_count;

  if (rfid_saadc_configure() != 0) return 0;

  k_sleep(K_MSEC(50));
  rfid_saadc_target_windows = RFID_SAADC_TARGET_WINDOWS;
  rfid_saadc_capture_reset();

  uint32_t capture_start_cycle = k_cycle_get_32();
  nrfx_err_t err = nrfx_saadc_buffer_set(
      (nrf_saadc_value_t*)rfid_saadc_buffers[0], RFID_SAADC_BUFFER_SIZE);
  if (err != NRFX_SUCCESS) {
    LOG_ERR("SAADC buffer0 set failed: %d", err);
    return 0;
  }

  err = nrfx_saadc_buffer_set((nrf_saadc_value_t*)rfid_saadc_buffers[1],
                              RFID_SAADC_BUFFER_SIZE);
  if (err != NRFX_SUCCESS) {
    LOG_ERR("SAADC buffer1 set failed: %d", err);
    return 0;
  }
  rfid_saadc_next_buffer = 0;

  err = nrfx_saadc_mode_trigger();
  if (err != NRFX_SUCCESS) {
    LOG_ERR("SAADC trigger failed: %d", err);
    return 0;
  }

  uint64_t timeout = k_uptime_get() + RFID_CAPTURE_WINDOW_MS + 100U;
  while (!rfid_saadc_capture_done && k_uptime_get() < timeout) {
    k_sleep(K_MSEC(2));
  }

  nrfx_saadc_abort();
  k_sleep(K_MSEC(2));
  env_level_count = rfid_saadc_env_level_count;

  uint32_t capture_us =
      k_cyc_to_us_near32(k_cycle_get_32() - capture_start_cycle);
  const int32_t raw_avg =
      rfid_saadc_raw_samples
          ? (rfid_saadc_raw_sum / (int32_t)rfid_saadc_raw_samples)
          : 0;
  const uint32_t raw_abs_avg =
      rfid_saadc_raw_samples ? (rfid_saadc_raw_abs_sum / rfid_saadc_raw_samples)
                             : 0;
  const uint32_t clip_pct =
      rfid_saadc_raw_samples
          ? (rfid_saadc_clip_samples * 100U) / rfid_saadc_raw_samples
          : 0U;
  const uint32_t clip_pos_pct =
      rfid_saadc_raw_samples
          ? (rfid_saadc_clip_pos_samples * 100U) / rfid_saadc_raw_samples
          : 0U;
  const uint32_t clip_neg_pct =
      rfid_saadc_raw_samples
          ? (rfid_saadc_clip_neg_samples * 100U) / rfid_saadc_raw_samples
          : 0U;
#if RFID_RX_CAPTURE_STATS_LOG
  LOG_INF("saadc: raw=%u windows=%d capture_us=%u errors=%u",
          rfid_saadc_raw_samples, env_level_count, capture_us,
          rfid_saadc_sample_errors);
  LOG_INF("saadc_raw: avg=%d abs_avg=%u min=%d max=%d clip=%u (%u%%)", raw_avg,
          raw_abs_avg, rfid_saadc_raw_samples ? rfid_saadc_raw_min : 0,
          rfid_saadc_raw_samples ? rfid_saadc_raw_max : 0,
          rfid_saadc_clip_samples, clip_pct);
  LOG_WRN("saadc_clip_dir: pos=%u (%u%%) neg=%u (%u%%)",
          rfid_saadc_clip_pos_samples, clip_pos_pct,
          rfid_saadc_clip_neg_samples, clip_neg_pct);
#endif

  const bool saadc_saturated =
      (rfid_saadc_raw_samples > 0U) &&
      ((rfid_saadc_clip_samples * 100U) >
       (rfid_saadc_raw_samples * RFID_SAADC_MAX_CLIP_PERCENT));

  if (saadc_saturated) {
    LOG_WRN("saadc_saturated: clip=%u/%u > %u%%; lower carrier drive",
            rfid_saadc_clip_samples, rfid_saadc_raw_samples,
            RFID_SAADC_MAX_CLIP_PERCENT);
  }

  if (raw_abs_avg < RFID_SAADC_CARD_MIN_ABS_AVG_ACTIVE) {
#if RFID_RX_CAPTURE_STATS_LOG
    LOG_INF("saadc_card_gate_skip: abs_avg=%u/%u", raw_abs_avg,
            RFID_SAADC_CARD_MIN_ABS_AVG_ACTIVE);
#endif
    return 0;
  }

  if (env_level_count < 128) {
#if RFID_RX_CAPTURE_STATS_LOG
    LOG_INF("saadc_skip: not enough windows=%d", env_level_count);
#endif
    return 0;
  }

#if RFID_SAADC_EXPORT_RAW_WINDOWS
  rfid_saadc_dump_window_csv(env_level_count);
#endif

#if RFID_SAADC_SAT_ENV_ENABLE
  if (saadc_saturated) {
    static const struct {
      rfid_saadc_env_mode_t mode;
      const char* tag;
    } sat_modes[] = {
        {RFID_SAADC_ENV_MODE_SIGNED, "adc_signed"},
        {RFID_SAADC_ENV_MODE_BLEND, "adc_blend"},
        {RFID_SAADC_ENV_MODE_PP_CAP_BLEND, "adc_ppcb"},
        {RFID_SAADC_ENV_MODE_PP, "adc_pp"},
        {RFID_SAADC_ENV_MODE_ABS, "adc_abs"},
    };
    int last_ret = 0;

    if (!RFID_SAADC_LOG_IMPORTANT_ONLY) {
      LOG_WRN("saadc_sat_env: trying %u envelope modes",
              (unsigned)ARRAY_SIZE(sat_modes));
    }
    for (size_t mi = 0; mi < ARRAY_SIZE(sat_modes); mi++) {
      int ret;

      rfid_saadc_active_env_mode = sat_modes[mi].mode;
      ret = rfid_saadc_decode_from_envelope(env_level_count, sat_modes[mi].tag);
      if (ret == 1) {
        if (!RFID_SAADC_LOG_IMPORTANT_ONLY) {
          LOG_WRN("saadc_sat_env: success mode=%s", sat_modes[mi].tag);
        }
        return 1;
      }
      if (ret > last_ret) {
        last_ret = ret;
      }
    }

#if !RFID_LOG_MINIMAL
    LOG_WRN("[CARD-PRESENT-SAADC] sat modes failed, best_ret=%d", last_ret);
#endif
    return last_ret > 0 ? last_ret : 2;
  }
#endif

  rfid_saadc_active_env_mode = RFID_SAADC_ENV_MODE_ABS;
  {
    int ret = rfid_saadc_decode_from_envelope(env_level_count, "adc_frac");

    if (ret == 1) {
      return 1;
    }
    if (ret == 2) {
#if !RFID_LOG_MINIMAL
      LOG_WRN("[CARD-PRESENT-SAADC] no valid EM4100 frame yet");
#endif
      return 2;
    }
    return 0;
  }
}
#endif /* RFID_USE_SAADC_RECEIVER */

