Wang860503/nrf5340_discrete_rfid/src/main.c
#if !RFID_USE_SAADC_RECEIVER
static uint32_t env_edge_window_smooth(uint32_t raw, uint32_t* prev1,
                                       uint32_t* prev2, uint8_t* warmup) {
#if EM_ENV_EDGE_MA_TAPS >= 3
  uint32_t sum = raw;
  uint32_t n = 1U;

  if (*warmup >= 1U) {
    sum += *prev1;
    n++;
  }
  if (*warmup >= 2U) {
    sum += *prev2;
    n++;
  }
  *prev2 = *prev1;
  *prev1 = raw;
  if (*warmup < 2U) {
    (*warmup)++;
  }
  return sum / n;
#else
  ARG_UNUSED(prev1);
  ARG_UNUSED(prev2);
  ARG_UNUSED(warmup);
  return raw;
#endif
}

static void comp_log_silent_hint(uint32_t env_windows,
                                 const uint32_t* env_duty_hist,
                                 uint32_t comp_edges);

#if RFID_USE_HIGH_RES_TIMER
static void rfid_high_res_timer_init(void) {
  nrf_timer_task_trigger(RFID_HIGH_RES_TIMER, NRF_TIMER_TASK_STOP);
  nrf_timer_mode_set(RFID_HIGH_RES_TIMER, NRF_TIMER_MODE_TIMER);
  nrf_timer_bit_width_set(RFID_HIGH_RES_TIMER, NRF_TIMER_BIT_WIDTH_32);
  /* nRF53 HAL：PRESCALER 指數；NRF_TIMER_FREQ_1MHz → 16MHz/2^4 = 1MHz */
  nrf_timer_prescaler_set(RFID_HIGH_RES_TIMER, (uint32_t)NRF_TIMER_FREQ_1MHz);
  nrf_timer_task_trigger(RFID_HIGH_RES_TIMER, NRF_TIMER_TASK_CLEAR);
  nrf_timer_task_trigger(RFID_HIGH_RES_TIMER, NRF_TIMER_TASK_START);
}

static uint32_t rfid_high_res_timer_get_us(void) {
  nrf_timer_task_trigger(RFID_HIGH_RES_TIMER, NRF_TIMER_TASK_CAPTURE0);
  return nrf_timer_cc_get(RFID_HIGH_RES_TIMER, NRF_TIMER_CC_CHANNEL0);
}
#endif

int em4095_comp_receiver(void) {
  int demod_counter = 0;
  uint32_t all_edges = 0;
  uint32_t comp_edges = 0;
  uint32_t phy_edges = 0;
  uint32_t raw_edges = 0;
  uint32_t max_gap_us = 0;
  uint32_t gap_lt_100 = 0;
  uint32_t gap_100_230 = 0;
  uint32_t gap_231_520 = 0;
  uint32_t gap_gt_520 = 0;
  uint32_t raw_accepted = 0;
  uint32_t raw_rejected = 0;
  uint32_t raw_short = 0;
  uint32_t raw_long = 0;
  uint32_t raw_other = 0;
  uint32_t env_windows = 0;
  uint32_t env_boot_sum = 0;
  uint32_t env_sum_edges = 0;
  uint32_t env_min_edges = 0xFFFFFFFFU;
  uint32_t env_max_edges = 0;
  uint32_t env_duty_boot_sum_x16 = 0;
  uint32_t env_duty_sum_x16 = 0;
  uint32_t env_duty_min_x16 = 0xFFFFFFFFU;
  uint32_t env_duty_max_x16 = 0;
  uint32_t env_duty_baseline_q8 = 0;
  uint32_t env_transitions = 0;
  uint32_t env_short = 0;
  uint32_t env_long = 0;
  uint32_t env_other = 0;
  uint32_t env_window_edges = 0;
  uint32_t env_window_samples = 0;
  uint32_t env_window_high_samples = 0;
  uint32_t env_baseline_q8 = 0;
  uint32_t env_high_windows = 0;
  uint32_t env_edge_hist[10] = {0};
  uint32_t env_duty_hist[17] = {0};
  int env_level_count = 0;

#if RFID_COMP_USE_NRFX_DIRECT
  if (!comp_nrfx_armed) {
    return 0;
  }
  comp_nrfx_irq_ready = 0;
  comp_nrfx_irq_cross = 0;
  comp_nrfx_irq_up = 0;
  comp_nrfx_irq_down = 0;
#else
  if (!device_is_ready(comp_dev)) {
    return 0;
  }
#endif

  k_sleep(K_MSEC(50));
  reset_em4100_confirm_pool();

#if RFID_COMP_USE_NRFX_DIRECT
  int stable = (int)nrfx_comp_sample();
#else
  int stable = comparator_get_output(comp_dev);
#endif
  uint8_t last_val = (stable > 0) ? 1 : 0;
#if RFID_USE_HIGH_RES_TIMER
  uint32_t t0 = rfid_high_res_timer_get_us();
#else
  uint32_t t0 = k_cycle_get_32();
#endif
  uint32_t last_phy_us = t0;
  uint32_t last_duty_sample_us = t0;
#if RFID_COMP_DIRECT_EDGE_DECODE && \
    (RFID_COMP_TICK_SOURCE == RFID_COMP_TICK_SOURCE_DEBOUNCE)
  uint32_t last_tick_store_us = 0;
#endif
  uint32_t env_window_start_us = t0;
  uint32_t last_env_transition_us = t0;
  uint64_t stop_time = k_uptime_get() + RFID_CAPTURE_WINDOW_MS;
  bool lead_sync_dropped = false;
  bool tick_window_slid = false;
  bool env_ready = false;
  uint8_t env_state = 0;
  uint8_t pending_env_state = 0;
  uint8_t pending_env_windows = 0;
  uint32_t env_ma_prev1 = 0;
  uint32_t env_ma_prev2 = 0;
  uint8_t env_ma_warmup = 0;

  while (k_uptime_get() < stop_time) {
#if RFID_COMP_USE_NRFX_DIRECT
    int current_val = (int)nrfx_comp_sample();
#else
    int current_val = comparator_get_output(comp_dev);
#endif
    if (current_val < 0) {
      continue;
    }

#if RFID_USE_HIGH_RES_TIMER
    uint32_t now = rfid_high_res_timer_get_us();
#else
    uint32_t now = k_cycle_get_32();
#endif

    if ((now - last_duty_sample_us) >= EM_ENV_DUTY_SAMPLE_US) {
      last_duty_sample_us = now;
      env_window_samples++;
      if (current_val > 0) {
        env_window_high_samples++;
      }
    }

    if (current_val != last_val) {
#if RFID_USE_HIGH_RES_TIMER
      uint32_t diff_phy = now - last_phy_us;
#else
      uint32_t diff_phy = k_cyc_to_us_near32(now - last_phy_us);
#endif

      all_edges++;
      if (diff_phy > max_gap_us) max_gap_us = diff_phy;
      if (diff_phy < 100) {
        gap_lt_100++;
      } else if (diff_phy <= 230) {
        gap_100_230++;
      } else if (diff_phy <= 520) {
        gap_231_520++;
      } else {
        gap_gt_520++;
      }
      env_window_edges++;
      comp_edges++;
      phy_edges++;
      raw_edges++;
      if (diff_phy >= EM_EDGE_MIN_US) {
        raw_accepted++;
        if (diff_phy >= EM_SHORT_MIN && diff_phy <= EM_SHORT_MAX) {
          raw_short++;
        } else if (diff_phy >= EM_LONG_MIN && diff_phy <= EM_LONG_MAX) {
          raw_long++;
        } else {
          raw_other++;
        }
      } else {
        raw_rejected++;
      }
#if RFID_COMP_DIRECT_EDGE_DECODE && \
    (RFID_COMP_TICK_SOURCE == RFID_COMP_TICK_SOURCE_DEBOUNCE)
      /* 診斷：固定週期抽樣 CMP；間隔幾乎恆為 debounce_us（缺 2T） */
      {
        const uint32_t since_store =
            last_tick_store_us == 0U ? 0U : (now - last_tick_store_us);

        if (last_tick_store_us == 0U ||
            since_store >= RFID_COMP_DEBOUNCE_TICK_US) {
          if (last_tick_store_us != 0U) {
            const uint8_t lvl = (uint8_t)(current_val > 0 ? 1 : 0);

            tick_buffer_append(since_store, lvl, &demod_counter,
                               &tick_window_slid);
            raw_accepted++;
            if (since_store >= EM_SHORT_MIN && since_store <= EM_SHORT_MAX) {
              env_short++;
            } else if (since_store >= EM_LONG_MIN &&
                       since_store <= EM_LONG_MAX) {
              env_long++;
            } else {
              env_other++;
            }
          }
          last_tick_store_us = now;
        }
      }
#endif
      last_phy_us = now;
      last_val = (uint8_t)(current_val > 0 ? 1 : 0);
    }

    if ((now - env_window_start_us) >= EM_ENV_WINDOW_US) {
      const uint32_t edge_smooth = env_edge_window_smooth(
          env_window_edges, &env_ma_prev1, &env_ma_prev2, &env_ma_warmup);
      const uint32_t edge_count_x16 = edge_smooth << 4;
      const uint32_t duty_x16 =
          env_window_samples
              ? ((env_window_high_samples << 4) / env_window_samples)
              : 0;

