Wang860503/nrf5340_discrete_rfid/src/main.c
      env_windows++;
      env_sum_edges += edge_smooth;
      if (edge_smooth < env_min_edges) env_min_edges = edge_smooth;
      if (edge_smooth > env_max_edges) env_max_edges = edge_smooth;
      env_edge_hist[edge_smooth < 9U ? edge_smooth : 9U]++;
      env_duty_sum_x16 += duty_x16;
      if (duty_x16 < env_duty_min_x16) env_duty_min_x16 = duty_x16;
      if (duty_x16 > env_duty_max_x16) env_duty_max_x16 = duty_x16;
      env_duty_hist[duty_x16 <= 16U ? duty_x16 : 16U]++;

      if (!env_ready) {
        env_boot_sum += edge_smooth;
        env_duty_boot_sum_x16 += duty_x16;
        if (env_windows >= EM_ENV_BOOT_WINDOWS) {
          env_baseline_q8 = (env_boot_sum << 12) / env_windows;
          env_duty_baseline_q8 = (env_duty_boot_sum_x16 << 8) / env_windows;
#if EM_ENV_USE_DUTY_LEVEL
          env_state = ((duty_x16 << 8) >
                       env_duty_baseline_q8 + (EM_ENV_DUTY_THRESHOLD_X16 << 8))
                          ? 1
                          : 0;
#else
          env_state = ((edge_count_x16 << 8) >
                       env_baseline_q8 + (EM_ENV_THRESHOLD_X16 << 8))
                          ? 1
                          : 0;
#endif
          pending_env_state = env_state;
          pending_env_windows = 0;
          last_env_transition_us = now;
          env_ready = true;
        }
      } else {
        uint8_t next_env_state = env_state;

#if EM_ENV_USE_DUTY_LEVEL
        const uint32_t duty_q8 = duty_x16 << 8;
        const uint32_t duty_threshold_q8 = EM_ENV_DUTY_THRESHOLD_X16 << 8;
        if (duty_q8 > env_duty_baseline_q8 + duty_threshold_q8) {
          next_env_state = 1;
        } else if (duty_q8 + duty_threshold_q8 < env_duty_baseline_q8) {
          next_env_state = 0;
        }
#else
        const uint32_t edge_count_q8 = edge_count_x16 << 8;
        const uint32_t edge_threshold_q8 = EM_ENV_THRESHOLD_X16 << 8;
        if (edge_count_q8 > env_baseline_q8 + edge_threshold_q8) {
          next_env_state = 1;
        } else if (edge_count_q8 + edge_threshold_q8 < env_baseline_q8) {
          next_env_state = 0;
        }
#endif

        if (next_env_state != env_state) {
          if (next_env_state == pending_env_state) {
            if (pending_env_windows < UINT8_MAX) pending_env_windows++;
          } else {
            pending_env_state = next_env_state;
            pending_env_windows = 1;
          }
        } else {
          pending_env_state = env_state;
          pending_env_windows = 0;
        }

        if (next_env_state != env_state &&
            pending_env_windows >= EM_ENV_STATE_STABLE_WINDOWS) {
          uint32_t diff_env = now - last_env_transition_us;

          if (diff_env >= EM_ENV_MIN_TICK_US) {
            env_state = next_env_state;
            pending_env_state = env_state;
            pending_env_windows = 0;
            last_env_transition_us = now;
            env_transitions++;

            if (diff_env >= EM_SHORT_MIN && diff_env <= EM_SHORT_MAX) {
              env_short++;
            } else if (diff_env >= EM_LONG_MIN && diff_env <= EM_LONG_MAX) {
              env_long++;
            } else {
              env_other++;
            }

#if RFID_COMP_DIRECT_EDGE_DECODE && \
    (RFID_COMP_TICK_SOURCE == RFID_COMP_TICK_SOURCE_ENV)
            /* env HIGH=載波 ON；EM4100 Manchester：HIGH=carrier OFF */
            {
              bool store_env_tick = true;

              if (!lead_sync_dropped) {
                lead_sync_dropped = true;
                if (diff_env <= EM_SKIP_FIRST_GAP_US) {
                  store_env_tick = false;
                }
              }
              if (store_env_tick) {
                tick_buffer_append(diff_env, env_state ^ 1U, &demod_counter,
                                   &tick_window_slid);
              }
            }
#endif
          }
        }

        env_baseline_q8 = ((env_baseline_q8 * EM_ENV_BASELINE_WEIGHT) +
                           (edge_count_x16 << 8)) /
                          (EM_ENV_BASELINE_WEIGHT + 1U);
        env_duty_baseline_q8 =
            ((env_duty_baseline_q8 * EM_ENV_BASELINE_WEIGHT) +
             (duty_x16 << 8)) /
            (EM_ENV_BASELINE_WEIGHT + 1U);
      }

      if (env_ready && env_level_count < EM_ENV_LEVEL_CAP) {
        env_edge_samples[env_level_count] =
            edge_smooth > UINT8_MAX ? UINT8_MAX : (uint8_t)edge_smooth;
        env_level_samples[env_level_count++] = env_state;
        if (env_state) env_high_windows++;
      }

      env_window_edges = 0;
      env_window_samples = 0;
      env_window_high_samples = 0;
      env_window_start_us = now;
    }
  }

#if RFID_DECODE_DIAG_LOG
  LOG_INF(
      "scan: raw_edges=%u phy_edges=%u comp_edges=%u all_edges=%u stored=%d "
      "max_gap_us=%u",
      raw_edges, phy_edges, comp_edges, all_edges, demod_counter, max_gap_us);
#if RFID_COMP_USE_NRFX_DIRECT
  LOG_INF("comp_nrfx_irq: ready=%u cross=%u up=%u down=%u",
          (unsigned)comp_nrfx_irq_ready, (unsigned)comp_nrfx_irq_cross,
          (unsigned)comp_nrfx_irq_up, (unsigned)comp_nrfx_irq_down);
  comp_log_silent_hint(env_windows, env_duty_hist, comp_edges);
#endif
  LOG_INF("gap_hist: <100=%u 100-230=%u 231-520=%u >520=%u", gap_lt_100,
          gap_100_230, gap_231_520, gap_gt_520);
  LOG_INF("raw_ticks: accepted=%u rejected_lt_%u=%u short=%u long=%u other=%u",
          raw_accepted, EM_EDGE_MIN_US, raw_rejected, raw_short, raw_long,
          raw_other);
  LOG_INF(
      "env: windows=%u win_us=%u ma=%u edge_avg_x16=%u min=%u max=%u "
      "baseline_x16=%u",
      env_windows, EM_ENV_WINDOW_US, EM_ENV_EDGE_MA_TAPS,
      env_windows ? ((env_sum_edges << 4) / env_windows) : 0,
      env_min_edges == 0xFFFFFFFFU ? 0 : env_min_edges, env_max_edges,
      (env_baseline_q8 + 128U) >> 8);
  LOG_INF("env_duty: avg_x16=%u min=%u max=%u baseline_x16=%u",
          env_windows ? (env_duty_sum_x16 / env_windows) : 0,
          env_duty_min_x16 == 0xFFFFFFFFU ? 0 : env_duty_min_x16,
          env_duty_max_x16, (env_duty_baseline_q8 + 128U) >> 8);
  LOG_INF("duty_hist: 0=%u 1=%u 2=%u 3=%u 4=%u 5=%u 6=%u 7=%u",
          env_duty_hist[0], env_duty_hist[1], env_duty_hist[2],
          env_duty_hist[3], env_duty_hist[4], env_duty_hist[5],
          env_duty_hist[6], env_duty_hist[7]);
  LOG_INF("duty_hist: 8=%u 9=%u 10=%u 11=%u 12=%u 13=%u 14=%u 15=%u 16=%u",
          env_duty_hist[8], env_duty_hist[9], env_duty_hist[10],
          env_duty_hist[11], env_duty_hist[12], env_duty_hist[13],
          env_duty_hist[14], env_duty_hist[15], env_duty_hist[16]);
  LOG_INF("env_hist: 0=%u 1=%u 2=%u 3=%u 4=%u 5=%u 6=%u 7=%u 8=%u 9+=%u",
          env_edge_hist[0], env_edge_hist[1], env_edge_hist[2],
          env_edge_hist[3], env_edge_hist[4], env_edge_hist[5],
          env_edge_hist[6], env_edge_hist[7], env_edge_hist[8],
          env_edge_hist[9]);
  LOG_INF(
      "env_ticks: transitions=%u short=%u long=%u other=%u levels=%d high=%u "
      "slid=%d",
      env_transitions, env_short, env_long, env_other, env_level_count,
      env_high_windows, tick_window_slid);

  if (demod_counter > 0) {
    LOG_INF("Env fingerprint: %u, %u, %u, %u, %u, %u, %u, %u, %u, %u",
            demod_counter > 0 ? tick_buffer[0] : 0,
            demod_counter > 1 ? tick_buffer[1] : 0,
            demod_counter > 2 ? tick_buffer[2] : 0,
            demod_counter > 3 ? tick_buffer[3] : 0,
            demod_counter > 4 ? tick_buffer[4] : 0,
            demod_counter > 5 ? tick_buffer[5] : 0,
            demod_counter > 6 ? tick_buffer[6] : 0,
            demod_counter > 7 ? tick_buffer[7] : 0,
            demod_counter > 8 ? tick_buffer[8] : 0,
            demod_counter > 9 ? tick_buffer[9] : 0);
  }
#endif /* RFID_DECODE_DIAG_LOG */

#if RFID_COMP_DIRECT_EDGE_DECODE
#if RFID_DECODE_DIAG_LOG
  LOG_INF(
      "tick_path: %s stored=%d short=%u long=%u env_trans=%u carrier_rej=%u",
#if RFID_COMP_TICK_SOURCE == RFID_COMP_TICK_SOURCE_DEBOUNCE
      "debounce",
#else
      "env128",
#endif
      demod_counter, env_short, env_long, env_transitions, raw_rejected);
#if RFID_COMP_TICK_SOURCE == RFID_COMP_TICK_SOURCE_DEBOUNCE
  LOG_INF("tick_path: debounce_us=%u (expect mostly 1T gaps)",
          RFID_COMP_DEBOUNCE_TICK_US);
#else
  if (demod_counter == 0) {
    LOG_INF("tick_path: no env ticks (card coupling / env threshold)");
  }
#endif
#endif /* RFID_DECODE_DIAG_LOG */
  if ((uint32_t)demod_counter < RFID_COMP_DIRECT_CARD_MIN_EDGES) {
#if RFID_DECODE_DIAG_LOG
    LOG_INF("card_gate_skip(direct): stored=%d/%u", demod_counter,
            RFID_COMP_DIRECT_CARD_MIN_EDGES);
#endif
    reset_cross_scan_vote_pool();
    reset_row_vote_pool();
    reset_em4100_card_session();
    return 0;
  }
#else
  if (all_edges < EM_RAW_CARD_MIN_EDGES) {
#if RFID_DECODE_DIAG_LOG
    LOG_INF("card_gate_skip: all=%u/%u comp=%u phy=%u raw=%u trans=%u short=%u",
            all_edges, EM_RAW_CARD_MIN_EDGES, comp_edges, phy_edges, raw_edges,
            env_transitions, env_short);
#endif
    reset_cross_scan_vote_pool();
    reset_row_vote_pool();
    reset_em4100_card_session();
    return 0;
  }

  if (env_transitions < EM_CARD_MIN_ENV_TRANSITIONS ||
      env_short < EM_CARD_MIN_ENV_SHORT) {
#if RFID_DECODE_DIAG_LOG
    LOG_INF(
        "card_gate_skip: all=%u comp=%u phy=%u raw=%u trans=%u/%u short=%u/%u",
        all_edges, comp_edges, phy_edges, raw_edges, env_transitions,
        EM_CARD_MIN_ENV_TRANSITIONS, env_short, EM_CARD_MIN_ENV_SHORT);
#endif
    reset_cross_scan_vote_pool();
    reset_row_vote_pool();
    reset_em4100_card_session();
    return 0;
  }
#endif

