Wang860503/nrf5340_discrete_rfid/src/main.c
#if RFID_DECODE_DIAG_LOG
  LOG_INF(
      "[CARD-ACTIVE] all=%u comp=%u phy=%u raw=%u trans=%u short=%u long=%u",
      all_edges, comp_edges, phy_edges, raw_edges, env_transitions, env_short,
      env_long);
#endif

#if RFID_COMP_DIRECT_EDGE_DECODE
  /* 直接邊緣模式：需要至少 20 個 LONG 間隔才能可靠解碼 */
  if (env_long < EM_MIN_LONG_TICKS_TO_DECODE) {
#if RFID_DECODE_DIAG_LOG
    LOG_INF("decode_skip(direct): stored=%d long=%u/%u short=%u", demod_counter,
            env_long, EM_MIN_LONG_TICKS_TO_DECODE, env_short);
#endif
#if !RFID_LOG_MINIMAL
    LOG_WRN(
        "[CARD-PRESENT] direct_edges=%d, but not enough LONG intervals (%u)",
        demod_counter, env_long);
#endif
    reset_cross_scan_vote_pool();
    return 2;
  }
#else
  if (demod_counter < EM_MIN_STORED_TO_DECODE ||
      env_long < EM_MIN_LONG_TICKS_TO_DECODE) {
#if RFID_DECODE_DIAG_LOG
    LOG_INF("decode_skip: stored=%d/%u env_long=%u/%u", demod_counter,
            EM_MIN_STORED_TO_DECODE, env_long, EM_MIN_LONG_TICKS_TO_DECODE);
#endif
#if !RFID_LOG_MINIMAL
    LOG_WRN(
        "[CARD-PRESENT] all_edges=%u comp_edges=%u phy_edges=%u raw_edges=%u, "
        "but envelope ticks are not decodable",
        all_edges, comp_edges, phy_edges, raw_edges);
#endif
    reset_cross_scan_vote_pool();
    return 2;
  }
#endif

#if EM_ENABLE_TICK_FALLBACK_DIAG
  {
    uint64_t code;
    int bits = 0;
    bool inverted = false;
    int slide =
        try_comp_env_tick_decode(demod_counter, &code, &bits, &inverted);

    if (slide >= 0) {
      reset_cross_scan_vote_pool();
      return 1;
    }
  }
#endif

#if RFID_DECODE_DIAG_LOG
  LOG_INF("Fingerprint: %u, %u, %u, %u, %u, %u, %u, %u, %u, %u", tick_buffer[0],
          tick_buffer[1], tick_buffer[2], tick_buffer[3], tick_buffer[4],
          tick_buffer[5], tick_buffer[6], tick_buffer[7], tick_buffer[8],
          tick_buffer[9]);
#endif
#if !RFID_LOG_MINIMAL
  LOG_WRN(
      "[CARD-PRESENT] all_edges=%u comp_edges=%u phy_edges=%u raw_edges=%u, "
      "but no valid EM4100 frame yet",
      all_edges, comp_edges, phy_edges, raw_edges);
#endif
  return 2;
}
#endif

#if !RFID_USE_SAADC_RECEIVER
static void comp_log_customer_hw_expectations(void) {
  LOG_INF(
      "RX HW: P0.04=CMP_P slow (R16/C43, TP2); P0.05=CMP_N fast (R19/C42, "
      "TP3)");
  LOG_INF(
      "RX HW: 1V65_LF biases op-amp only — do NOT tie P0.05 to fixed 1.65V");
  LOG_INF(
      "RX scope: TP2/TP3 = envelope data slice (~256/512us), NOT 125kHz "
      "carrier");
#if RFID_COMP_DIRECT_EDGE_DECODE
  LOG_INF(
      "RX FW: DIFF th=0/0 hyst~50mV; edge gaps %u..%u us (DEMOD_OUT / ACMP "
      "PD3/PD4)",
      EM_EDGE_MIN_US, RFID_COMP_DIRECT_LONG_MAX_US);
#else
  LOG_INF("RX FW: ENV %uus windows count carrier edges (non-Mavericks path)",
          EM_ENV_WINDOW_US);
#endif
}

static void comp_log_silent_hint(uint32_t env_windows,
                                 const uint32_t* env_duty_hist,
                                 uint32_t comp_edges) {
  const char* stuck = "no-toggle";

  if (comp_edges != 0U) {
    return;
  }
  if (env_windows > 0U && env_duty_hist[0] == env_windows) {
    stuck = "stuck-LOW(CMP_P<CMP_N)";
  } else if (env_windows > 0U && env_duty_hist[16] == env_windows) {
    stuck = "stuck-HIGH(CMP_P>CMP_N)";
  }
  LOG_WRN("COMP silent (%s): verify TP2/TP3 waveforms cross; PWM carrier on",
          stuck);
}

static void comp_force_max_hysteresis(void) {
#if defined(NRF_COMP) && defined(NRF_COMP_HYST_50MV)
  nrf_comp_hysteresis_set(NRF_COMP, NRF_COMP_HYST_50MV);
  LOG_INF("COMP: HAL hysteresis forced to 50mV (Nordic max, vs SL 30mV sym)");
#elif defined(NRF_COMP) && defined(NRF_COMP_HYST_40MV)
  nrf_comp_hysteresis_set(NRF_COMP, NRF_COMP_HYST_40MV);
  LOG_INF("COMP: HAL hysteresis forced to 40mV");
#else
  LOG_INF("COMP: HAL hysteresis force unavailable on this target");
#endif
}

#if RFID_COMP_USE_NRFX_DIRECT
static void comp_nrfx_event_handler(nrf_comp_event_t event) {
  switch (event) {
    case NRF_COMP_EVENT_READY:
      comp_nrfx_irq_ready++;
      break;
    case NRF_COMP_EVENT_CROSS:
      comp_nrfx_irq_cross++;
      break;
    case NRF_COMP_EVENT_UP:
      comp_nrfx_irq_up++;
      break;
    case NRF_COMP_EVENT_DOWN:
      comp_nrfx_irq_down++;
      break;
    default:
      break;
  }
}

static nrfx_comp_config_t comp_nrfx_build_config(void) {
#if RFID_COMP_USE_INTERNAL_THRESHOLD
  return (nrfx_comp_config_t){
      .reference = NRF_COMP_REF_INT_1V8,
      .ext_ref = NRF_COMP_EXT_REF_1,
      .main_mode = NRF_COMP_MAIN_MODE_SE,
      .threshold =
          {
              .th_down = RFID_COMP_THRESHOLD_DOWN,
              .th_up = RFID_COMP_THRESHOLD_UP,
          },
      .speed_mode = RFID_COMP_SP_MODE,
      .hyst = NRF_COMP_HYST_NO_HYST,
      .isource = RFID_COMP_ISOURCE,
      /* P0.04=AIN0=CMP_P；nRF5340 COMP INPUT_0 對應 P0.04 */
      .input = NRF_COMP_INPUT_0,
      .interrupt_priority = NRFX_COMP_DEFAULT_CONFIG_IRQ_PRIORITY,
  };
#else
  /* DIFF：VIN+=AIN0(CMP_P 慢)、VIN-=AIN1(CMP_N 快)。須 REF_AREF 才會寫入
   * EXTREFSEL； 若用 INT_1V8，nrfx 不會接 AIN1，等於單端對內部 1.8V（與示波器
   * CH1-CH2 不一致）。 */
  return (nrfx_comp_config_t){
      .reference = NRF_COMP_REF_AREF,
      .ext_ref = NRF_COMP_EXT_REF_1,
      .main_mode = NRF_COMP_MAIN_MODE_DIFF,
      .threshold = {.th_down = 0, .th_up = 0},
      .speed_mode = NRF_COMP_SP_MODE_HIGH,
      .hyst = NRF_COMP_HYST_50MV,
      .isource = RFID_COMP_ISOURCE,
      .input = NRF_COMP_INPUT_0,
      .interrupt_priority = NRFX_COMP_DEFAULT_CONFIG_IRQ_PRIORITY,
  };
#endif
}

static int comp_nrfx_arm_receiver(void) {
  nrfx_err_t err;
  nrfx_comp_config_t comp_cfg = comp_nrfx_build_config();

  comp_nrfx_armed = false;

#if RFID_COMP_RX_GPIO_PINCNF_ENABLE
  rfid_rx_ain_gpio_configure();
#endif

#if defined(__ZEPHYR__)
  if (!nrfx_comp_init_check()) {
    IRQ_CONNECT(NRFX_IRQ_NUMBER_GET(NRF_COMP), IRQ_PRIO_LOWEST,
                nrfx_comp_irq_handler, 0, 0);
    irq_enable(NRFX_IRQ_NUMBER_GET(NRF_COMP));
  }
#endif

  if (!nrfx_comp_init_check()) {
    err = nrfx_comp_init(&comp_cfg, comp_nrfx_event_handler);
    if (err != NRFX_SUCCESS) {
      LOG_ERR("nrfx_comp_init failed: %d", err);
      return -EIO;
    }
  } else {
    err = nrfx_comp_reconfigure(&comp_cfg);
    if (err != NRFX_SUCCESS) {
      LOG_ERR("nrfx_comp_reconfigure failed: %d", err);
      return -EIO;
    }
  }

  comp_force_max_hysteresis();
#if !RFID_COMP_USE_INTERNAL_THRESHOLD
  /* 再寫一次，避免 reconfigure 路徑漏接 AIN1（對齊 Zephyr
   * comp_nrf_comp_configure_diff） */
  nrf_comp_ref_set(NRF_COMP, NRF_COMP_REF_AREF);
  nrf_comp_ext_ref_set(NRF_COMP, NRF_COMP_EXT_REF_1);
  nrf_comp_input_select(NRF_COMP, NRF_COMP_INPUT_0);
  nrf_comp_main_mode_set(NRF_COMP, NRF_COMP_MAIN_MODE_DIFF);
#endif
#if RFID_COMP_USE_INTERNAL_THRESHOLD
#if RFID_COMP_RX_GPIO_PINCNF_ENABLE
  LOG_INF("COMP nrfx: SE th=%u/%u sp=%s isource=%d gpio=%s",
          RFID_COMP_THRESHOLD_DOWN, RFID_COMP_THRESHOLD_UP,
          (RFID_COMP_SP_MODE == NRF_COMP_SP_MODE_LOW) ? "LOW" : "HIGH",
          (int)RFID_COMP_ISOURCE,
          rfid_rx_gpio_drive_name(RFID_COMP_RX_GPIO_DRIVE));
#else
  LOG_INF("COMP nrfx: SE th=%u/%u sp=%s isource=%d gpio=off",
          RFID_COMP_THRESHOLD_DOWN, RFID_COMP_THRESHOLD_UP,
          (RFID_COMP_SP_MODE == NRF_COMP_SP_MODE_LOW) ? "LOW" : "HIGH",
          (int)RFID_COMP_ISOURCE);
#endif
#else
  LOG_INF(
      "COMP nrfx: DIFF AREF AIN0(CMP_P) vs AIN1(CMP_N) th=0/0 sp=HIGH "
      "hyst=50mV");
  comp_log_customer_hw_expectations();
#endif

  nrfx_comp_start(NRF_COMP_INT_CROSS_MASK | NRF_COMP_INT_UP_MASK |
                      NRF_COMP_INT_DOWN_MASK | NRF_COMP_INT_READY_MASK,
                  0);
  comp_nrfx_armed = true;
  LOG_INF("nRF5340 COMP receiver armed (nrfx, poll + IRQ stats)");
  return 0;
}
#endif /* RFID_COMP_USE_NRFX_DIRECT */

static void comp_reapply_receiver_config(void) {
#if RFID_COMP_USE_NRFX_DIRECT
  nrf_gpio_cfg(RFID_RX_AIN0_PIN, NRF_GPIO_PIN_DIR_INPUT,
               NRF_GPIO_PIN_INPUT_DISCONNECT, NRF_GPIO_PIN_NOPULL,
               NRF_GPIO_PIN_S0S1, NRF_GPIO_PIN_NOSENSE);

  nrf_gpio_cfg(RFID_RX_AIN1_PIN, NRF_GPIO_PIN_DIR_INPUT,
               NRF_GPIO_PIN_INPUT_DISCONNECT, NRF_GPIO_PIN_NOPULL,
               NRF_GPIO_PIN_S0S1, NRF_GPIO_PIN_NOSENSE);
  (void)comp_nrfx_arm_receiver();
#else
  if (!device_is_ready(comp_dev)) {
    return;
  }
#if RFID_COMP_USE_INTERNAL_THRESHOLD
  const struct comp_nrf_comp_se_config cfg = {
      .psel = COMP_NRF_COMP_PSEL_AIN0,
      .sp_mode = COMP_NRF_COMP_SP_MODE_HIGH,
      .isource = COMP_NRF_COMP_ISOURCE_DISABLED,
      .extrefsel = COMP_NRF_COMP_EXTREFSEL_AIN1,
      .refsel = RFID_COMP_REFSEL,
      .th_down = RFID_COMP_THRESHOLD_DOWN,
      .th_up = RFID_COMP_THRESHOLD_UP,
  };
  int r = comp_nrf_comp_configure_se(comp_dev, &cfg);
  if (r != 0) {
    LOG_WRN("comp re-apply SE AIN0/internal-ref failed: %d", r);
  } else {
    comp_force_max_hysteresis();
    LOG_INF("COMP: SE AIN0 vs INT1V8 th_up=%u th_down=%u",
            RFID_COMP_THRESHOLD_UP, RFID_COMP_THRESHOLD_DOWN);
  }
#else
  const struct comp_nrf_comp_diff_config cfg = {
      .psel = COMP_NRF_COMP_PSEL_AIN0,
      .sp_mode = COMP_NRF_COMP_SP_MODE_HIGH,
      .isource = COMP_NRF_COMP_ISOURCE_DISABLED,
      .extrefsel = COMP_NRF_COMP_EXTREFSEL_AIN1,
      .enable_hyst = true,
  };
  int r = comp_nrf_comp_configure_diff(comp_dev, &cfg);
  if (r != 0) {
    LOG_WRN("comp re-apply diff AIN0/AIN1 failed: %d", r);
  } else {
    LOG_INF("COMP: DIFF AIN0 vs AIN1 + hysteresis ON (Zephyr shim)");
  }
#endif
#endif /* !RFID_COMP_USE_NRFX_DIRECT */
}
#endif /* !RFID_USE_SAADC_RECEIVER */

int main(void) {
  int carrier_ret;
#if RFID_PWM_DTI_AB_SCAN_ENABLE
  size_t dti_ab_index = 0U;
  int64_t dti_ab_next_switch_ms = 0;
#endif

  LOG_INF("nRF5340 Discrete RFID Starting...");
#if RFID_BOOT_SELFTEST_LOG
  em4100_decode_self_test();
#endif
#if RFID_USE_HIGH_RES_TIMER
  rfid_high_res_timer_init();
  LOG_INF("RF timing: TIMER1 1MHz (1us/tick)");
#endif

#if RFID_USE_SAADC_RECEIVER
  LOG_INF("RX path: SAADC differential AIN0-AIN1");
#else
  LOG_INF(
      "RX path: COMP %s (%s) th=%u/%u sp=%s gpio=%s duty=%u",
      RFID_COMP_USE_INTERNAL_THRESHOLD ? "SE AIN0/INT1V8" : "DIFF AIN0/AIN1",
      RFID_COMP_USE_NRFX_DIRECT ? "nrfx" : "zephyr", RFID_COMP_THRESHOLD_DOWN,
      RFID_COMP_THRESHOLD_UP,
      RFID_COMP_USE_INTERNAL_THRESHOLD
          ? ((RFID_COMP_SP_MODE == NRF_COMP_SP_MODE_LOW) ? "LOW" : "HIGH")
          : "HIGH",
#if RFID_COMP_RX_GPIO_PINCNF_ENABLE
      rfid_rx_gpio_drive_name(RFID_COMP_RX_GPIO_DRIVE),
#else
      "off",
#endif
      RFID_PWM_DUTY_REFERENCE);
  comp_log_customer_hw_expectations();
  comp_reapply_receiver_config();
#endif

