Wang860503/nrf5340_discrete_rfid/src/main.c
#if RFID_PWM_DTI_AB_SCAN_ENABLE
  rfid_pwm_apply_dti_profile(dti_ab_index);
  dti_ab_next_switch_ms =
      k_uptime_get() + (int64_t)RFID_PWM_DTI_AB_SCAN_INTERVAL_MS;
#endif

  carrier_ret = rfid_pwm_apply_duty(RFID_PWM_DUTY_REFERENCE);
  if (carrier_ret != 0) {
    LOG_ERR("Carrier PWM wave start failed, ret=%d", carrier_ret);
    k_sleep(K_MSEC(1500));
  } else {
    LOG_INF("PWM carrier: duty=%u dti=%d dead_rise=%u dead_fall=%u",
            RFID_PWM_DUTY_REFERENCE, RFID_PWM_DTI_ENABLE,
            (unsigned)rfid_pwm_dead_rise_ticks,
            (unsigned)rfid_pwm_dead_fall_ticks);
#if RFID_PWM_DTI_AB_SCAN_ENABLE
    LOG_INF("DTI A/B scan: %u profiles x %u ms (card on antenna)",
            (unsigned)TEST_RISE_FALL_PAIRS_COUNT,
            (unsigned)RFID_PWM_DTI_AB_SCAN_INTERVAL_MS);
#endif
#if !RFID_USE_SAADC_RECEIVER && RFID_COMP_USE_NRFX_DIRECT
    {
      int boot_sample = (int)nrfx_comp_sample();

      LOG_INF(
          "COMP sample after PWM=%d (1=CMP_P>CMP_N); card@TP2/TP3 should "
          "toggle",
          boot_sample);
    }
#endif
  }

  while (!carrier_ret) {
#if RFID_PWM_DTI_AB_SCAN_ENABLE
    if (k_uptime_get() >= dti_ab_next_switch_ms) {
      dti_ab_index = (dti_ab_index + 1U) % TEST_RISE_FALL_PAIRS_COUNT;
      rfid_pwm_apply_dti_profile(dti_ab_index);
      carrier_ret = rfid_pwm_apply_duty(RFID_PWM_DUTY_REFERENCE);
      if (carrier_ret != 0) {
        LOG_ERR("DTI A/B switch failed ret=%d profile=%u", carrier_ret,
                (unsigned)dti_ab_index);
        break;
      }
      LOG_INF("DTI A/B profile[%u/%u]: rise=%u fall=%u duty=%u",
              (unsigned)dti_ab_index + 1U, (unsigned)TEST_RISE_FALL_PAIRS_COUNT,
              (unsigned)rfid_pwm_dead_rise_ticks,
              (unsigned)rfid_pwm_dead_fall_ticks,
              (unsigned)RFID_PWM_DUTY_REFERENCE);
      dti_ab_next_switch_ms =
          k_uptime_get() + (int64_t)RFID_PWM_DTI_AB_SCAN_INTERVAL_MS;
    }
#endif
#if RFID_USE_SAADC_RECEIVER
    if (!em4095_saadc_receiver()) {
#else
    if (!em4095_comp_receiver()) {
#endif
#if RFID_MAIN_IDLE_LOG
      LOG_INF("No card detected.");
#endif
    }

    k_sleep(K_MSEC(500));
  }
  return 0;
}